/* automatically generated by rust-bindgen 0.72.1 */

#[allow(non_snake_case, non_camel_case_types, non_upper_case_globals)]
pub mod root {
    #[allow(unused_imports)]
    use self::super::root;
    pub use crate::glue::EncodedStringCallback;
    pub(crate) use crate::jsapi::*;
    pub mod std {
        #[allow(unused_imports)]
        use self::super::super::root;
        pub mod __swappable_details {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
        pub mod __swappable_with_details {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
        pub mod __detail {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            pub mod __variant {
                #[allow(unused_imports)]
                use self::super::super::super::super::root;
            }
        }
        pub mod __exception_ptr {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
        pub mod pmr {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
        pub mod __adl_only {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
        pub mod placeholders {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
    }
    pub mod __gnu_cxx {
        #[allow(unused_imports)]

            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
        pub mod frontend {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
    }
    pub mod JS {
        #[allow(unused_imports)]
        use self::super::super::root;
        pub(crate) use crate::jsapi::JS::*;
        pub mod detail {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
        pub mod shadow {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
        pub mod Scalar {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
        pub mod dbg {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
    }
    pub mod IPC {
        #[allow(unused_imports)]
        use self::super::super::root;
    }
    pub type WantToMeasure =
        ::std::option::Option<unsafe extern "C" fn(obj: *mut root::JSObject) -> bool>;
    pub type GetSize =
        ::std::option::Option<unsafe extern "C" fn(obj: *mut root::JSObject) -> usize>;
    extern "C" {
        pub static mut gWantToMeasure: root::WantToMeasure;
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, PartialEq)]
    pub struct JobQueueTraps {
        pub getHostDefinedData: ::std::option::Option<
            unsafe extern "C" fn(
                queue: *const ::std::os::raw::c_void,
                cx: *mut root::JSContext,
                data: root::JS::MutableHandle<*mut root::JSObject>,
            ) -> bool,
        >,
        pub enqueuePromiseJob: ::std::option::Option<
            unsafe extern "C" fn(
                queue: *const ::std::os::raw::c_void,
                cx: *mut root::JSContext,
                promise: root::JS::HandleObject,
                job: root::JS::HandleObject,
                allocationSite: root::JS::HandleObject,
                hostDefinedData: root::JS::HandleObject,
            ) -> bool,
        >,
        pub runJobs: ::std::option::Option<
            unsafe extern "C" fn(queue: *const ::std::os::raw::c_void, cx: *mut root::JSContext),
        >,
        pub empty: ::std::option::Option<
            unsafe extern "C" fn(queue: *const ::std::os::raw::c_void) -> bool,
        >,
        pub pushNewInterruptQueue: ::std::option::Option<
            unsafe extern "C" fn(
                aInterruptQueues: *mut ::std::os::raw::c_void,
            ) -> *const ::std::os::raw::c_void,
        >,
        pub popInterruptQueue: ::std::option::Option<
            unsafe extern "C" fn(
                aInterruptQueues: *mut ::std::os::raw::c_void,
            ) -> *const ::std::os::raw::c_void,
        >,
        pub dropInterruptQueues: ::std::option::Option<
            unsafe extern "C" fn(aInterruptQueues: *mut ::std::os::raw::c_void),
        >,
    }
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of JobQueueTraps"][::std::mem::size_of::<JobQueueTraps>() - 56usize];
        ["Alignment of JobQueueTraps"][::std::mem::align_of::<JobQueueTraps>() - 8usize];
        ["Offset of field: JobQueueTraps::getHostDefinedData"]
            [::std::mem::offset_of!(JobQueueTraps, getHostDefinedData) - 0usize];
        ["Offset of field: JobQueueTraps::enqueuePromiseJob"]
            [::std::mem::offset_of!(JobQueueTraps, enqueuePromiseJob) - 8usize];
        ["Offset of field: JobQueueTraps::runJobs"]
            [::std::mem::offset_of!(JobQueueTraps, runJobs) - 16usize];
        ["Offset of field: JobQueueTraps::empty"]
            [::std::mem::offset_of!(JobQueueTraps, empty) - 24usize];
        ["Offset of field: JobQueueTraps::pushNewInterruptQueue"]
            [::std::mem::offset_of!(JobQueueTraps, pushNewInterruptQueue) - 32usize];
        ["Offset of field: JobQueueTraps::popInterruptQueue"]
            [::std::mem::offset_of!(JobQueueTraps, popInterruptQueue) - 40usize];
        ["Offset of field: JobQueueTraps::dropInterruptQueues"]
            [::std::mem::offset_of!(JobQueueTraps, dropInterruptQueues) - 48usize];
    };
    #[repr(C)]
    pub struct RustJobQueue__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    pub struct RustJobQueue {
        pub vtable_: *const RustJobQueue__bindgen_vtable,
        pub mTraps: root::JobQueueTraps,
        pub mQueue: *const ::std::os::raw::c_void,
        pub mInterruptQueues: *mut ::std::os::raw::c_void,
    }
    #[repr(C)]
    pub struct RustJobQueue_SavedQueue__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    pub struct RustJobQueue_SavedQueue {
        pub vtable_: *const RustJobQueue_SavedQueue__bindgen_vtable,
        pub mTraps: root::JobQueueTraps,
        pub mInterruptQueues: *mut ::std::os::raw::c_void,
        pub mCurrentQueue: *mut *const ::std::os::raw::c_void,
        pub mNewQueue: *const ::std::os::raw::c_void,
        pub mSavedQueue: *const ::std::os::raw::c_void,
    }
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of RustJobQueue_SavedQueue"]
            [::std::mem::size_of::<RustJobQueue_SavedQueue>() - 96usize];
        ["Alignment of RustJobQueue_SavedQueue"]
            [::std::mem::align_of::<RustJobQueue_SavedQueue>() - 8usize];
        ["Offset of field: RustJobQueue_SavedQueue::mTraps"]
            [::std::mem::offset_of!(RustJobQueue_SavedQueue, mTraps) - 8usize];
        ["Offset of field: RustJobQueue_SavedQueue::mInterruptQueues"]
            [::std::mem::offset_of!(RustJobQueue_SavedQueue, mInterruptQueues) - 64usize];
        ["Offset of field: RustJobQueue_SavedQueue::mCurrentQueue"]
            [::std::mem::offset_of!(RustJobQueue_SavedQueue, mCurrentQueue) - 72usize];
        ["Offset of field: RustJobQueue_SavedQueue::mNewQueue"]
            [::std::mem::offset_of!(RustJobQueue_SavedQueue, mNewQueue) - 80usize];
        ["Offset of field: RustJobQueue_SavedQueue::mSavedQueue"]
            [::std::mem::offset_of!(RustJobQueue_SavedQueue, mSavedQueue) - 88usize];
    };
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of RustJobQueue"][::std::mem::size_of::<RustJobQueue>() - 80usize];
        ["Alignment of RustJobQueue"][::std::mem::align_of::<RustJobQueue>() - 8usize];
        ["Offset of field: RustJobQueue::mTraps"]
            [::std::mem::offset_of!(RustJobQueue, mTraps) - 8usize];
        ["Offset of field: RustJobQueue::mQueue"]
            [::std::mem::offset_of!(RustJobQueue, mQueue) - 64usize];
        ["Offset of field: RustJobQueue::mInterruptQueues"]
            [::std::mem::offset_of!(RustJobQueue, mInterruptQueues) - 72usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone, PartialEq)]
    pub struct JSExternalStringCallbacksTraps {
        pub latin1Finalize: ::std::option::Option<
            unsafe extern "C" fn(
                privateData: *const ::std::os::raw::c_void,
                chars: *mut root::JS::Latin1Char,
            ),
        >,
        pub utf16Finalize: ::std::option::Option<
            unsafe extern "C" fn(privateData: *const ::std::os::raw::c_void, chars: *mut u16),
        >,
        pub latin1SizeOfBuffer: ::std::option::Option<
            unsafe extern "C" fn(
                privateData: *const ::std::os::raw::c_void,
                chars: *const root::JS::Latin1Char,
                mallocSizeOf: root::mozilla::MallocSizeOf,
            ) -> usize,
        >,
        pub utf16SizeOfBuffer: ::std::option::Option<
            unsafe extern "C" fn(
                privateData: *const ::std::os::raw::c_void,
                chars: *const u16,
                mallocSizeOf: root::mozilla::MallocSizeOf,
            ) -> usize,
        >,
    }
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of JSExternalStringCallbacksTraps"]
            [::std::mem::size_of::<JSExternalStringCallbacksTraps>() - 32usize];
        ["Alignment of JSExternalStringCallbacksTraps"]
            [::std::mem::align_of::<JSExternalStringCallbacksTraps>() - 8usize];
        ["Offset of field: JSExternalStringCallbacksTraps::latin1Finalize"]
            [::std::mem::offset_of!(JSExternalStringCallbacksTraps, latin1Finalize) - 0usize];
        ["Offset of field: JSExternalStringCallbacksTraps::utf16Finalize"]
            [::std::mem::offset_of!(JSExternalStringCallbacksTraps, utf16Finalize) - 8usize];
        ["Offset of field: JSExternalStringCallbacksTraps::latin1SizeOfBuffer"]
            [::std::mem::offset_of!(JSExternalStringCallbacksTraps, latin1SizeOfBuffer) - 16usize];
        ["Offset of field: JSExternalStringCallbacksTraps::utf16SizeOfBuffer"]
            [::std::mem::offset_of!(JSExternalStringCallbacksTraps, utf16SizeOfBuffer) - 24usize];
    };
    #[repr(C)]
    pub struct RustJSExternalStringCallbacks__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    pub struct RustJSExternalStringCallbacks {
        pub vtable_: *const RustJSExternalStringCallbacks__bindgen_vtable,
        pub mTraps: root::JSExternalStringCallbacksTraps,
        pub privateData: *mut ::std::os::raw::c_void,
    }
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of RustJSExternalStringCallbacks"]
            [::std::mem::size_of::<RustJSExternalStringCallbacks>() - 48usize];
        ["Alignment of RustJSExternalStringCallbacks"]
            [::std::mem::align_of::<RustJSExternalStringCallbacks>() - 8usize];
        ["Offset of field: RustJSExternalStringCallbacks::mTraps"]
            [::std::mem::offset_of!(RustJSExternalStringCallbacks, mTraps) - 8usize];
        ["Offset of field: RustJSExternalStringCallbacks::privateData"]
            [::std::mem::offset_of!(RustJSExternalStringCallbacks, privateData) - 40usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone, PartialEq)]
    pub struct ProxyTraps {
        pub enter: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
                id: root::JS::HandleId,
                action: root::js::BaseProxyHandler_Action,
                bp: *mut bool,
            ) -> bool,
        >,
        pub getOwnPropertyDescriptor: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
                id: root::JS::HandleId,
                desc: root::JS::MutableHandle<root::JS::PropertyDescriptor>,
                isNone: *mut bool,
            ) -> bool,
        >,
        pub defineProperty: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
                id: root::JS::HandleId,
                desc: root::JS::Handle<root::JS::PropertyDescriptor>,
                result: *mut root::JS::ObjectOpResult,
            ) -> bool,
        >,
        pub ownPropertyKeys: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
                props: root::JS::MutableHandleIdVector,
            ) -> bool,
        >,
        pub delete_: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
                id: root::JS::HandleId,
                result: *mut root::JS::ObjectOpResult,
            ) -> bool,
        >,
        pub enumerate: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
                props: root::JS::MutableHandleIdVector,
            ) -> bool,
        >,
        pub getPrototypeIfOrdinary: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
                isOrdinary: *mut bool,
                protop: root::JS::MutableHandleObject,
            ) -> bool,
        >,
        pub getPrototype: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
                protop: root::JS::MutableHandleObject,
            ) -> bool,
        >,
        pub setPrototype: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
                proto: root::JS::HandleObject,
                result: *mut root::JS::ObjectOpResult,
            ) -> bool,
        >,
        pub setImmutablePrototype: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
                succeeded: *mut bool,
            ) -> bool,
        >,
        pub preventExtensions: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
                result: *mut root::JS::ObjectOpResult,
            ) -> bool,
        >,
        pub isExtensible: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
                succeeded: *mut bool,
            ) -> bool,
        >,
        pub has: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
                id: root::JS::HandleId,
                bp: *mut bool,
            ) -> bool,
        >,
        pub get: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
                receiver: root::JS::HandleValue,
                id: root::JS::HandleId,
                vp: root::JS::MutableHandleValue,
            ) -> bool,
        >,
        pub set: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
                id: root::JS::HandleId,
                v: root::JS::HandleValue,
                receiver: root::JS::HandleValue,
                result: *mut root::JS::ObjectOpResult,
            ) -> bool,
        >,
        pub call: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
                args: *const root::JS::CallArgs,
            ) -> bool,
        >,
        pub construct: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
                args: *const root::JS::CallArgs,
            ) -> bool,
        >,
        pub hasOwn: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
                id: root::JS::HandleId,
                bp: *mut bool,
            ) -> bool,
        >,
        pub getOwnEnumerablePropertyKeys: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
                props: root::JS::MutableHandleIdVector,
            ) -> bool,
        >,
        pub nativeCall: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                test: root::JS::IsAcceptableThis,
                impl_: root::JS::NativeImpl,
                args: root::JS::CallArgs,
            ) -> bool,
        >,
        pub objectClassIs: ::std::option::Option<
            unsafe extern "C" fn(
                obj: root::JS::HandleObject,
                classValue: root::js::ESClass,
                cx: *mut root::JSContext,
            ) -> bool,
        >,
        pub className: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
            ) -> *const ::std::os::raw::c_char,
        >,
        pub fun_toString: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
                isToString: bool,
            ) -> *mut root::JSString,
        >,
        pub boxedValue_unbox: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                proxy: root::JS::HandleObject,
                vp: root::JS::MutableHandleValue,
            ) -> bool,
        >,
        pub defaultValue: ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                hint: root::JSType,
                vp: root::JS::MutableHandleValue,
            ) -> bool,
        >,
        pub trace: ::std::option::Option<
            unsafe extern "C" fn(trc: *mut root::JSTracer, proxy: *mut root::JSObject),
        >,
        pub finalize: ::std::option::Option<
            unsafe extern "C" fn(cx: *mut root::JS::GCContext, proxy: *mut root::JSObject),
        >,
        pub objectMoved: ::std::option::Option<
            unsafe extern "C" fn(proxy: *mut root::JSObject, old: *mut root::JSObject) -> usize,
        >,
        pub isCallable:
            ::std::option::Option<unsafe extern "C" fn(obj: *mut root::JSObject) -> bool>,
        pub isConstructor:
            ::std::option::Option<unsafe extern "C" fn(obj: *mut root::JSObject) -> bool>,
    }
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of ProxyTraps"][::std::mem::size_of::<ProxyTraps>() - 240usize];
        ["Alignment of ProxyTraps"][::std::mem::align_of::<ProxyTraps>() - 8usize];
        ["Offset of field: ProxyTraps::enter"][::std::mem::offset_of!(ProxyTraps, enter) - 0usize];
        ["Offset of field: ProxyTraps::getOwnPropertyDescriptor"]
            [::std::mem::offset_of!(ProxyTraps, getOwnPropertyDescriptor) - 8usize];
        ["Offset of field: ProxyTraps::defineProperty"]
            [::std::mem::offset_of!(ProxyTraps, defineProperty) - 16usize];
        ["Offset of field: ProxyTraps::ownPropertyKeys"]
            [::std::mem::offset_of!(ProxyTraps, ownPropertyKeys) - 24usize];
        ["Offset of field: ProxyTraps::delete_"]
            [::std::mem::offset_of!(ProxyTraps, delete_) - 32usize];
        ["Offset of field: ProxyTraps::enumerate"]
            [::std::mem::offset_of!(ProxyTraps, enumerate) - 40usize];
        ["Offset of field: ProxyTraps::getPrototypeIfOrdinary"]
            [::std::mem::offset_of!(ProxyTraps, getPrototypeIfOrdinary) - 48usize];
        ["Offset of field: ProxyTraps::getPrototype"]
            [::std::mem::offset_of!(ProxyTraps, getPrototype) - 56usize];
        ["Offset of field: ProxyTraps::setPrototype"]
            [::std::mem::offset_of!(ProxyTraps, setPrototype) - 64usize];
        ["Offset of field: ProxyTraps::setImmutablePrototype"]
            [::std::mem::offset_of!(ProxyTraps, setImmutablePrototype) - 72usize];
        ["Offset of field: ProxyTraps::preventExtensions"]
            [::std::mem::offset_of!(ProxyTraps, preventExtensions) - 80usize];
        ["Offset of field: ProxyTraps::isExtensible"]
            [::std::mem::offset_of!(ProxyTraps, isExtensible) - 88usize];
        ["Offset of field: ProxyTraps::has"][::std::mem::offset_of!(ProxyTraps, has) - 96usize];
        ["Offset of field: ProxyTraps::get"][::std::mem::offset_of!(ProxyTraps, get) - 104usize];
        ["Offset of field: ProxyTraps::set"][::std::mem::offset_of!(ProxyTraps, set) - 112usize];
        ["Offset of field: ProxyTraps::call"][::std::mem::offset_of!(ProxyTraps, call) - 120usize];
        ["Offset of field: ProxyTraps::construct"]
            [::std::mem::offset_of!(ProxyTraps, construct) - 128usize];
        ["Offset of field: ProxyTraps::hasOwn"]
            [::std::mem::offset_of!(ProxyTraps, hasOwn) - 136usize];
        ["Offset of field: ProxyTraps::getOwnEnumerablePropertyKeys"]
            [::std::mem::offset_of!(ProxyTraps, getOwnEnumerablePropertyKeys) - 144usize];
        ["Offset of field: ProxyTraps::nativeCall"]
            [::std::mem::offset_of!(ProxyTraps, nativeCall) - 152usize];
        ["Offset of field: ProxyTraps::objectClassIs"]
            [::std::mem::offset_of!(ProxyTraps, objectClassIs) - 160usize];
        ["Offset of field: ProxyTraps::className"]
            [::std::mem::offset_of!(ProxyTraps, className) - 168usize];
        ["Offset of field: ProxyTraps::fun_toString"]
            [::std::mem::offset_of!(ProxyTraps, fun_toString) - 176usize];
        ["Offset of field: ProxyTraps::boxedValue_unbox"]
            [::std::mem::offset_of!(ProxyTraps, boxedValue_unbox) - 184usize];
        ["Offset of field: ProxyTraps::defaultValue"]
            [::std::mem::offset_of!(ProxyTraps, defaultValue) - 192usize];
        ["Offset of field: ProxyTraps::trace"]
            [::std::mem::offset_of!(ProxyTraps, trace) - 200usize];
        ["Offset of field: ProxyTraps::finalize"]
            [::std::mem::offset_of!(ProxyTraps, finalize) - 208usize];
        ["Offset of field: ProxyTraps::objectMoved"]
            [::std::mem::offset_of!(ProxyTraps, objectMoved) - 216usize];
        ["Offset of field: ProxyTraps::isCallable"]
            [::std::mem::offset_of!(ProxyTraps, isCallable) - 224usize];
        ["Offset of field: ProxyTraps::isConstructor"]
            [::std::mem::offset_of!(ProxyTraps, isConstructor) - 232usize];
    };
    extern "C" {
        #[link_name = "\u{1}_ZL13HandlerFamily"]
        pub static mut HandlerFamily: ::std::os::raw::c_int;
    }
    #[repr(C)]
    pub struct WrapperProxyHandler__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    pub struct WrapperProxyHandler {
        pub vtable_: *const WrapperProxyHandler__bindgen_vtable,
        pub __bindgen_padding_0: [u64; 2usize],
        pub mTraps: root::ProxyTraps,
    }
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of WrapperProxyHandler"][::std::mem::size_of::<WrapperProxyHandler>() - 264usize];
        ["Alignment of WrapperProxyHandler"]
            [::std::mem::align_of::<WrapperProxyHandler>() - 8usize];
        ["Offset of field: WrapperProxyHandler::mTraps"]
            [::std::mem::offset_of!(WrapperProxyHandler, mTraps) - 24usize];
    };
    #[repr(C)]
    pub struct ForwardingProxyHandler__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    pub struct ForwardingProxyHandler {
        pub vtable_: *const ForwardingProxyHandler__bindgen_vtable,
        pub __bindgen_padding_0: [u64; 2usize],
        pub mTraps: root::ProxyTraps,
        pub mExtra: *const ::std::os::raw::c_void,
    }
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of ForwardingProxyHandler"]
            [::std::mem::size_of::<ForwardingProxyHandler>() - 272usize];
        ["Alignment of ForwardingProxyHandler"]
            [::std::mem::align_of::<ForwardingProxyHandler>() - 8usize];
        ["Offset of field: ForwardingProxyHandler::mTraps"]
            [::std::mem::offset_of!(ForwardingProxyHandler, mTraps) - 24usize];
        ["Offset of field: ForwardingProxyHandler::mExtra"]
            [::std::mem::offset_of!(ForwardingProxyHandler, mExtra) - 264usize];
    };
    #[repr(C)]
    pub struct ServoDOMVisitor__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    pub struct ServoDOMVisitor {
        pub vtable_: *const ServoDOMVisitor__bindgen_vtable,
        pub __bindgen_padding_0: u64,
        pub get_size: root::GetSize,
    }
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of ServoDOMVisitor"][::std::mem::size_of::<ServoDOMVisitor>() - 24usize];
        ["Alignment of ServoDOMVisitor"][::std::mem::align_of::<ServoDOMVisitor>() - 8usize];
        ["Offset of field: ServoDOMVisitor::get_size"]
            [::std::mem::offset_of!(ServoDOMVisitor, get_size) - 16usize];
    };
    #[repr(C)]
    #[derive(Debug, Copy, Clone, PartialEq)]
    pub struct JSPrincipalsCallbacks {
        pub write: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut root::JSPrincipals,
                cx: *mut root::JSContext,
                writer: *mut root::JSStructuredCloneWriter,
            ) -> bool,
        >,
        pub isSystemOrAddonPrincipal:
            ::std::option::Option<unsafe extern "C" fn(arg1: *mut root::JSPrincipals) -> bool>,
    }
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of JSPrincipalsCallbacks"][::std::mem::size_of::<JSPrincipalsCallbacks>() - 16usize];
        ["Alignment of JSPrincipalsCallbacks"]
            [::std::mem::align_of::<JSPrincipalsCallbacks>() - 8usize];
        ["Offset of field: JSPrincipalsCallbacks::write"]
            [::std::mem::offset_of!(JSPrincipalsCallbacks, write) - 0usize];
        ["Offset of field: JSPrincipalsCallbacks::isSystemOrAddonPrincipal"]
            [::std::mem::offset_of!(JSPrincipalsCallbacks, isSystemOrAddonPrincipal) - 8usize];
    };
    #[repr(C)]
    pub struct RustJSPrincipals__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    pub struct RustJSPrincipals {
        pub vtable_: *const RustJSPrincipals__bindgen_vtable,
        pub __bindgen_padding_0: u64,
        pub callbacks: root::JSPrincipalsCallbacks,
        pub privateData: *mut ::std::os::raw::c_void,
    }
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of RustJSPrincipals"][::std::mem::size_of::<RustJSPrincipals>() - 40usize];
        ["Alignment of RustJSPrincipals"][::std::mem::align_of::<RustJSPrincipals>() - 8usize];
        ["Offset of field: RustJSPrincipals::callbacks"]
            [::std::mem::offset_of!(RustJSPrincipals, callbacks) - 16usize];
        ["Offset of field: RustJSPrincipals::privateData"]
            [::std::mem::offset_of!(RustJSPrincipals, privateData) - 32usize];
    };
    extern "C" {
        #[link_name = "\u{1}_Z19ShouldMeasureObjectP8JSObjectPP11nsISupports"]
        pub fn ShouldMeasureObject(
            obj: *mut root::JSObject,
            iface: *mut *mut root::nsISupports,
        ) -> bool;
    }
    extern "C" {
        pub fn CreateRustJSPrincipals(
            callbacks: *const root::JSPrincipalsCallbacks,
            privateData: *mut ::std::os::raw::c_void,
        ) -> *mut root::JSPrincipals;
    }
    extern "C" {
        pub fn DestroyRustJSPrincipals(principals: *mut root::JSPrincipals);
    }
    extern "C" {
        pub fn GetRustJSPrincipalsPrivate(
            principals: *mut root::JSPrincipals,
        ) -> *mut ::std::os::raw::c_void;
    }
    extern "C" {
        pub fn InvokeGetOwnPropertyDescriptor(
            handler: *const ::std::os::raw::c_void,
            cx: *mut root::JSContext,
            proxy: root::JS::HandleObject,
            id: root::JS::HandleId,
            desc: root::JS::MutableHandle<root::JS::PropertyDescriptor>,
            isNone: *mut bool,
        ) -> bool;
    }
    extern "C" {
        pub fn InvokeHasOwn(
            handler: *const ::std::os::raw::c_void,
            cx: *mut root::JSContext,
            proxy: root::JS::HandleObject,
            id: root::JS::HandleId,
            bp: *mut bool,
        ) -> bool;
    }
    extern "C" {
        pub fn RUST_FUNCTION_VALUE_TO_JITINFO(v: root::JS::Value) -> *const root::JSJitInfo;
    }
    extern "C" {
        pub fn CallJitGetterOp(
            info: *const root::JSJitInfo,
            cx: *mut root::JSContext,
            thisObj: root::JS::HandleObject,
            specializedThis: *mut ::std::os::raw::c_void,
            argc: ::std::os::raw::c_uint,
            vp: *mut root::JS::Value,
        ) -> bool;
    }
    extern "C" {
        pub fn CallJitSetterOp(
            info: *const root::JSJitInfo,
            cx: *mut root::JSContext,
            thisObj: root::JS::HandleObject,
            specializedThis: *mut ::std::os::raw::c_void,
            argc: ::std::os::raw::c_uint,
            vp: *mut root::JS::Value,
        ) -> bool;
    }
    extern "C" {
        pub fn CallJitMethodOp(
            info: *const root::JSJitInfo,
            cx: *mut root::JSContext,
            thisObj: root::JS::HandleObject,
            specializedThis: *mut ::std::os::raw::c_void,
            argc: u32,
            vp: *mut root::JS::Value,
        ) -> bool;
    }
    extern "C" {
        pub fn CreateProxyHandler(
            aTraps: *const root::ProxyTraps,
            aExtra: *const ::std::os::raw::c_void,
        ) -> *const ::std::os::raw::c_void;
    }
    extern "C" {
        pub fn CreateWrapperProxyHandler(
            aTraps: *const root::ProxyTraps,
        ) -> *const ::std::os::raw::c_void;
    }
    extern "C" {
        pub fn DeleteWrapperProxyHandler(handler: *const ::std::os::raw::c_void);
    }
    extern "C" {
        pub fn GetCrossCompartmentWrapper() -> *const ::std::os::raw::c_void;
    }
    extern "C" {
        pub fn GetSecurityWrapper() -> *const ::std::os::raw::c_void;
    }
    extern "C" {
        pub fn DeleteCompileOptions(aOpts: *mut root::JS::ReadOnlyCompileOptions);
    }
    extern "C" {
        pub fn NewCompileOptions(
            aCx: *mut root::JSContext,
            aFile: *const ::std::os::raw::c_char,
            aLine: ::std::os::raw::c_uint,
        ) -> *mut root::JS::ReadOnlyCompileOptions;
    }
    extern "C" {
        pub fn NewProxyObject(
            aCx: *mut root::JSContext,
            aHandler: *const ::std::os::raw::c_void,
            aPriv: root::JS::HandleValue,
            proto: *mut root::JSObject,
            aClass: *const root::JSClass,
            aLazyProto: bool,
        ) -> *mut root::JSObject;
    }
    extern "C" {
        pub fn WrapperNew(
            aCx: *mut root::JSContext,
            aObj: root::JS::HandleObject,
            aHandler: *const ::std::os::raw::c_void,
            aClass: *const root::JSClass,
        ) -> *mut root::JSObject;
    }
    extern "C" {
        #[link_name = "\u{1}_ZL16WindowProxyClass"]
        pub static WindowProxyClass: root::JSClass;
    }
    extern "C" {
        pub fn GetWindowProxyClass() -> *const root::JSClass;
    }
    extern "C" {
        pub fn NewWindowProxy(
            aCx: *mut root::JSContext,
            aObj: root::JS::HandleObject,
            aHandler: *const ::std::os::raw::c_void,
        ) -> *mut root::JSObject;
    }
    extern "C" {
        pub fn GetProxyReservedSlot(
            obj: *mut root::JSObject,
            slot: u32,
            dest: *mut root::JS::Value,
        );
    }
    extern "C" {
        pub fn GetProxyPrivate(obj: *mut root::JSObject, dest: *mut root::JS::Value);
    }
    extern "C" {
        pub fn SetProxyReservedSlot(
            obj: *mut root::JSObject,
            slot: u32,
            val: *const root::JS::Value,
        );
    }
    extern "C" {
        pub fn SetProxyPrivate(obj: *mut root::JSObject, expando: *const root::JS::Value);
    }
    extern "C" {
        pub fn RUST_JSID_IS_INT(id: root::JS::HandleId) -> bool;
    }
    extern "C" {
        pub fn int_to_jsid(i: i32, id: root::JS::MutableHandleId);
    }
    extern "C" {
        pub fn RUST_JSID_TO_INT(id: root::JS::HandleId) -> i32;
    }
    extern "C" {
        pub fn RUST_JSID_IS_STRING(id: root::JS::HandleId) -> bool;
    }
    extern "C" {
        pub fn RUST_JSID_TO_STRING(id: root::JS::HandleId) -> *mut root::JSString;
    }
    extern "C" {
        pub fn RUST_SYMBOL_TO_JSID(sym: *mut root::JS::Symbol, id: root::JS::MutableHandleId);
    }
    extern "C" {
        pub fn RUST_JSID_IS_VOID(id: root::JS::HandleId) -> bool;
    }
    extern "C" {
        pub fn SetBuildId(
            buildId: *mut root::JS::BuildIdCharVector,
            chars: *const ::std::os::raw::c_char,
            len: usize,
        ) -> bool;
    }
    extern "C" {
        pub fn RUST_SET_JITINFO(func: *mut root::JSFunction, info: *const root::JSJitInfo);
    }
    extern "C" {
        pub fn RUST_INTERNED_STRING_TO_JSID(
            cx: *mut root::JSContext,
            str_: *mut root::JSString,
            id: root::JS::MutableHandleId,
        );
    }
    extern "C" {
        pub fn RUST_js_GetErrorMessage(
            userRef: *mut ::std::os::raw::c_void,
            errorNumber: u32,
        ) -> *const root::JSErrorFormatString;
    }
    extern "C" {
        pub fn IsProxyHandlerFamily(obj: *mut root::JSObject) -> bool;
    }
    extern "C" {
        pub fn GetProxyHandlerFamily() -> *const ::std::os::raw::c_void;
    }
    extern "C" {
        pub fn GetProxyHandlerExtra(obj: *mut root::JSObject) -> *const ::std::os::raw::c_void;
    }
    extern "C" {
        pub fn GetProxyHandler(obj: *mut root::JSObject) -> *const ::std::os::raw::c_void;
    }
    extern "C" {
        pub fn ReportErrorASCII(aCx: *mut root::JSContext, aError: *const ::std::os::raw::c_char);
    }
    extern "C" {
        pub fn ReportErrorUTF8(aCx: *mut root::JSContext, aError: *const ::std::os::raw::c_char);
    }
    extern "C" {
        pub fn IsWrapper(obj: *mut root::JSObject) -> bool;
    }
    extern "C" {
        pub fn UnwrapObjectStatic(obj: *mut root::JSObject) -> *mut root::JSObject;
    }
    extern "C" {
        pub fn UnwrapObjectDynamic(
            obj: *mut root::JSObject,
            cx: *mut root::JSContext,
            stopAtWindowProxy: bool,
        ) -> *mut root::JSObject;
    }
    extern "C" {
        pub fn UncheckedUnwrapObject(
            obj: *mut root::JSObject,
            stopAtWindowProxy: bool,
        ) -> *mut root::JSObject;
    }
    extern "C" {
        pub fn CreateRootedIdVector(
            cx: *mut root::JSContext,
        ) -> *mut root::JS::PersistentRootedIdVector;
    }
    extern "C" {
        pub fn GetIdVectorAddress(
            v: *mut root::JS::PersistentRootedIdVector,
        ) -> *mut ::std::os::raw::c_void;
    }
    extern "C" {
        pub fn SliceRootedIdVector(
            v: *const root::JS::PersistentRootedIdVector,
            length: *mut usize,
        ) -> *const root::jsid;
    }
    extern "C" {
        pub fn AppendToIdVector(v: root::JS::MutableHandleIdVector, id: root::JS::HandleId)
            -> bool;
    }
    extern "C" {
        pub fn DestroyRootedIdVector(v: *mut root::JS::PersistentRootedIdVector);
    }
    extern "C" {
        pub fn CreateRootedObjectVector(
            aCx: *mut root::JSContext,
        ) -> *mut root::JS::PersistentRootedObjectVector;
    }
    extern "C" {
        pub fn GetObjectVectorAddress(
            v: *mut root::JS::PersistentRootedObjectVector,
        ) -> *mut ::std::os::raw::c_void;
    }
    extern "C" {
        pub fn AppendToRootedObjectVector(
            v: *mut root::JS::PersistentRootedObjectVector,
            obj: *mut root::JSObject,
        ) -> bool;
    }
    extern "C" {
        pub fn DeleteRootedObjectVector(v: *mut root::JS::PersistentRootedObjectVector);
    }
    extern "C" {
        pub fn CollectServoSizes(
            cx: *mut root::JSContext,
            sizes: *mut root::JS::ServoSizes,
            gs: root::GetSize,
        ) -> bool;
    }
    extern "C" {
        pub fn InitializeMemoryReporter(wtm: root::WantToMeasure);
    }
    extern "C" {
        pub fn CallValueTracer(
            trc: *mut root::JSTracer,
            valuep: *mut root::JS::Heap<root::JS::Value>,
            name: *const ::std::os::raw::c_char,
        );
    }
    extern "C" {
        pub fn CallIdTracer(
            trc: *mut root::JSTracer,
            idp: *mut root::JS::Heap<root::jsid>,
            name: *const ::std::os::raw::c_char,
        );
    }
    extern "C" {
        pub fn CallObjectTracer(
            trc: *mut root::JSTracer,
            objp: *mut root::JS::Heap<*mut root::JSObject>,
            name: *const ::std::os::raw::c_char,
        );
    }
    extern "C" {
        pub fn CallStringTracer(
            trc: *mut root::JSTracer,
            strp: *mut root::JS::Heap<*mut root::JSString>,
            name: *const ::std::os::raw::c_char,
        );
    }
    extern "C" {
        pub fn CallSymbolTracer(
            trc: *mut root::JSTracer,
            bip: *mut root::JS::Heap<*mut root::JS::Symbol>,
            name: *const ::std::os::raw::c_char,
        );
    }
    extern "C" {
        pub fn CallBigIntTracer(
            trc: *mut root::JSTracer,
            bip: *mut root::JS::Heap<*mut root::JS::BigInt>,
            name: *const ::std::os::raw::c_char,
        );
    }
    extern "C" {
        pub fn CallScriptTracer(
            trc: *mut root::JSTracer,
            scriptp: *mut root::JS::Heap<*mut root::JSScript>,
            name: *const ::std::os::raw::c_char,
        );
    }
    extern "C" {
        pub fn CallFunctionTracer(
            trc: *mut root::JSTracer,
            funp: *mut root::JS::Heap<*mut root::JSFunction>,
            name: *const ::std::os::raw::c_char,
        );
    }
    extern "C" {
        pub fn CallUnbarrieredObjectTracer(
            trc: *mut root::JSTracer,
            objp: *mut *mut root::JSObject,
            name: *const ::std::os::raw::c_char,
        );
    }
    extern "C" {
        pub fn CallObjectRootTracer(
            trc: *mut root::JSTracer,
            objp: *mut *mut root::JSObject,
            name: *const ::std::os::raw::c_char,
        );
    }
    extern "C" {
        pub fn CallValueRootTracer(
            trc: *mut root::JSTracer,
            valp: *mut root::JS::Value,
            name: *const ::std::os::raw::c_char,
        );
    }
    extern "C" {
        pub fn CallPropertyDescriptorTracer(
            trc: *mut root::JSTracer,
            desc: *mut root::JS::PropertyDescriptor,
        );
    }
    extern "C" {
        pub fn IsDebugBuild() -> bool;
    }
    extern "C" {
        pub fn GetInt8ArrayLengthAndData(
            obj: *mut root::JSObject,
            length: *mut usize,
            isSharedMemory: *mut bool,
            data: *mut *mut i8,
        );
    }
    extern "C" {
        pub fn GetUint8ArrayLengthAndData(
            obj: *mut root::JSObject,
            length: *mut usize,
            isSharedMemory: *mut bool,
            data: *mut *mut u8,
        );
    }
    extern "C" {
        pub fn GetUint8ClampedArrayLengthAndData(
            obj: *mut root::JSObject,
            length: *mut usize,
            isSharedMemory: *mut bool,
            data: *mut *mut u8,
        );
    }
    extern "C" {
        pub fn GetInt16ArrayLengthAndData(
            obj: *mut root::JSObject,
            length: *mut usize,
            isSharedMemory: *mut bool,
            data: *mut *mut i16,
        );
    }
    extern "C" {
        pub fn GetUint16ArrayLengthAndData(
            obj: *mut root::JSObject,
            length: *mut usize,
            isSharedMemory: *mut bool,
            data: *mut *mut u16,
        );
    }
    extern "C" {
        pub fn GetInt32ArrayLengthAndData(
            obj: *mut root::JSObject,
            length: *mut usize,
            isSharedMemory: *mut bool,
            data: *mut *mut i32,
        );
    }
    extern "C" {
        pub fn GetUint32ArrayLengthAndData(
            obj: *mut root::JSObject,
            length: *mut usize,
            isSharedMemory: *mut bool,
            data: *mut *mut u32,
        );
    }
    extern "C" {
        pub fn GetFloat32ArrayLengthAndData(
            obj: *mut root::JSObject,
            length: *mut usize,
            isSharedMemory: *mut bool,
            data: *mut *mut f32,
        );
    }
    extern "C" {
        pub fn GetFloat64ArrayLengthAndData(
            obj: *mut root::JSObject,
            length: *mut usize,
            isSharedMemory: *mut bool,
            data: *mut *mut f64,
        );
    }
    extern "C" {
        pub fn NewJSAutoStructuredCloneBuffer(
            scope: root::JS::StructuredCloneScope,
            callbacks: *const root::JSStructuredCloneCallbacks,
        ) -> *mut root::JSAutoStructuredCloneBuffer;
    }
    extern "C" {
        pub fn DeleteJSAutoStructuredCloneBuffer(buf: *mut root::JSAutoStructuredCloneBuffer);
    }
    extern "C" {
        pub fn GetLengthOfJSStructuredCloneData(data: *mut root::JSStructuredCloneData) -> usize;
    }
    extern "C" {
        pub fn CopyJSStructuredCloneData(src: *mut root::JSStructuredCloneData, dest: *mut u8);
    }
    extern "C" {
        pub fn WriteBytesToJSStructuredCloneData(
            src: *const u8,
            len: usize,
            dest: *mut root::JSStructuredCloneData,
        ) -> bool;
    }
    extern "C" {
        pub fn JS_GetPromiseResult(
            promise: root::JS::HandleObject,
            dest: root::JS::MutableHandleValue,
        );
    }
    extern "C" {
        pub fn JS_GetScriptPrivate(script: *mut root::JSScript, dest: root::JS::MutableHandleValue);
    }
    extern "C" {
        pub fn JS_MaybeGetScriptPrivate(
            obj: *mut root::JSObject,
            dest: root::JS::MutableHandleValue,
        );
    }
    extern "C" {
        pub fn JS_GetModulePrivate(module: *mut root::JSObject, dest: root::JS::MutableHandleValue);
    }
    extern "C" {
        pub fn JS_GetScriptedCallerPrivate(
            cx: *mut root::JSContext,
            dest: root::JS::MutableHandleValue,
        );
    }
    extern "C" {
        pub fn JS_GetNaNValue(cx: *mut root::JSContext, dest: *mut root::JS::Value);
    }
    extern "C" {
        pub fn JS_GetPositiveInfinityValue(cx: *mut root::JSContext, dest: *mut root::JS::Value);
    }
    extern "C" {
        pub fn JS_GetEmptyStringValue(cx: *mut root::JSContext, dest: *mut root::JS::Value);
    }
    extern "C" {
        pub fn JS_GetReservedSlot(obj: *mut root::JSObject, index: u32, dest: *mut root::JS::Value);
    }
    extern "C" {
        pub fn JS_GetRegExpFlags(
            cx: *mut root::JSContext,
            obj: root::JS::HandleObject,
            flags: *mut root::JS::RegExpFlags,
        );
    }
    extern "C" {
        pub fn EncodeStringToUTF8(
            cx: *mut root::JSContext,
            str_: root::JS::HandleString,
            cb: root::EncodedStringCallback,
        );
    }
    extern "C" {
        pub fn JS_ForgetStringLinearness(str_: *mut root::JSLinearString) -> *mut root::JSString;
    }
    extern "C" {
        pub fn CreateJobQueue(
            aTraps: *const root::JobQueueTraps,
            aQueue: *const ::std::os::raw::c_void,
            aInterruptQueues: *mut ::std::os::raw::c_void,
        ) -> *mut root::JS::JobQueue;
    }
    extern "C" {
        pub fn DeleteJobQueue(queue: *mut root::JS::JobQueue);
    }
    extern "C" {
        pub fn CreateJSExternalStringCallbacks(
            aTraps: *const root::JSExternalStringCallbacksTraps,
            privateData: *mut ::std::os::raw::c_void,
        ) -> *mut root::JSExternalStringCallbacks;
    }
    extern "C" {
        pub fn DeleteJSExternalStringCallbacks(callbacks: *mut root::JSExternalStringCallbacks);
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, PartialEq)]
    pub struct DispatchablePointer {
        pub ptr: u64,
    }
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of DispatchablePointer"][::std::mem::size_of::<DispatchablePointer>() - 8usize];
        ["Alignment of DispatchablePointer"]
            [::std::mem::align_of::<DispatchablePointer>() - 8usize];
        ["Offset of field: DispatchablePointer::ptr"]
            [::std::mem::offset_of!(DispatchablePointer, ptr) - 0usize];
    };
    pub type RustDispatchToEventLoopCallback = ::std::option::Option<
        unsafe extern "C" fn(
            closure: *mut ::std::os::raw::c_void,
            ptr: *mut root::DispatchablePointer,
        ) -> bool,
    >;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, PartialEq)]
    pub struct EventLoopCallbackData {
        pub dispatchCallback: root::RustDispatchToEventLoopCallback,
        pub closure: *mut ::std::os::raw::c_void,
    }
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of EventLoopCallbackData"][::std::mem::size_of::<EventLoopCallbackData>() - 16usize];
        ["Alignment of EventLoopCallbackData"]
            [::std::mem::align_of::<EventLoopCallbackData>() - 8usize];
        ["Offset of field: EventLoopCallbackData::dispatchCallback"]
            [::std::mem::offset_of!(EventLoopCallbackData, dispatchCallback) - 0usize];
        ["Offset of field: EventLoopCallbackData::closure"]
            [::std::mem::offset_of!(EventLoopCallbackData, closure) - 8usize];
    };
    extern "C" {
        pub fn DispatchToEventLoop(
            closure: *mut ::std::os::raw::c_void,
            dispatchable: *mut u64,
        ) -> bool;
    }
    extern "C" {
        pub fn SetUpEventLoopDispatch(
            cx: *mut root::JSContext,
            callback: root::RustDispatchToEventLoopCallback,
            closure: *mut ::std::os::raw::c_void,
        );
    }
    extern "C" {
        pub fn DispatchableRun(
            cx: *mut root::JSContext,
            ptr: *mut root::DispatchablePointer,
            mb: root::JS::Dispatchable_MaybeShuttingDown,
        );
    }
    extern "C" {
        pub fn StreamConsumerConsumeChunk(
            sc: *mut root::JS::StreamConsumer,
            begin: *const u8,
            length: usize,
        ) -> bool;
    }
    extern "C" {
