/* automatically generated by rust-bindgen 0.72.1 */

unsafe impl Sync for root::JSClass {}
unsafe impl Sync for root::JSFunctionSpec {}
unsafe impl Sync for root::JSNativeWrapper {}
unsafe impl Sync for root::JSPropertySpec {}
unsafe impl Sync for root::JSTypedMethodJitInfo {}

#[allow(non_snake_case, non_camel_case_types, non_upper_case_globals)]
pub mod root {
    #[repr(C)]
    #[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
    pub struct __BindgenBitfieldUnit<Storage> {
        storage: Storage,
    }
    impl<Storage> __BindgenBitfieldUnit<Storage> {
        #[inline]
        pub const fn new(storage: Storage) -> Self {
            Self { storage }
        }
    }
    impl<Storage> __BindgenBitfieldUnit<Storage>
    where
        Storage: AsRef<[u8]> + AsMut<[u8]>,
    {
        #[inline]
        fn extract_bit(byte: u8, index: usize) -> bool {
            let bit_index = if cfg!(target_endian = "big") {
                7 - (index % 8)
            } else {
                index % 8
            };
            let mask = 1 << bit_index;
            byte & mask == mask
        }
        #[inline]
        pub fn get_bit(&self, index: usize) -> bool {
            debug_assert!(index / 8 < self.storage.as_ref().len());
            let byte_index = index / 8;
            let byte = self.storage.as_ref()[byte_index];
            Self::extract_bit(byte, index)
        }
        #[inline]

                (bit_offset + (bit_width as usize)) / 8 <= core::mem::size_of::<Storage>()
            );
            for i in 0..(bit_width as usize) {
                let mask = 1 << i;
                let val_bit_is_set = val & mask == mask;
                let index = if cfg!(target_endian = "big") {
                    bit_width as usize - 1 - i
                } else {
                    i
                };
                unsafe { Self::raw_set_bit(this, index + bit_offset, val_bit_is_set) };
            }
        }
    }
    #[doc = r" If Bindgen could only determine the size and alignment of a"]
    #[doc = r" type, it is represented like this."]
    #[derive(PartialEq, Copy, Clone, Debug, Hash)]
    #[repr(C)]
    pub struct __BindgenOpaqueArray<T: Copy, const N: usize>(pub [T; N]);
    impl<T: Copy + Default, const N: usize> Default for __BindgenOpaqueArray<T, N> {
        fn default() -> Self {
            Self([<T as Default>::default(); N])
        }
    }
    #[allow(unused_imports)]
    use self::super::root;
    pub type FILE = ::libc::FILE;
    pub const JS_64BIT: u32 = 1;
    pub const JS_CODEGEN_X64: u32 = 1;
    pub const JS_DEFAULT_JITREPORT_GRANULARITY: u32 = 3;
    pub const JS_HAS_INTL_API: u32 = 1;
    pub const JS_PUNBOX64: u32 = 1;
    pub const JS_STANDALONE: u32 = 1;
    pub const JS_WITHOUT_NSPR: u32 = 1;
    pub const JS_BITS_PER_WORD: u32 = 64;
    pub const JS_STRUCTURED_CLONE_VERSION: u32 = 8;
    pub const JS_SCERR_RECURSION: u32 = 0;
    pub const JS_SCERR_TRANSFERABLE: u32 = 1;
    pub const JS_SCERR_DUP_TRANSFERABLE: u32 = 2;
    pub const JS_SCERR_UNSUPPORTED_TYPE: u32 = 3;
    pub const JS_SCERR_SHMEM_TRANSFERABLE: u32 = 4;
    pub const JS_SCERR_TYPED_ARRAY_DETACHED: u32 = 5;
    pub const JS_SCERR_WASM_NO_TRANSFER: u32 = 6;
    pub const JS_SCERR_NOT_CLONABLE: u32 = 7;
    pub const JS_SCERR_NOT_CLONABLE_WITH_COOP_COEP: u32 = 8;
    pub const JS_SCERR_TRANSFERABLE_TWICE: u32 = 9;
    pub const JSITER_PRIVATE: u32 = 4;
    pub const JSITER_OWNONLY: u32 = 8;
    pub const JSITER_HIDDEN: u32 = 16;
    pub const JSITER_SYMBOLS: u32 = 32;
    pub const JSITER_SYMBOLSONLY: u32 = 64;
    pub const JSITER_FORAWAITOF: u32 = 128;
    pub mod std {
        #[allow(unused_imports)]
        use self::super::super::root;
        pub type nullptr_t = u64;
        pub type integral_constant_value_type = u8;
        pub type integral_constant_type = u8;
        pub type false_type = u8;
        pub type remove_const_t = u8;
        pub type remove_cv_t = u8;
        pub type remove_reference_t = u8;
        pub type make_signed_t = u8;
        pub type make_unsigned_t = u8;
        pub type add_pointer_t = u8;
        pub type enable_if_t = u8;
        pub type conditional_t = u8;
        pub type underlying_type_t = u8;
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct input_iterator_tag {
            pub _bindgen_opaque_blob: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of input_iterator_tag"][::std::mem::size_of::<input_iterator_tag>() - 1usize];
            ["Alignment of input_iterator_tag"]
                [::std::mem::align_of::<input_iterator_tag>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct output_iterator_tag {
            pub _bindgen_opaque_blob: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of output_iterator_tag"][::std::mem::size_of::<output_iterator_tag>() - 1usize];
            ["Alignment of output_iterator_tag"]
                [::std::mem::align_of::<output_iterator_tag>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct forward_iterator_tag {
            pub _bindgen_opaque_blob: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of forward_iterator_tag"]
                [::std::mem::size_of::<forward_iterator_tag>() - 1usize];
            ["Alignment of forward_iterator_tag"]
                [::std::mem::align_of::<forward_iterator_tag>() - 1usize];
        };
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct random_access_iterator_tag {
            pub _bindgen_opaque_blob: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of random_access_iterator_tag"]
                [::std::mem::size_of::<random_access_iterator_tag>() - 1usize];
            ["Alignment of random_access_iterator_tag"]
                [::std::mem::align_of::<random_access_iterator_tag>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct reverse_iterator {
            pub _address: u8,
        }
        pub type reverse_iterator___traits_type = u8;
        pub type reverse_iterator_iterator_type = u8;
        pub type reverse_iterator_pointer = u8;
        pub type reverse_iterator_difference_type = u8;
        pub type reverse_iterator_reference = u8;
        pub mod __detail {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct nothrow_t {
            pub _bindgen_opaque_blob: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of nothrow_t"][::std::mem::size_of::<nothrow_t>() - 1usize];
            ["Alignment of nothrow_t"][::std::mem::align_of::<nothrow_t>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct allocator {
            pub _address: u8,
        }
        pub type allocator_value_type = u8;
        pub type allocator_size_type = u64;
        pub type allocator_difference_type = u64;
        pub type allocator_pointer = u8;
        pub type allocator_const_pointer = u8;
        pub type allocator_reference = u8;
        pub type allocator_const_reference = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct allocator_rebind {
            pub _address: u8,
        }
        pub type allocator_rebind_other = u8;
        pub type allocator_propagate_on_container_move_assignment = u8;
        pub type allocator_is_always_equal = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct tuple {
            pub _address: u8,
        }
        pub type tuple__Inherited = u8;
        pub type tuple__TCC = u8;
        pub type tuple__ImplicitDefaultCtor = u8;
        pub type tuple__ExplicitDefaultCtor = u8;
        pub type tuple__ImplicitCtor = u8;
        pub type tuple__ExplicitCtor = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct tuple__UseOtherCtor {
            pub _address: u8,
        }
        pub type string = root::__BindgenOpaqueArray<u64, 4usize>;
        pub type ostream = root::__BindgenOpaqueArray<u64, 34usize>;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct numeric_limits {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct basic_string_view {
            pub _address: u8,
        }
        pub type basic_string_view_traits_type = u8;
        pub type basic_string_view_value_type = u8;
        pub type basic_string_view_pointer = u8;
        pub type basic_string_view_const_pointer = u8;
        pub type basic_string_view_reference = u8;
        pub type basic_string_view_const_reference = u8;
        pub type basic_string_view_const_iterator = u8;
        pub type basic_string_view_iterator = u8;
        pub type basic_string_view_const_reverse_iterator = u8;
        pub type basic_string_view_reverse_iterator = u8;
        pub type basic_string_view_size_type = u64;
        pub type basic_string_view_difference_type = u64;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct vector {
            pub _address: u8,
        }
        pub type vector__Base = u8;
        pub type vector__Tp_alloc_type = u8;
        pub type vector__Alloc_traits = u8;
        pub type vector_value_type = u8;
        pub type vector_pointer = u8;
        pub type vector_const_pointer = u8;
        pub type vector_reference = u8;
        pub type vector_const_reference = u8;
        pub type vector_iterator = u8;
        pub type vector_const_iterator = u8;
        pub type vector_const_reverse_iterator = u8;
        pub type vector_reverse_iterator = u8;
        pub type vector_size_type = u64;
        pub type vector_difference_type = u64;
        pub type vector_allocator_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct vector__Temporary_value {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Copy, Clone)]
        pub union vector__Temporary_value__Storage {
            pub _bindgen_opaque_blob: u8,
        }
        pub type array_value_type = u8;
        pub type array_pointer = u8;
        pub type array_const_pointer = u8;
        pub type array_reference = u8;
        pub type array_const_reference = u8;
        pub type array_iterator = u8;
        pub type array_const_iterator = u8;
        pub type array_size_type = u64;
        pub type array_difference_type = u64;
        pub type array_reverse_iterator = u8;
        pub type array_const_reverse_iterator = u8;
        pub type array__AT_Type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct atomic {
            pub _address: u8,
        }
        pub type atomic_value_type = u8;
    }
    pub mod __gnu_cxx {
        #[allow(unused_imports)]
        use self::super::super::root;
    }
    pub type __off_t = ::std::os::raw::c_long;
    pub type __off64_t = ::std::os::raw::c_long;
    pub type uint_fast8_t = ::std::os::raw::c_uchar;
    pub type __gnuc_va_list = root::__builtin_va_list;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _IO_marker {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _IO_codecvt {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _IO_wide_data {
        _unused: [u8; 0],
    }
    pub type _IO_lock_t = ::std::os::raw::c_void;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, PartialEq)]
    pub struct _IO_FILE {
        pub _flags: ::std::os::raw::c_int,
        pub _IO_read_ptr: *mut ::std::os::raw::c_char,
        pub _IO_read_end: *mut ::std::os::raw::c_char,
        pub _IO_read_base: *mut ::std::os::raw::c_char,
        pub _IO_write_base: *mut ::std::os::raw::c_char,
        pub _IO_write_ptr: *mut ::std::os::raw::c_char,
        pub _IO_write_end: *mut ::std::os::raw::c_char,
        pub _IO_buf_base: *mut ::std::os::raw::c_char,
        pub _IO_buf_end: *mut ::std::os::raw::c_char,
        pub _IO_save_base: *mut ::std::os::raw::c_char,
        pub _IO_backup_base: *mut ::std::os::raw::c_char,
        pub _IO_save_end: *mut ::std::os::raw::c_char,
        pub _markers: *mut root::_IO_marker,
        pub _chain: *mut root::_IO_FILE,
        pub _fileno: ::std::os::raw::c_int,
        pub _flags2: ::std::os::raw::c_int,
        pub _old_offset: root::__off_t,
        pub _cur_column: ::std::os::raw::c_ushort,
        pub _vtable_offset: ::std::os::raw::c_schar,
        pub _shortbuf: [::std::os::raw::c_char; 1usize],
        pub _lock: *mut root::_IO_lock_t,
        pub _offset: root::__off64_t,
        pub _codecvt: *mut root::_IO_codecvt,
        pub _wide_data: *mut root::_IO_wide_data,
        pub _freeres_list: *mut root::_IO_FILE,
        pub _freeres_buf: *mut ::std::os::raw::c_void,
        pub __pad5: usize,
        pub _mode: ::std::os::raw::c_int,
        pub _unused2: [::std::os::raw::c_char; 20usize],
    }
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of _IO_FILE"][::std::mem::size_of::<_IO_FILE>() - 216usize];
        ["Alignment of _IO_FILE"][::std::mem::align_of::<_IO_FILE>() - 8usize];
        ["Offset of field: _IO_FILE::_flags"][::std::mem::offset_of!(_IO_FILE, _flags) - 0usize];
        ["Offset of field: _IO_FILE::_IO_read_ptr"]
            [::std::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 8usize];
        ["Offset of field: _IO_FILE::_IO_read_end"]
            [::std::mem::offset_of!(_IO_FILE, _IO_read_end) - 16usize];
        ["Offset of field: _IO_FILE::_IO_read_base"]
            [::std::mem::offset_of!(_IO_FILE, _IO_read_base) - 24usize];
        ["Offset of field: _IO_FILE::_IO_write_base"]
            [::std::mem::offset_of!(_IO_FILE, _IO_write_base) - 32usize];
        ["Offset of field: _IO_FILE::_IO_write_ptr"]
            [::std::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 40usize];
        ["Offset of field: _IO_FILE::_IO_write_end"]
            [::std::mem::offset_of!(_IO_FILE, _IO_write_end) - 48usize];
        ["Offset of field: _IO_FILE::_IO_buf_base"]
            [::std::mem::offset_of!(_IO_FILE, _IO_buf_base) - 56usize];
        ["Offset of field: _IO_FILE::_IO_buf_end"]
            [::std::mem::offset_of!(_IO_FILE, _IO_buf_end) - 64usize];
        ["Offset of field: _IO_FILE::_IO_save_base"]
            [::std::mem::offset_of!(_IO_FILE, _IO_save_base) - 72usize];
        ["Offset of field: _IO_FILE::_IO_backup_base"]
            [::std::mem::offset_of!(_IO_FILE, _IO_backup_base) - 80usize];
        ["Offset of field: _IO_FILE::_IO_save_end"]
            [::std::mem::offset_of!(_IO_FILE, _IO_save_end) - 88usize];
        ["Offset of field: _IO_FILE::_markers"]
            [::std::mem::offset_of!(_IO_FILE, _markers) - 96usize];
        ["Offset of field: _IO_FILE::_chain"][::std::mem::offset_of!(_IO_FILE, _chain) - 104usize];
        ["Offset of field: _IO_FILE::_fileno"]
            [::std::mem::offset_of!(_IO_FILE, _fileno) - 112usize];
        ["Offset of field: _IO_FILE::_flags2"]
            [::std::mem::offset_of!(_IO_FILE, _flags2) - 116usize];
        ["Offset of field: _IO_FILE::_old_offset"]
            [::std::mem::offset_of!(_IO_FILE, _old_offset) - 120usize];
        ["Offset of field: _IO_FILE::_cur_column"]
            [::std::mem::offset_of!(_IO_FILE, _cur_column) - 128usize];
        ["Offset of field: _IO_FILE::_vtable_offset"]
            [::std::mem::offset_of!(_IO_FILE, _vtable_offset) - 130usize];
        ["Offset of field: _IO_FILE::_shortbuf"]
            [::std::mem::offset_of!(_IO_FILE, _shortbuf) - 131usize];
        ["Offset of field: _IO_FILE::_lock"][::std::mem::offset_of!(_IO_FILE, _lock) - 136usize];
        ["Offset of field: _IO_FILE::_offset"]
            [::std::mem::offset_of!(_IO_FILE, _offset) - 144usize];
        ["Offset of field: _IO_FILE::_codecvt"]
            [::std::mem::offset_of!(_IO_FILE, _codecvt) - 152usize];
        ["Offset of field: _IO_FILE::_wide_data"]
            [::std::mem::offset_of!(_IO_FILE, _wide_data) - 160usize];
        ["Offset of field: _IO_FILE::_freeres_list"]
            [::std::mem::offset_of!(_IO_FILE, _freeres_list) - 168usize];
        ["Offset of field: _IO_FILE::_freeres_buf"]
            [::std::mem::offset_of!(_IO_FILE, _freeres_buf) - 176usize];
        ["Offset of field: _IO_FILE::__pad5"][::std::mem::offset_of!(_IO_FILE, __pad5) - 184usize];
        ["Offset of field: _IO_FILE::_mode"][::std::mem::offset_of!(_IO_FILE, _mode) - 192usize];
        ["Offset of field: _IO_FILE::_unused2"]
            [::std::mem::offset_of!(_IO_FILE, _unused2) - 196usize];
    };
    pub type va_list = root::__gnuc_va_list;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, PartialEq)]
    pub struct __pthread_rwlock_arch_t {
        pub __readers: ::std::os::raw::c_uint,
        pub __writers: ::std::os::raw::c_uint,
        pub __wrphase_futex: ::std::os::raw::c_uint,
        pub __writers_futex: ::std::os::raw::c_uint,
        pub __pad3: ::std::os::raw::c_uint,
        pub __pad4: ::std::os::raw::c_uint,
        pub __cur_writer: ::std::os::raw::c_int,
        pub __shared: ::std::os::raw::c_int,
        pub __rwelision: ::std::os::raw::c_schar,
        pub __pad1: [::std::os::raw::c_uchar; 7usize],
        pub __pad2: ::std::os::raw::c_ulong,
        pub __flags: ::std::os::raw::c_uint,
    }
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of __pthread_rwlock_arch_t"]
            [::std::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
        ["Alignment of __pthread_rwlock_arch_t"]
            [::std::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
        ["Offset of field: __pthread_rwlock_arch_t::__readers"]
            [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
        ["Offset of field: __pthread_rwlock_arch_t::__writers"]
            [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
        ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
            [::std::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
        ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
            [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
        ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
            [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
        ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
            [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
        ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
            [::std::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 24usize];
        ["Offset of field: __pthread_rwlock_arch_t::__shared"]
            [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
        ["Offset of field: __pthread_rwlock_arch_t::__rwelision"]
            [::std::mem::offset_of!(__pthread_rwlock_arch_t, __rwelision) - 32usize];
        ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
            [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 33usize];
        ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
            [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
        ["Offset of field: __pthread_rwlock_arch_t::__flags"]
            [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
    };
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union pthread_rwlock_t {
        pub __data: root::__pthread_rwlock_arch_t,
        pub __size: [::std::os::raw::c_char; 56usize],
        pub __align: ::std::os::raw::c_long,
    }
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of pthread_rwlock_t"][::std::mem::size_of::<pthread_rwlock_t>() - 56usize];
        ["Alignment of pthread_rwlock_t"][::std::mem::align_of::<pthread_rwlock_t>() - 8usize];
        ["Offset of field: pthread_rwlock_t::__data"]
            [::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
        ["Offset of field: pthread_rwlock_t::__size"]
            [::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
        ["Offset of field: pthread_rwlock_t::__align"]
            [::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
    };
    pub mod mozilla {
        #[allow(unused_imports)]
        use self::super::super::root;
        pub mod detail {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct AssertionConditionType {
                pub _address: u8,
            }
            pub type AssertionConditionType_ValueT = u8;
            #[repr(u32)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum StorageType {
                AsBase = 0,
                AsMember = 1,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct HasPointerTypeHelper {
                pub _address: u8,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of HasPointerTypeHelper"]
                    [::std::mem::size_of::<HasPointerTypeHelper>() - 1usize];
                ["Alignment of HasPointerTypeHelper"]
                    [::std::mem::align_of::<HasPointerTypeHelper>() - 1usize];
            };
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct HasPointerType {
                pub _address: u8,
            }
            pub type PointerTypeImpl_Type = root::__BindgenOpaqueArray<u8, 0usize>;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct PointerType {
                pub _address: u8,
            }
            pub type PointerType_Type = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct UniqueSelector {
                pub _address: u8,
            }
            #[doc = " UniquePtr is a smart pointer that wholly owns a resource.  Ownership may be\n transferred out of a UniquePtr through explicit action, but otherwise the\n resource is destroyed when the UniquePtr is destroyed.\n\n UniquePtr is similar to C++98's std::auto_ptr, but it improves upon auto_ptr\n in one crucial way: it's impossible to copy a UniquePtr.  Copying an auto_ptr\n obviously *can't* copy ownership of its singly-owned resource.  So what\n happens if you try to copy one?  Bizarrely, ownership is implicitly\n *transferred*, preserving single ownership but breaking code that assumes a\n copy of an object is identical to the original.  (This is why auto_ptr is\n prohibited in STL containers.)\n\n UniquePtr solves this problem by being *movable* rather than copyable.\n Instead of passing a |UniquePtr u| directly to the constructor or assignment\n operator, you pass |Move(u)|.  In doing so you indicate that you're *moving*\n ownership out of |u|, into the target of the construction/assignment.  After\n the transfer completes, |u| contains |nullptr| and may be safely destroyed.\n This preserves single ownership but also allows UniquePtr to be moved by\n algorithms that have been made move-safe.  (Note: if |u| is instead a\n temporary expression, don't use |Move()|: just pass the expression, because\n it's already move-ready.  For more information see Move.h.)\n\n UniquePtr is also better than std::auto_ptr in that the deletion operation is\n customizable.  An optional second template parameter specifies a class that\n (through its operator()(T*)) implements the desired deletion policy.  If no\n policy is specified, mozilla::DefaultDelete<T> is used -- which will either\n |delete| or |delete[]| the resource, depending whether the resource is an\n array.  Custom deletion policies ideally should be empty classes (no member\n fields, no member fields in base classes, no virtual methods/inheritance),\n because then UniquePtr can be just as efficient as a raw pointer.\n\n Use of UniquePtr proceeds like so:\n\n   UniquePtr<int> g1; // initializes to nullptr\n   g1.reset(new int); // switch resources using reset()\n   g1 = nullptr; // clears g1, deletes the int\n\n   UniquePtr<int> g2(new int); // owns that int\n   int* p = g2.release(); // g2 leaks its int -- still requires deletion\n   delete p; // now freed\n\n   struct S { int x; S(int x) : x(x) {} };\n   UniquePtr<S> g3, g4(new S(5));\n   g3 = std::move(g4); // g3 owns the S, g4 cleared\n   S* p = g3.get(); // g3 still owns |p|\n   assert(g3->x == 5); // operator-> works (if .get() != nullptr)\n   assert((*g3).x == 5); // also operator* (again, if not cleared)\n   std::swap(g3, g4); // g4 now owns the S, g3 cleared\n   g3.swap(g4);  // g3 now owns the S, g4 cleared\n   UniquePtr<S> g5(std::move(g3)); // g5 owns the S, g3 cleared\n   g5.reset(); // deletes the S, g5 cleared\n\n   struct FreePolicy { void operator()(void* p) { free(p); } };\n   UniquePtr<int, FreePolicy> g6(static_cast<int*>(malloc(sizeof(int))));\n   int* ptr = g6.get();\n   g6 = nullptr; // calls free(ptr)\n\n Now, carefully note a few things you *can't* do:\n\n   UniquePtr<int> b1;\n   b1 = new int; // BAD: can only assign another UniquePtr\n   int* ptr = b1; // BAD: no auto-conversion to pointer, use get()\n\n   UniquePtr<int> b2(b1); // BAD: can't copy a UniquePtr\n   UniquePtr<int> b3 = b1; // BAD: can't copy-assign a UniquePtr\n\n (Note that changing a UniquePtr to store a direct |new| expression is\n permitted, but usually you should use MakeUnique, defined at the end of this\n header.)\n\n A few miscellaneous notes:\n\n UniquePtr, when not instantiated for an array type, can be move-constructed\n and move-assigned, not only from itself but from \"derived\" UniquePtr<U, E>\n instantiations where U converts to T and E converts to D.  If you want to use\n this, you're going to have to specify a deletion policy for both UniquePtr\n instantations, and T pretty much has to have a virtual destructor.  In other\n words, this doesn't work:\n\n   struct Base { virtual ~Base() {} };\n   struct Derived : Base {};\n\n   UniquePtr<Base> b1;\n   // BAD: DefaultDelete<Base> and DefaultDelete<Derived> don't interconvert\n   UniquePtr<Derived> d1(std::move(b));\n\n   UniquePtr<Base> b2;\n   UniquePtr<Derived, DefaultDelete<Base>> d2(std::move(b2)); // okay\n\n UniquePtr is specialized for array types.  Specializing with an array type\n creates a smart-pointer version of that array -- not a pointer to such an\n array.\n\n   UniquePtr<int[]> arr(new int[5]);\n   arr[0] = 4;\n\n What else is different?  Deletion of course uses |delete[]|.  An operator[]\n is provided.  Functionality that doesn't make sense for arrays is removed.\n The constructors and mutating methods only accept array pointers (not T*, U*\n that converts to T*, or UniquePtr<U[]> or UniquePtr<U>) or |nullptr|.\n\n It's perfectly okay for a function to return a UniquePtr. This transfers\n the UniquePtr's sole ownership of the data, to the fresh UniquePtr created\n in the calling function, that will then solely own that data. Such functions\n can return a local variable UniquePtr, |nullptr|, |UniquePtr(ptr)| where\n |ptr| is a |T*|, or a UniquePtr |Move()|'d from elsewhere.\n\n UniquePtr will commonly be a member of a class, with lifetime equivalent to\n that of that class.  If you want to expose the related resource, you could\n expose a raw pointer via |get()|, but ownership of a raw pointer is\n inherently unclear.  So it's better to expose a |const UniquePtr&| instead.\n This prohibits mutation but still allows use of |get()| when needed (but\n operator-> is preferred).  Of course, you can only use this smart pointer as\n long as the enclosing class instance remains live -- no different than if you\n exposed the |get()| raw pointer.\n\n To pass a UniquePtr-managed resource as a pointer, use a |const UniquePtr&|\n argument.  To specify an inout parameter (where the method may or may not\n take ownership of the resource, or reset it), or to specify an out parameter\n (where simply returning a |UniquePtr| isn't possible), use a |UniquePtr&|\n argument.  To unconditionally transfer ownership of a UniquePtr\n into a method, use a |UniquePtr| argument.  To conditionally transfer\n ownership of a resource into a method, should the method want it, use a\n |UniquePtr&&| argument."]
            pub type UniqueSelector_SingleObject = u8;
            #[repr(C)]
            #[derive(Debug, PartialEq)]
            pub struct TempPtrToSetterT<T, UniquePtrT> {
                pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
                pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<UniquePtrT>>,
                pub mDest: *mut UniquePtrT,
                pub mNewVal: *mut T,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct AllocPolicyBasedFreePolicy {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, PartialEq)]
            pub struct SprintfAppend {
                pub _base: root::mozilla::PrintfTarget,
                pub mBuf: *mut ::std::os::raw::c_char,
                pub mBufLen: usize,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of SprintfAppend"][::std::mem::size_of::<SprintfAppend>() - 32usize];
                ["Alignment of SprintfAppend"][::std::mem::align_of::<SprintfAppend>() - 8usize];
                ["Offset of field: SprintfAppend::mBuf"]
                    [::std::mem::offset_of!(SprintfAppend, mBuf) - 16usize];
                ["Offset of field: SprintfAppend::mBufLen"]
                    [::std::mem::offset_of!(SprintfAppend, mBufLen) - 24usize];
            };
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct LazyAssertedCastT<From> {
                pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<From>>,
                pub mVal: From,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct AllowDeprecatedAbsFixed {
                pub _base: root::std::false_type,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: AllowDeprecatedAbsFixed_open0_int_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::AllowDeprecatedAbsFixed>()
                        - 1usize];
                ["Align of template specialization: AllowDeprecatedAbsFixed_open0_int_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::AllowDeprecatedAbsFixed>()
                        - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: AllowDeprecatedAbsFixed_open0_long_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::AllowDeprecatedAbsFixed>()
                        - 1usize];
                ["Align of template specialization: AllowDeprecatedAbsFixed_open0_long_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::AllowDeprecatedAbsFixed>()
                        - 1usize];
            };
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct AllowDeprecatedAbs {
                pub _base: root::mozilla::detail::AllowDeprecatedAbsFixed,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: AllowDeprecatedAbs_open0_int_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::AllowDeprecatedAbs>() - 1usize];
                ["Align of template specialization: AllowDeprecatedAbs_open0_int_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::AllowDeprecatedAbs>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: AllowDeprecatedAbs_open0_long_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::AllowDeprecatedAbs>() - 1usize];
                ["Align of template specialization: AllowDeprecatedAbs_open0_long_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::AllowDeprecatedAbs>() - 1usize];
            };
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct AbsReturnType {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct FloatingPointTrait {
                pub _address: u8,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: FloatingPointTrait_open0_float_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::FloatingPointTrait>() - 1usize];
                ["Align of template specialization: FloatingPointTrait_open0_float_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::FloatingPointTrait>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: FloatingPointTrait_open0_double_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::FloatingPointTrait>() - 1usize];
                ["Align of template specialization: FloatingPointTrait_open0_double_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::FloatingPointTrait>() - 1usize];
            };
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct FuzzyEqualsEpsilon {
                pub _address: u8,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: FuzzyEqualsEpsilon_open0_float_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::FuzzyEqualsEpsilon>() - 1usize];
                ["Align of template specialization: FuzzyEqualsEpsilon_open0_float_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::FuzzyEqualsEpsilon>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: FuzzyEqualsEpsilon_open0_double_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::FuzzyEqualsEpsilon>() - 1usize];
                ["Align of template specialization: FuzzyEqualsEpsilon_open0_double_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::FuzzyEqualsEpsilon>() - 1usize];
            };
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct MaybePoisoner {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct IsMaybeImpl {
                pub _base: root::std::false_type,
            }
            pub type IsMaybe = root::mozilla::detail::IsMaybeImpl;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct AlignedChecker {
                pub _address: u8,
            }
            pub type supports_os<T> = T;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct MakeUnsignedChar {
                pub _address: u8,
            }
            pub type MakeUnsignedChar_Type = u8;
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: MakeUnsignedChar_open0_char16_t_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::MakeUnsignedChar>() - 1usize];
                ["Align of template specialization: MakeUnsignedChar_open0_char16_t_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::MakeUnsignedChar>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: MakeUnsignedChar_open0_char32_t_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::MakeUnsignedChar>() - 1usize];
                ["Align of template specialization: MakeUnsignedChar_open0_char32_t_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::MakeUnsignedChar>() - 1usize];
            };
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct WrapToSignedHelper {
                pub _address: u8,
            }
            pub type WrapToSignedHelper_SignedType = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct WrappingAddHelper {
                pub _address: u8,
            }
            pub type WrappingAddHelper_UnsignedT = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct WrappingSubtractHelper {
                pub _address: u8,
            }
            pub type WrappingSubtractHelper_UnsignedT = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct WrappingMultiplyHelper {
                pub _address: u8,
            }
            pub type WrappingMultiplyHelper_UnsignedT = u8;
            #[doc = " SelectVariantTypeHelper is used in the implementation of SelectVariantType."]
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct SelectVariantTypeHelper {
                pub _address: u8,
            }
            #[doc = " SelectVariantType takes a type T and a list of variant types Variants and\n yields a type Type, selected from Variants, that can store a value of type T\n or a reference to type T. If no such type was found, Type is not defined.\n SelectVariantType also has a `count` member that contains the total number of\n selectable types (which will be used to check that a requested type is not\n ambiguously present twice.)"]
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct SelectVariantType {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct VariantTag {
                pub _address: u8,
            }
            pub type VariantTag_Type = root::std::conditional_t;
            #[doc = " AsVariantTemporary stores a value of type T to allow construction of a\n Variant value via type inference. Because T is copied and there's no\n guarantee that the copy can be elided, AsVariantTemporary is best used with\n primitive or very small types."]
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct AsVariantTemporary {
                pub mValue: root::std::remove_const_t,
            }
            #[repr(i32)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum PackingStrategy {
                Variant = 0,
                NullIsOk = 1,
                LowBitTagIsError = 2,
                PackedVariant = 3,
                ZeroIsEmptyError = 4,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct EmptyWrapper<V> {
                pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<V>>,
                pub _base: V,
            }
            pub type AlignedStorageOrEmpty = root::std::conditional_t;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct ResultImplementationNullIsOkBase {
                pub mValue: root::mozilla::CompactPair,
            }
            pub type ResultImplementationNullIsOkBase_ErrorStorageType =
                root::mozilla::detail::UnusedZero;
            pub type UnsignedIntType = root::std::conditional_t;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct IsPackableVariant {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct IsPackableVariant_VEbool<V, E> {
                pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<V>>,
                pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<E>>,
                pub v: V,
                pub e: E,
                pub ok: bool,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct IsPackableVariant_EVbool<V, E> {
                pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<V>>,
                pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<E>>,
                pub e: E,
                pub v: V,
                pub ok: bool,
            }
            pub type IsPackableVariant_Impl = root::std::conditional_t;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct UnusedZero {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct UnusedZeroEnum {
                pub _address: u8,
            }
            pub type UnusedZeroEnum_StorageType = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct HasFreeLSB {
                pub _address: u8,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: HasFreeLSB_open0_ptr_void_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::HasFreeLSB>() - 1usize];
                ["Align of template specialization: HasFreeLSB_open0_ptr_void_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::HasFreeLSB>() - 1usize];
            };
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct SelectResultImpl {
                pub _address: u8,
            }
            pub type SelectResultImpl_Type = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct IsResult {
                pub _base: root::std::false_type,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: UnusedZero_open0_Error_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::UnusedZero>() - 1usize];
                ["Align of template specialization: UnusedZero_open0_Error_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::UnusedZero>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: UnusedZero_open0_OOM_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::UnusedZero>() - 1usize];
                ["Align of template specialization: UnusedZero_open0_OOM_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::UnusedZero>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: HasFreeLSB_open0_Error_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::HasFreeLSB>() - 1usize];
                ["Align of template specialization: HasFreeLSB_open0_Error_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::HasFreeLSB>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: HasFreeLSB_open0_OOM_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::HasFreeLSB>() - 1usize];
                ["Align of template specialization: HasFreeLSB_open0_OOM_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::HasFreeLSB>() - 1usize];
            };
            pub type IntrinsicBase_ValueType = u8;
            pub type IntrinsicBase_OrderedOp = u8;
            pub type IntrinsicMemoryOps_Base = u8;
            pub type IntrinsicAddSub_Base = u8;
            pub type IntrinsicIncDec_Base = u8;
            pub type AtomicIntrinsics_Base = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct ToStorageTypeArgument {
                pub _address: u8,
            }
            pub type AtomicBase_Intrinsics = u8;
            pub type AtomicBase_ValueType = root::mozilla::detail::AtomicBase_Intrinsics;
            pub type AtomicBaseIncDec_Base = u8;
            #[doc = " LinkedList supports refcounted elements using this adapter class. Clients\n using LinkedList<RefPtr<T>> will get a data structure that holds a strong\n reference to T as long as T is in the list."]
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct LinkedListElementTraits {
                pub _address: u8,
            }
            pub type LinkedListElementTraits_RawType<T> = *mut T;
            pub type LinkedListElementTraits_ConstRawType<T> = *const T;
            pub type LinkedListElementTraits_ClientType<T> = *mut T;
            pub type LinkedListElementTraits_ConstClientType<T> = *const T;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct UnwrapMaybeAtomic {
                pub _address: u8,
            }
            pub type UnwrapMaybeAtomic_Type<T> = T;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct HashTableEntry {
                pub _address: u8,
            }
            pub type HashTableEntry_NonConstT = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct EntrySlot {
                pub mEntry: *mut root::mozilla::detail::EntrySlot_Entry,
                pub mKeyHash: *mut root::mozilla::HashNumber,
            }
            pub type EntrySlot_NonConstT = u8;
            pub type EntrySlot_Entry = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct HashTable {
                pub _address: u8,
            }
            pub type HashTable_NonConstT = u8;
            pub type HashTable_Key = u8;
            pub type HashTable_Lookup = u8;
            pub type HashTable_Entry = u8;
            pub type HashTable_Slot = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct HashTable_Ptr {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct HashTable_AddPtr {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct HashTable_Iterator {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct HashTable_ModIterator {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct HashTable_Range {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct HashTable_Enum {
                pub _address: u8,
            }
            impl root::mozilla::detail::HashTable_FailureBehavior {
                pub const ReportFailure: root::mozilla::detail::HashTable_FailureBehavior =
                    HashTable_FailureBehavior::DontReportFailure;
            }
            #[repr(i32)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum HashTable_FailureBehavior {
                DontReportFailure = 0,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct HashTable_FakeSlot {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct HashTable_DoubleHash {
                pub _address: u8,
            }
            impl root::mozilla::detail::HashTable_LookupReason {
                pub const ForAdd: root::mozilla::detail::HashTable_LookupReason =
                    HashTable_LookupReason::ForNonAdd;
            }
            #[repr(i32)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum HashTable_LookupReason {
                ForNonAdd = 0,
            }
            impl root::mozilla::detail::HashTable_RebuildStatus {
                pub const Rehashed: root::mozilla::detail::HashTable_RebuildStatus =
                    HashTable_RebuildStatus::NotOverloaded;
            }
            impl root::mozilla::detail::HashTable_RebuildStatus {
                pub const RehashFailed: root::mozilla::detail::HashTable_RebuildStatus =
                    HashTable_RebuildStatus::NotOverloaded;
            }
            #[repr(i32)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum HashTable_RebuildStatus {
                NotOverloaded = 0,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct VectorTesting {
                _unused: [u8; 0],
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct CopyablePtr<T> {
                pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
                pub mPtr: T,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct PointedTo {
                pub _address: u8,
            }
            pub type PointedTo_Type = root::std::remove_reference_t;
            pub type PointedTo_NonConstType = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct RefCountLogger {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct RefCountLogger_ReleaseLogger {
                pub _address: u8,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of RefCountLogger_ReleaseLogger"]
                    [::std::mem::size_of::<RefCountLogger_ReleaseLogger>() - 1usize];
                ["Alignment of RefCountLogger_ReleaseLogger"]
                    [::std::mem::align_of::<RefCountLogger_ReleaseLogger>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of RefCountLogger"][::std::mem::size_of::<RefCountLogger>() - 1usize];
                ["Alignment of RefCountLogger"][::std::mem::align_of::<RefCountLogger>() - 1usize];
            };
            #[repr(u32)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum RefCountAtomicity {
                AtomicRefCount = 0,
                NonAtomicRefCount = 1,
            }
            pub type RefCounted_HasThreadSafeRefCnt = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct FreePolicy {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct HasReceiverTypeHelper {
                pub _address: u8,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of HasReceiverTypeHelper"]
                    [::std::mem::size_of::<HasReceiverTypeHelper>() - 1usize];
                ["Alignment of HasReceiverTypeHelper"]
                    [::std::mem::align_of::<HasReceiverTypeHelper>() - 1usize];
            };
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct HasReceiverType {
                pub _address: u8,
            }
            pub type ReceiverTypeImpl_Type = root::__BindgenOpaqueArray<u8, 0usize>;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct ReceiverType {
                pub _address: u8,
            }
            pub type ReceiverType_Type = u8;
            #[repr(C)]
            #[derive(Debug, PartialEq)]
            pub struct UniquePtrGetterTransfers {
                pub mPtr: *mut root::mozilla::detail::UniquePtrGetterTransfers_Ptr,
                pub mReceiver: root::mozilla::detail::UniquePtrGetterTransfers_Receiver,
            }
            #[doc = " UniquePtr is a smart pointer that wholly owns a resource.  Ownership may be\n transferred out of a UniquePtr through explicit action, but otherwise the\n resource is destroyed when the UniquePtr is destroyed.\n\n UniquePtr is similar to C++98's std::auto_ptr, but it improves upon auto_ptr\n in one crucial way: it's impossible to copy a UniquePtr.  Copying an auto_ptr\n obviously *can't* copy ownership of its singly-owned resource.  So what\n happens if you try to copy one?  Bizarrely, ownership is implicitly\n *transferred*, preserving single ownership but breaking code that assumes a\n copy of an object is identical to the original.  (This is why auto_ptr is\n prohibited in STL containers.)\n\n UniquePtr solves this problem by being *movable* rather than copyable.\n Instead of passing a |UniquePtr u| directly to the constructor or assignment\n operator, you pass |Move(u)|.  In doing so you indicate that you're *moving*\n ownership out of |u|, into the target of the construction/assignment.  After\n the transfer completes, |u| contains |nullptr| and may be safely destroyed.\n This preserves single ownership but also allows UniquePtr to be moved by\n algorithms that have been made move-safe.  (Note: if |u| is instead a\n temporary expression, don't use |Move()|: just pass the expression, because\n it's already move-ready.  For more information see Move.h.)\n\n UniquePtr is also better than std::auto_ptr in that the deletion operation is\n customizable.  An optional second template parameter specifies a class that\n (through its operator()(T*)) implements the desired deletion policy.  If no\n policy is specified, mozilla::DefaultDelete<T> is used -- which will either\n |delete| or |delete[]| the resource, depending whether the resource is an\n array.  Custom deletion policies ideally should be empty classes (no member\n fields, no member fields in base classes, no virtual methods/inheritance),\n because then UniquePtr can be just as efficient as a raw pointer.\n\n Use of UniquePtr proceeds like so:\n\n   UniquePtr<int> g1; // initializes to nullptr\n   g1.reset(new int); // switch resources using reset()\n   g1 = nullptr; // clears g1, deletes the int\n\n   UniquePtr<int> g2(new int); // owns that int\n   int* p = g2.release(); // g2 leaks its int -- still requires deletion\n   delete p; // now freed\n\n   struct S { int x; S(int x) : x(x) {} };\n   UniquePtr<S> g3, g4(new S(5));\n   g3 = std::move(g4); // g3 owns the S, g4 cleared\n   S* p = g3.get(); // g3 still owns |p|\n   assert(g3->x == 5); // operator-> works (if .get() != nullptr)\n   assert((*g3).x == 5); // also operator* (again, if not cleared)\n   std::swap(g3, g4); // g4 now owns the S, g3 cleared\n   g3.swap(g4);  // g3 now owns the S, g4 cleared\n   UniquePtr<S> g5(std::move(g3)); // g5 owns the S, g3 cleared\n   g5.reset(); // deletes the S, g5 cleared\n\n   struct FreePolicy { void operator()(void* p) { free(p); } };\n   UniquePtr<int, FreePolicy> g6(static_cast<int*>(malloc(sizeof(int))));\n   int* ptr = g6.get();\n   g6 = nullptr; // calls free(ptr)\n\n Now, carefully note a few things you *can't* do:\n\n   UniquePtr<int> b1;\n   b1 = new int; // BAD: can only assign another UniquePtr\n   int* ptr = b1; // BAD: no auto-conversion to pointer, use get()\n\n   UniquePtr<int> b2(b1); // BAD: can't copy a UniquePtr\n   UniquePtr<int> b3 = b1; // BAD: can't copy-assign a UniquePtr\n\n (Note that changing a UniquePtr to store a direct |new| expression is\n permitted, but usually you should use MakeUnique, defined at the end of this\n header.)\n\n A few miscellaneous notes:\n\n UniquePtr, when not instantiated for an array type, can be move-constructed\n and move-assigned, not only from itself but from \"derived\" UniquePtr<U, E>\n instantiations where U converts to T and E converts to D.  If you want to use\n this, you're going to have to specify a deletion policy for both UniquePtr\n instantations, and T pretty much has to have a virtual destructor.  In other\n words, this doesn't work:\n\n   struct Base { virtual ~Base() {} };\n   struct Derived : Base {};\n\n   UniquePtr<Base> b1;\n   // BAD: DefaultDelete<Base> and DefaultDelete<Derived> don't interconvert\n   UniquePtr<Derived> d1(std::move(b));\n\n   UniquePtr<Base> b2;\n   UniquePtr<Derived, DefaultDelete<Base>> d2(std::move(b2)); // okay\n\n UniquePtr is specialized for array types.  Specializing with an array type\n creates a smart-pointer version of that array -- not a pointer to such an\n array.\n\n   UniquePtr<int[]> arr(new int[5]);\n   arr[0] = 4;\n\n What else is different?  Deletion of course uses |delete[]|.  An operator[]\n is provided.  Functionality that doesn't make sense for arrays is removed.\n The constructors and mutating methods only accept array pointers (not T*, U*\n that converts to T*, or UniquePtr<U[]> or UniquePtr<U>) or |nullptr|.\n\n It's perfectly okay for a function to return a UniquePtr. This transfers\n the UniquePtr's sole ownership of the data, to the fresh UniquePtr created\n in the calling function, that will then solely own that data. Such functions\n can return a local variable UniquePtr, |nullptr|, |UniquePtr(ptr)| where\n |ptr| is a |T*|, or a UniquePtr |Move()|'d from elsewhere.\n\n UniquePtr will commonly be a member of a class, with lifetime equivalent to\n that of that class.  If you want to expose the related resource, you could\n expose a raw pointer via |get()|, but ownership of a raw pointer is\n inherently unclear.  So it's better to expose a |const UniquePtr&| instead.\n This prohibits mutation but still allows use of |get()| when needed (but\n operator-> is preferred).  Of course, you can only use this smart pointer as\n long as the enclosing class instance remains live -- no different than if you\n exposed the |get()| raw pointer.\n\n To pass a UniquePtr-managed resource as a pointer, use a |const UniquePtr&|\n argument.  To specify an inout parameter (where the method may or may not\n take ownership of the resource, or reset it), or to specify an out parameter\n (where simply returning a |UniquePtr| isn't possible), use a |UniquePtr&|\n argument.  To unconditionally transfer ownership of a UniquePtr\n into a method, use a |UniquePtr| argument.  To conditionally transfer\n ownership of a resource into a method, should the method want it, use a\n |UniquePtr&&| argument."]
            pub type UniquePtrGetterTransfers_Ptr = u8;
            pub type UniquePtrGetterTransfers_Receiver = root::mozilla::detail::ReceiverType;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct ConditionVariableImpl {
                _unused: [u8; 0],
            }
            #[repr(C)]
            #[derive(Debug, PartialEq)]
            pub struct MutexImpl {
                pub platformData_: [*mut ::std::os::raw::c_void; 5usize],
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct MutexImpl_PlatformData {
                _unused: [u8; 0],
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of MutexImpl"][::std::mem::size_of::<MutexImpl>() - 40usize];
                ["Alignment of MutexImpl"][::std::mem::align_of::<MutexImpl>() - 8usize];
                ["Offset of field: MutexImpl::platformData_"]
                    [::std::mem::offset_of!(MutexImpl, platformData_) - 0usize];
            };
            #[repr(C)]
            pub struct RWLockImpl {
                pub mRWLock: root::pthread_rwlock_t,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of RWLockImpl"][::std::mem::size_of::<RWLockImpl>() - 56usize];
                ["Alignment of RWLockImpl"][::std::mem::align_of::<RWLockImpl>() - 8usize];
                ["Offset of field: RWLockImpl::mRWLock"]
                    [::std::mem::offset_of!(RWLockImpl, mRWLock) - 0usize];
            };
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct UnsupportedType {
                pub _address: u8,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of UnsupportedType"][::std::mem::size_of::<UnsupportedType>() - 1usize];
                ["Alignment of UnsupportedType"]
                    [::std::mem::align_of::<UnsupportedType>() - 1usize];
            };
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct IsSupportedPass2 {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct IsSupported {
                pub _address: u8,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: IsSupported_open0_signed_char_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::IsSupported>() - 1usize];
                ["Align of template specialization: IsSupported_open0_signed_char_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::IsSupported>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: IsSupported_open0_unsigned_char_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::IsSupported>() - 1usize];
                ["Align of template specialization: IsSupported_open0_unsigned_char_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::IsSupported>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: IsSupported_open0_short_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::IsSupported>() - 1usize];
                ["Align of template specialization: IsSupported_open0_short_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::IsSupported>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: IsSupported_open0_unsigned_short_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::IsSupported>() - 1usize];
                ["Align of template specialization: IsSupported_open0_unsigned_short_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::IsSupported>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: IsSupported_open0_int_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::IsSupported>() - 1usize];
                ["Align of template specialization: IsSupported_open0_int_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::IsSupported>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: IsSupported_open0_unsigned_int_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::IsSupported>() - 1usize];
                ["Align of template specialization: IsSupported_open0_unsigned_int_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::IsSupported>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: IsSupported_open0_long_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::IsSupported>() - 1usize];
                ["Align of template specialization: IsSupported_open0_long_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::IsSupported>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: IsSupported_open0_unsigned_long_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::IsSupported>() - 1usize];
                ["Align of template specialization: IsSupported_open0_unsigned_long_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::IsSupported>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: IsSupportedPass2_open0_char_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::IsSupportedPass2>() - 1usize];
                ["Align of template specialization: IsSupportedPass2_open0_char_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::IsSupportedPass2>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: IsSupportedPass2_open0_signed_char_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::IsSupportedPass2>() - 1usize];
                ["Align of template specialization: IsSupportedPass2_open0_signed_char_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::IsSupportedPass2>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: IsSupportedPass2_open0_unsigned_char_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::IsSupportedPass2>() - 1usize];
                ["Align of template specialization: IsSupportedPass2_open0_unsigned_char_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::IsSupportedPass2>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: IsSupportedPass2_open0_short_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::IsSupportedPass2>() - 1usize];
                ["Align of template specialization: IsSupportedPass2_open0_short_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::IsSupportedPass2>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: IsSupportedPass2_open0_unsigned_short_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::IsSupportedPass2>() - 1usize];
                ["Align of template specialization: IsSupportedPass2_open0_unsigned_short_close0"] [:: std :: mem :: align_of :: < root :: mozilla :: detail :: IsSupportedPass2 > () - 1usize] ;
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: IsSupportedPass2_open0_int_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::IsSupportedPass2>() - 1usize];
                ["Align of template specialization: IsSupportedPass2_open0_int_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::IsSupportedPass2>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: IsSupportedPass2_open0_unsigned_int_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::IsSupportedPass2>() - 1usize];
                ["Align of template specialization: IsSupportedPass2_open0_unsigned_int_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::IsSupportedPass2>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: IsSupportedPass2_open0_long_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::IsSupportedPass2>() - 1usize];
                ["Align of template specialization: IsSupportedPass2_open0_long_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::IsSupportedPass2>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: IsSupportedPass2_open0_unsigned_long_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::IsSupportedPass2>() - 1usize];
                ["Align of template specialization: IsSupportedPass2_open0_unsigned_long_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::IsSupportedPass2>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: IsSupportedPass2_open0_long_long_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::IsSupportedPass2>() - 1usize];
                ["Align of template specialization: IsSupportedPass2_open0_long_long_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::IsSupportedPass2>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: IsSupportedPass2_open0_unsigned_long_long_close0"] [:: std :: mem :: size_of :: < root :: mozilla :: detail :: IsSupportedPass2 > () - 1usize] ;
                ["Align of template specialization: IsSupportedPass2_open0_unsigned_long_long_close0"] [:: std :: mem :: align_of :: < root :: mozilla :: detail :: IsSupportedPass2 > () - 1usize] ;
            };
            pub type TwiceBiggerType_Type = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct CastToCheckedIntImpl {
                pub _address: u8,
            }
            #[doc = " @class CheckedInt\n @brief Integer wrapper class checking for integer overflow and other errors\n @param T the integer type to wrap. Can be any type among the following:\n            - any basic integer type such as |int|\n            - any stdint type such as |int8_t|\n\n This class implements guarded integer arithmetic. Do a computation, check\n that isValid() returns true, you then have a guarantee that no problem, such\n as integer overflow, happened during this computation, and you can call\n value() to get the plain integer value.\n\n The arithmetic operators in this class are guaranteed not to raise a signal\n (e.g. in case of a division by zero).\n\n For example, suppose that you want to implement a function that computes\n (aX+aY)/aZ, that doesn't crash if aZ==0, and that reports on error (divide by\n zero or integer overflow). You could code it as follows:\n@code\nbool computeXPlusYOverZ(int aX, int aY, int aZ, int* aResult)\n{\nCheckedInt<int> checkedResult = (CheckedInt<int>(aX) + aY) / aZ;\nif (checkedResult.isValid()) {\naResult = checkedResult.value();\nreturn true;\n} else {\nreturn false;\n}\n}\n@endcode\n\n Implicit conversion from plain integers to checked integers is allowed. The\n plain integer is checked to be in range before being casted to the\n destination type. This means that the following lines all compile, and the\n resulting CheckedInts are correctly detected as valid or invalid:\n @code\n// 1 is of type int, is found to be in range for uint8_t, x is valid\nCheckedInt<uint8_t> x(1);\n// -1 is of type int, is found not to be in range for uint8_t, x is invalid\nCheckedInt<uint8_t> x(-1);\n// -1 is of type int, is found to be in range for int8_t, x is valid\nCheckedInt<int8_t> x(-1);\n// 1000 is of type int16_t, is found not to be in range for int8_t,\n// x is invalid\nCheckedInt<int8_t> x(int16_t(1000));\n// 3123456789 is of type uint32_t, is found not to be in range for int32_t,\n// x is invalid\nCheckedInt<int32_t> x(uint32_t(3123456789));\n @endcode\n Implicit conversion from\n checked integers to plain integers is not allowed. As shown in the\n above example, to get the value of a checked integer as a normal integer,\n call value().\n\n Arithmetic operations between checked and plain integers is allowed; the\n result type is the type of the checked integer.\n\n Checked integers of different types cannot be used in the same arithmetic\n expression.\n\n There are convenience typedefs for all stdint types, of the following form\n (these are just 2 examples):\n@code\ntypedef CheckedInt<int32_t> CheckedInt32;\ntypedef CheckedInt<uint16_t> CheckedUint16;\n@endcode"]
            pub type CastToCheckedIntImpl_ReturnType<T> = root::mozilla::CheckedInt<T>;
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: HasFreeLSB_open0_ptr_JSString_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::HasFreeLSB>() - 1usize];
                ["Align of template specialization: HasFreeLSB_open0_ptr_JSString_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::HasFreeLSB>() - 1usize];
            };
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: HasFreeLSB_open0_ptr_JSObject_close0"]
                    [::std::mem::size_of::<root::mozilla::detail::HasFreeLSB>() - 1usize];
                ["Align of template specialization: HasFreeLSB_open0_ptr_JSObject_close0"]
                    [::std::mem::align_of::<root::mozilla::detail::HasFreeLSB>() - 1usize];
            };
        }
        pub mod tl {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            extern "C" {
                #[link_name = "\u{1}value"]
                pub static Min_value: usize;
            }
            extern "C" {
                #[link_name = "\u{1}value"]
                pub static Max_value: usize;
            }
            extern "C" {
                #[link_name = "\u{1}value"]
                pub static FloorLog2_value: usize;
            }
            extern "C" {
                #[link_name = "\u{1}value"]
                pub static CeilingLog2_value: usize;
            }
            extern "C" {
                #[link_name = "\u{1}value"]
                pub static RoundUpPow2_value: usize;
            }
            #[doc = " Compute the number of bits in the given unsigned type."]
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct BitSize {
                pub _address: u8,
            }
            extern "C" {
                #[link_name = "\u{1}checkPrecondition"]
                pub static NBitMask_checkPrecondition: usize;
            }
            extern "C" {
                #[link_name = "\u{1}value"]
                pub static NBitMask_value: usize;
            }
            extern "C" {
                #[link_name = "\u{1}value"]
                pub static MulOverflowMask_value: usize;
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct MallocAllocPolicy {
            pub _address: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of MallocAllocPolicy"][::std::mem::size_of::<MallocAllocPolicy>() - 1usize];
            ["Alignment of MallocAllocPolicy"]
                [::std::mem::align_of::<MallocAllocPolicy>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct NeverAllocPolicy {
            pub _address: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of NeverAllocPolicy"][::std::mem::size_of::<NeverAllocPolicy>() - 1usize];
            ["Alignment of NeverAllocPolicy"][::std::mem::align_of::<NeverAllocPolicy>() - 1usize];
        };
        #[doc = " CompactPair is the logical concatenation of an instance of A with an instance\n B. Space is conserved when possible.  Neither A nor B may be a final class.\n\n In general if space conservation is not critical is preferred to use\n std::pair.\n\n It's typically clearer to have individual A and B member fields.  Except if\n you want the space-conserving qualities of CompactPair, you're probably\n better off not using this!\n\n No guarantees are provided about the memory layout of A and B, the order of\n initialization or destruction of A and B, and so on.  (This is approximately\n required to optimize space usage.)  The first/second names are merely\n conceptual!"]
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct CompactPair {
            pub _address: u8,
        }
        pub type CompactPair_Base = u8;
        #[doc = " UniquePtr is a smart pointer that wholly owns a resource.  Ownership may be\n transferred out of a UniquePtr through explicit action, but otherwise the\n resource is destroyed when the UniquePtr is destroyed.\n\n UniquePtr is similar to C++98's std::auto_ptr, but it improves upon auto_ptr\n in one crucial way: it's impossible to copy a UniquePtr.  Copying an auto_ptr\n obviously *can't* copy ownership of its singly-owned resource.  So what\n happens if you try to copy one?  Bizarrely, ownership is implicitly\n *transferred*, preserving single ownership but breaking code that assumes a\n copy of an object is identical to the original.  (This is why auto_ptr is\n prohibited in STL containers.)\n\n UniquePtr solves this problem by being *movable* rather than copyable.\n Instead of passing a |UniquePtr u| directly to the constructor or assignment\n operator, you pass |Move(u)|.  In doing so you indicate that you're *moving*\n ownership out of |u|, into the target of the construction/assignment.  After\n the transfer completes, |u| contains |nullptr| and may be safely destroyed.\n This preserves single ownership but also allows UniquePtr to be moved by\n algorithms that have been made move-safe.  (Note: if |u| is instead a\n temporary expression, don't use |Move()|: just pass the expression, because\n it's already move-ready.  For more information see Move.h.)\n\n UniquePtr is also better than std::auto_ptr in that the deletion operation is\n customizable.  An optional second template parameter specifies a class that\n (through its operator()(T*)) implements the desired deletion policy.  If no\n policy is specified, mozilla::DefaultDelete<T> is used -- which will either\n |delete| or |delete[]| the resource, depending whether the resource is an\n array.  Custom deletion policies ideally should be empty classes (no member\n fields, no member fields in base classes, no virtual methods/inheritance),\n because then UniquePtr can be just as efficient as a raw pointer.\n\n Use of UniquePtr proceeds like so:\n\n   UniquePtr<int> g1; // initializes to nullptr\n   g1.reset(new int); // switch resources using reset()\n   g1 = nullptr; // clears g1, deletes the int\n\n   UniquePtr<int> g2(new int); // owns that int\n   int* p = g2.release(); // g2 leaks its int -- still requires deletion\n   delete p; // now freed\n\n   struct S { int x; S(int x) : x(x) {} };\n   UniquePtr<S> g3, g4(new S(5));\n   g3 = std::move(g4); // g3 owns the S, g4 cleared\n   S* p = g3.get(); // g3 still owns |p|\n   assert(g3->x == 5); // operator-> works (if .get() != nullptr)\n   assert((*g3).x == 5); // also operator* (again, if not cleared)\n   std::swap(g3, g4); // g4 now owns the S, g3 cleared\n   g3.swap(g4);  // g3 now owns the S, g4 cleared\n   UniquePtr<S> g5(std::move(g3)); // g5 owns the S, g3 cleared\n   g5.reset(); // deletes the S, g5 cleared\n\n   struct FreePolicy { void operator()(void* p) { free(p); } };\n   UniquePtr<int, FreePolicy> g6(static_cast<int*>(malloc(sizeof(int))));\n   int* ptr = g6.get();\n   g6 = nullptr; // calls free(ptr)\n\n Now, carefully note a few things you *can't* do:\n\n   UniquePtr<int> b1;\n   b1 = new int; // BAD: can only assign another UniquePtr\n   int* ptr = b1; // BAD: no auto-conversion to pointer, use get()\n\n   UniquePtr<int> b2(b1); // BAD: can't copy a UniquePtr\n   UniquePtr<int> b3 = b1; // BAD: can't copy-assign a UniquePtr\n\n (Note that changing a UniquePtr to store a direct |new| expression is\n permitted, but usually you should use MakeUnique, defined at the end of this\n header.)\n\n A few miscellaneous notes:\n\n UniquePtr, when not instantiated for an array type, can be move-constructed\n and move-assigned, not only from itself but from \"derived\" UniquePtr<U, E>\n instantiations where U converts to T and E converts to D.  If you want to use\n this, you're going to have to specify a deletion policy for both UniquePtr\n instantations, and T pretty much has to have a virtual destructor.  In other\n words, this doesn't work:\n\n   struct Base { virtual ~Base() {} };\n   struct Derived : Base {};\n\n   UniquePtr<Base> b1;\n   // BAD: DefaultDelete<Base> and DefaultDelete<Derived> don't interconvert\n   UniquePtr<Derived> d1(std::move(b));\n\n   UniquePtr<Base> b2;\n   UniquePtr<Derived, DefaultDelete<Base>> d2(std::move(b2)); // okay\n\n UniquePtr is specialized for array types.  Specializing with an array type\n creates a smart-pointer version of that array -- not a pointer to such an\n array.\n\n   UniquePtr<int[]> arr(new int[5]);\n   arr[0] = 4;\n\n What else is different?  Deletion of course uses |delete[]|.  An operator[]\n is provided.  Functionality that doesn't make sense for arrays is removed.\n The constructors and mutating methods only accept array pointers (not T*, U*\n that converts to T*, or UniquePtr<U[]> or UniquePtr<U>) or |nullptr|.\n\n It's perfectly okay for a function to return a UniquePtr. This transfers\n the UniquePtr's sole ownership of the data, to the fresh UniquePtr created\n in the calling function, that will then solely own that data. Such functions\n can return a local variable UniquePtr, |nullptr|, |UniquePtr(ptr)| where\n |ptr| is a |T*|, or a UniquePtr |Move()|'d from elsewhere.\n\n UniquePtr will commonly be a member of a class, with lifetime equivalent to\n that of that class.  If you want to expose the related resource, you could\n expose a raw pointer via |get()|, but ownership of a raw pointer is\n inherently unclear.  So it's better to expose a |const UniquePtr&| instead.\n This prohibits mutation but still allows use of |get()| when needed (but\n operator-> is preferred).  Of course, you can only use this smart pointer as\n long as the enclosing class instance remains live -- no different than if you\n exposed the |get()| raw pointer.\n\n To pass a UniquePtr-managed resource as a pointer, use a |const UniquePtr&|\n argument.  To specify an inout parameter (where the method may or may not\n take ownership of the resource, or reset it), or to specify an out parameter\n (where simply returning a |UniquePtr| isn't possible), use a |UniquePtr&|\n argument.  To unconditionally transfer ownership of a UniquePtr\n into a method, use a |UniquePtr| argument.  To conditionally transfer\n ownership of a resource into a method, should the method want it, use a\n |UniquePtr&&| argument."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct UniquePtr {
            pub _address: u8,
        }
        pub type UniquePtr_ElementType = u8;
        pub type UniquePtr_DeleterType = u8;
        pub type UniquePtr_Pointer = u8;
        #[doc = " A default deletion policy using plain old operator delete.\n\n Note that this type can be specialized, but authors should beware of the risk\n that the specialization may at some point cease to match (either because it\n gets moved to a different compilation unit or the signature changes). If the\n non-specialized (|delete|-based) version compiles for that type but does the\n wrong thing, bad things could happen.\n\n This is a non-issue for types which are always incomplete (i.e. opaque handle\n types), since |delete|-ing such a type will always trigger a compilation\n error."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct DefaultDelete {
            pub _address: u8,
        }
        #[repr(C)]
        pub struct PrintfTarget__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct PrintfTarget {
            pub vtable_: *const PrintfTarget__bindgen_vtable,
            pub mEmitted: usize,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of PrintfTarget"][::std::mem::size_of::<PrintfTarget>() - 16usize];
            ["Alignment of PrintfTarget"][::std::mem::align_of::<PrintfTarget>() - 8usize];
            ["Offset of field: PrintfTarget::mEmitted"]
                [::std::mem::offset_of!(PrintfTarget, mEmitted) - 8usize];
        };
        pub type SmprintfPolicyPointer = u8;
        pub type SmprintfPointer = u8;
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct SprintfState<AllocPolicy> {
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<AllocPolicy>>,
            pub _base: root::mozilla::PrintfTarget,
            pub _base_1: AllocPolicy,
            pub mMaxlen: usize,
            pub mBase: *mut ::std::os::raw::c_char,
            pub mCur: *mut ::std::os::raw::c_char,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct FloatingPoint {
            pub _address: u8,
        }
        pub type FloatingPoint_Base = root::mozilla::detail::FloatingPointTrait;
        #[doc = " An unsigned integral type suitable for accessing the bitwise representation\n of T."]
        pub type FloatingPoint_Bits = root::mozilla::FloatingPoint_Base;
        pub type InfinityBits_Traits = root::mozilla::FloatingPoint;
        pub type SpecificNaNBits_Traits = root::mozilla::FloatingPoint;
        #[repr(C)]
        pub struct AlignedStorage2 {
            pub u: root::mozilla::AlignedStorage2_U,
        }
        #[repr(C)]
        pub union AlignedStorage2_U {
            pub mBytes: *mut ::std::os::raw::c_char,
            pub mDummy: u64,
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum NotNullTag {
            KnownNotNull = 0,
        }
        #[doc = " A version of CorruptionCanary that is suitable as a member of objects that\n are statically allocated."]
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct CorruptionCanaryForStatics {
            pub mValue: usize,
        }
        pub const CorruptionCanaryForStatics_kCanarySet: usize = 252382987;
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of CorruptionCanaryForStatics"]
                [::std::mem::size_of::<CorruptionCanaryForStatics>() - 8usize];
            ["Alignment of CorruptionCanaryForStatics"]
                [::std::mem::align_of::<CorruptionCanaryForStatics>() - 8usize];
            ["Offset of field: CorruptionCanaryForStatics::mValue"]
                [::std::mem::offset_of!(CorruptionCanaryForStatics, mValue) - 0usize];
        };
        #[doc = " This class is designed to cause crashes when various kinds of memory\n corruption are observed. For instance, let's say we have a class C where we\n suspect out-of-bounds writes to some members.  We can insert a member of type\n Poison near the members we suspect are being corrupted by out-of-bounds\n writes.  Or perhaps we have a class K we suspect is subject to use-after-free\n violations, in which case it doesn't particularly matter where in the class\n we add the member of type Poison.\n\n In either case, we then insert calls to Check() throughout the code.  Doing\n so enables us to narrow down the location where the corruption is occurring.\n A pleasant side-effect of these additional Check() calls is that crash\n signatures may become more regular, as crashes will ideally occur\n consolidated at the point of a Check(), rather than scattered about at\n various uses of the corrupted memory."]
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct CorruptionCanary {
            pub _base: root::mozilla::CorruptionCanaryForStatics,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of CorruptionCanary"][::std::mem::size_of::<CorruptionCanary>() - 8usize];
            ["Alignment of CorruptionCanary"][::std::mem::align_of::<CorruptionCanary>() - 8usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct Nothing {
            pub _address: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of Nothing"][::std::mem::size_of::<Nothing>() - 1usize];
            ["Alignment of Nothing"][::std::mem::align_of::<Nothing>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct Maybe {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct Maybe_SomeGuard {
            pub _address: u8,
        }
        pub type Maybe_ValueType = u8;
        pub type MallocSizeOf =
            ::std::option::Option<unsafe extern "C" fn(p: *const ::std::os::raw::c_void) -> usize>;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct RangedPtr<T> {
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
            pub mPtr: *mut T,
        }
        pub mod span_details {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct is_span_oracle {
                pub _base: root::std::false_type,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct is_span {
                pub _base: root::mozilla::span_details::is_span_oracle,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct is_std_array_oracle {
                pub _base: root::std::false_type,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct is_std_array {
                pub _base: root::mozilla::span_details::is_std_array_oracle,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct is_allowed_element_type_conversion {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct SpanKnownBounds {
                pub _address: u8,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of SpanKnownBounds"][::std::mem::size_of::<SpanKnownBounds>() - 1usize];
                ["Alignment of SpanKnownBounds"]
                    [::std::mem::align_of::<SpanKnownBounds>() - 1usize];
            };
            pub type span_iterator_element_type_ = root::__BindgenOpaqueArray<u8, 0usize>;
            pub type span_iterator_iterator_category = root::std::random_access_iterator_tag;
            pub type span_iterator_value_type = u8;
            pub type span_iterator_difference_type = isize;
            pub type span_iterator_reference = *mut root::std::conditional_t;
            pub type span_iterator_pointer = u8;
            pub type extent_type_index_type = usize;
        }
        pub type Span_element_type<ElementType> = ElementType;
        pub type Span_value_type = u8;
        pub type Span_index_type = usize;
        pub type Span_pointer<ElementType> = *mut root::mozilla::Span_element_type<ElementType>;
        pub type Span_reference<ElementType> = *mut root::mozilla::Span_element_type<ElementType>;
        pub type Span_iterator = u8;
        pub type Span_const_iterator = u8;
        pub type Span_reverse_iterator = u8;
        pub type Span_const_reverse_iterator = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct Span_storage_type<ElementType, ExtentType> {
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<ElementType>>,
            pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<ExtentType>>,
            pub _base: ExtentType,
            pub data_: root::mozilla::Span_pointer<ElementType>,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct OwningNonNull {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct StaticLocalRefPtr {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct StaticRefPtr {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct RefPtrTraits {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct AlignmentFinder {
            pub _address: u8,
        }
        pub type TimeStampValue = u64;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct TimeStampTests {
            _unused: [u8; 0],
        }
        #[doc = " Platform-specific implementation details of BaseTimeDuration."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct BaseTimeDurationPlatformUtils {
            pub _address: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of BaseTimeDurationPlatformUtils"]
                [::std::mem::size_of::<BaseTimeDurationPlatformUtils>() - 1usize];
            ["Alignment of BaseTimeDurationPlatformUtils"]
                [::std::mem::align_of::<BaseTimeDurationPlatformUtils>() - 1usize];
        };
        #[doc = " Instances of this class represent the length of an interval of time.\n Negative durations are allowed, meaning the end is before the start.\n\n Internally the duration is stored as a int64_t in units of\n PR_TicksPerSecond() when building with NSPR interval timers, or a\n system-dependent unit when building with system clocks.  The\n system-dependent unit must be constant, otherwise the semantics of\n this class would be broken.\n\n The ValueCalculator template parameter determines how arithmetic\n operations are performed on the integer count of ticks (mValue)."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct BaseTimeDuration {
            pub mValue: i64,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BaseTimeDuration__SomethingVeryRandomHere {
            _unused: [u8; 0],
        }
        #[doc = " Perform arithmetic operations on the value of a BaseTimeDuration without\n doing strict checks on the range of values."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct TimeDurationValueCalculator {
            pub _address: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of TimeDurationValueCalculator"]
                [::std::mem::size_of::<TimeDurationValueCalculator>() - 1usize];
            ["Alignment of TimeDurationValueCalculator"]
                [::std::mem::align_of::<TimeDurationValueCalculator>() - 1usize];
        };
        #[doc = " Specialization of BaseTimeDuration that uses TimeDurationValueCalculator for\n arithmetic on the mValue member.\n\n Use this class for time durations that are *not* expected to hold values of\n Forever (or the negative equivalent) or when such time duration are *not*\n expected to be used in arithmetic operations."]
        pub type TimeDuration = root::mozilla::BaseTimeDuration;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct TimeStamp {
            #[doc = " When built with PRIntervalTime, a value of 0 means this instance\n is \"null\". Otherwise, the low 32 bits represent a PRIntervalTime,\n and the high 32 bits represent a counter of the number of\n rollovers of PRIntervalTime that we've seen. This counter starts\n at 1 to avoid a real time colliding with the \"null\" value.\n\n PR_INTERVAL_MAX is set at 100,000 ticks per second. So the minimum\n time to wrap around is about 2^64/100000 seconds, i.e. about\n 5,849,424 years.\n\n When using a system clock, a value is system dependent."]
            pub mValue: root::mozilla::TimeStampValue,
        }
        #[doc = " Instances of this class represent the length of an interval of time.\n Negative durations are allowed, meaning the end is before the start.\n\n Internally the duration is stored as a int64_t in units of\n PR_TicksPerSecond() when building with NSPR interval timers, or a\n system-dependent unit when building with system clocks.  The\n system-dependent unit must be constant, otherwise the semantics of\n this class would be broken.\n\n The ValueCalculator template parameter determines how arithmetic\n operations are performed on the integer count of ticks (mValue)."]
        pub type TimeStamp_DurationType = root::mozilla::TimeDuration;
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of TimeStamp"][::std::mem::size_of::<TimeStamp>() - 8usize];
            ["Alignment of TimeStamp"][::std::mem::align_of::<TimeStamp>() - 8usize];
            ["Offset of field: TimeStamp::mValue"]
                [::std::mem::offset_of!(TimeStamp, mValue) - 0usize];
        };
        #[doc = " A code unit within a UTF-8 encoded string.  (A code unit is the smallest\n unit within the Unicode encoding of a string.  For UTF-8 this is an 8-bit\n number; for UTF-16 it would be a 16-bit number.)\n\n This is *not* the same as a single code point: in UTF-8, non-ASCII code\n points are constituted by multiple code units."]
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub union Utf8Unit {
            pub mValue: ::std::os::raw::c_char,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of Utf8Unit"][::std::mem::size_of::<Utf8Unit>() - 1usize];
            ["Alignment of Utf8Unit"][::std::mem::align_of::<Utf8Unit>() - 1usize];
            ["Offset of field: Utf8Unit::mValue"]
                [::std::mem::offset_of!(Utf8Unit, mValue) - 0usize];
        };
        pub type HashNumber = u32;
        #[doc = " A pseudorandom function mapping 32-bit integers to 32-bit integers.\n\n This is for when you're feeding private data (like pointer values or credit\n card numbers) to a non-crypto hash function (like HashBytes) and then using\n the hash code for something that untrusted parties could observe (like a JS\n Map). Plug in a HashCodeScrambler before that last step to avoid leaking the\n private data.\n\n By itself, this does not prevent hash-flooding DoS attacks, because an\n attacker can still generate many values with exactly equal hash codes by\n attacking the non-crypto hash function alone. Equal hash codes will, of\n course, still be equal however much you scramble them.\n\n The algorithm is SipHash-1-3. See <https://131002.net/siphash/>."]
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct HashCodeScrambler {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct HashCodeScrambler_SipHasher {
            pub _bindgen_opaque_blob: [u64; 4usize],
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of HashCodeScrambler_SipHasher"]
                [::std::mem::size_of::<HashCodeScrambler_SipHasher>() - 32usize];
            ["Alignment of HashCodeScrambler_SipHasher"]
                [::std::mem::align_of::<HashCodeScrambler_SipHasher>() - 8usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of HashCodeScrambler"][::std::mem::size_of::<HashCodeScrambler>() - 16usize];
            ["Alignment of HashCodeScrambler"]
                [::std::mem::align_of::<HashCodeScrambler>() - 8usize];
        };
        pub mod ipc {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct IPDLParamTraits {
                pub _address: u8,
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct VariantType {
            pub _address: u8,
        }
        pub type VariantType_Type<T> = T;
        extern "C" {
            #[link_name = "\u{1}index"]
            pub static VariantIndex_index: usize;
        }
        #[doc = " # mozilla::Variant\n\n A variant / tagged union / heterogenous disjoint union / sum-type template\n class. Similar in concept to (but not derived from) `boost::variant`.\n\n Sometimes, you may wish to use a C union with non-POD types. However, this is\n forbidden in C++ because it is not clear which type in the union should have\n its constructor and destructor run on creation and deletion\n respectively. This is the problem that `mozilla::Variant` solves.\n\n ## Usage\n\n A `mozilla::Variant` instance is constructed (via move or copy) from one of\n its variant types (ignoring const and references). It does *not* support\n construction from subclasses of variant types or types that coerce to one of\n the variant types.\n\n     Variant<char, uint32_t> v1('a');\n     Variant<UniquePtr<A>, B, C> v2(MakeUnique<A>());\n     Variant<bool, char> v3(VariantType<char>, 0); // disambiguation needed\n     Variant<int, int> v4(VariantIndex<1>, 0); // 2nd int\n\n Because specifying the full type of a Variant value is often verbose,\n there are two easier ways to construct values:\n\n A. AsVariant() can be used to construct a Variant value using type inference\n in contexts such as expressions or when returning values from functions.\n Because AsVariant() must copy or move the value into a temporary and this\n cannot necessarily be elided by the compiler, it's mostly appropriate only\n for use with primitive or very small types.\n\n     Variant<char, uint32_t> Foo() { return AsVariant('x'); }\n     // ...\n     Variant<char, uint32_t> v1 = Foo();  // v1 holds char('x').\n\n B. Brace-construction with VariantType or VariantIndex; this also allows\n in-place construction with any number of arguments.\n\n     struct AB { AB(int, int){...} };\n     static Variant<AB, bool> foo()\n     {\n       return {VariantIndex<0>{}, 1, 2};\n     }\n     // ...\n     Variant<AB, bool> v0 = Foo();  // v0 holds AB(1,2).\n\n All access to the contained value goes through type-safe accessors.\n Either the stored type, or the type index may be provided.\n\n     void\n     Foo(Variant<A, B, C> v)\n     {\n       if (v.is<A>()) {\n         A& ref = v.as<A>();\n         ...\n       } else (v.is<1>()) { // Instead of v.is<B>.\n         ...\n       } else {\n         ...\n       }\n     }\n\n In some situation, a Variant may be constructed from templated types, in\n which case it is possible that the same type could be given multiple times by\n an external developer. Or seemingly-different types could be aliases.\n In this case, repeated types can only be accessed through their index, to\n prevent ambiguous access by type.\n\n    // Bad!\n    template <typename T>\n    struct ResultOrError\n    {\n      Variant<T, int> m;\n      ResultOrError() : m(int(0)) {} // Error '0' by default\n      ResultOrError(const T& r) : m(r) {}\n      bool IsResult() const { return m.is<T>(); }\n      bool IsError() const { return m.is<int>(); }\n    };\n    // Now instantiante with the result being an int too:\n    ResultOrError<int> myResult(123); // Fail!\n    // In Variant<int, int>, which 'int' are we refering to, from inside\n    // ResultOrError functions?\n\n    // Good!\n    template <typename T>\n    struct ResultOrError\n    {\n      Variant<T, int> m;\n      ResultOrError() : m(VariantIndex<1>{}, 0) {} // Error '0' by default\n      ResultOrError(const T& r) : m(VariantIndex<0>{}, r) {}\n      bool IsResult() const { return m.is<0>(); } // 0 -> T\n      bool IsError() const { return m.is<1>(); } // 1 -> int\n    };\n    // Now instantiante with the result being an int too:\n    ResultOrError<int> myResult(123); // It now works!\n\n Attempting to use the contained value as type `T1` when the `Variant`\n instance contains a value of type `T2` causes an assertion failure.\n\n     A a;\n     Variant<A, B, C> v(a);\n     v.as<B>(); // <--- Assertion failure!\n\n Trying to use a `Variant<Ts...>` instance as some type `U` that is not a\n member of the set of `Ts...` is a compiler error.\n\n     A a;\n     Variant<A, B, C> v(a);\n     v.as<SomeRandomType>(); // <--- Compiler error!\n\n Additionally, you can turn a `Variant` that `is<T>` into a `T` by moving it\n out of the containing `Variant` instance with the `extract<T>` method:\n\n     Variant<UniquePtr<A>, B, C> v(MakeUnique<A>());\n     auto ptr = v.extract<UniquePtr<A>>();\n\n Finally, you can exhaustively match on the contained variant and branch into\n different code paths depending on which type is contained. This is preferred\n to manually checking every variant type T with is<T>() because it provides\n compile-time checking that you handled every type, rather than runtime\n assertion failures.\n\n     // Bad!\n     char* foo(Variant<A, B, C, D>& v) {\n       if (v.is<A>()) {\n         return ...;\n       } else if (v.is<B>()) {\n         return ...;\n       } else {\n         return doSomething(v.as<C>()); // Forgot about case D!\n       }\n     }\n\n     // Instead, a single function object (that can deal with all possible\n     // options) may be provided:\n     struct FooMatcher\n     {\n       // The return type of all matchers must be identical.\n       char* operator()(A& a) { ... }\n       char* operator()(B& b) { ... }\n       char* operator()(C& c) { ... }\n       char* operator()(D& d) { ... } // Compile-time error to forget D!\n     }\n     char* foo(Variant<A, B, C, D>& v) {\n       return v.match(FooMatcher());\n     }\n\n     // In some situations, a single generic lambda may also be appropriate:\n     char* foo(Variant<A, B, C, D>& v) {\n       return v.match([](auto&) {...});\n     }\n\n     // Alternatively, multiple function objects may be provided, each one\n     // corresponding to an option, in the same order:\n     char* foo(Variant<A, B, C, D>& v) {\n       return v.match([](A&) { ... },\n                      [](B&) { ... },\n                      [](C&) { ... },\n                      [](D&) { ... });\n     }\n\n     // In rare cases, the index of the currently-active alternative is\n     // needed, it may be obtained by adding a first parameter in the matcner\n     // callback, which will receive the index in its most compact type (just\n     // use `size_t` if the exact type is not important), e.g.:\n     char* foo(Variant<A, B, C, D>& v) {\n       return v.match([](auto aIndex, auto& aAlternative) {...});\n       // --OR--\n       return v.match([](size_t aIndex, auto& aAlternative) {...});\n     }\n\n ## Examples\n\n A tree is either an empty leaf, or a node with a value and two children:\n\n     struct Leaf { };\n\n     template<typename T>\n     struct Node\n     {\n       T value;\n       Tree<T>* left;\n       Tree<T>* right;\n     };\n\n     template<typename T>\n     using Tree = Variant<Leaf, Node<T>>;\n\n A copy-on-write string is either a non-owning reference to some existing\n string, or an owning reference to our copy:\n\n     class CopyOnWriteString\n     {\n       Variant<const char*, UniquePtr<char[]>> string;\n\n       ...\n     };\n\n Because Variant must be aligned suitable to hold any value stored within it,\n and because |alignas| requirements don't affect platform ABI with respect to\n how parameters are laid out in memory, Variant can't be used as the type of a\n function parameter.  Pass Variant to functions by pointer or reference\n instead."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct Variant {
            pub _address: u8,
        }
        pub type Variant_Tag = root::mozilla::detail::VariantTag;
        pub type Variant_Impl = u8;
        #[doc = " Empty struct, indicating success for operations that have no return value.\n For example, if you declare another empty struct `struct OutOfMemory {};`,\n then `Result<Ok, OutOfMemory>` represents either success or OOM."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct Ok {
            pub _address: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of Ok"][::std::mem::size_of::<Ok>() - 1usize];
            ["Alignment of Ok"][::std::mem::align_of::<Ok>() - 1usize];
        };
        #[doc = " A tag used to differentiate between GenericErrorResult created by the Err\n function (completely new error) and GenericErrorResult created by the\n Result::propagateErr function (propagated error). This can be used to track\n error propagation and eventually produce error stacks for logging/debugging\n purposes."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct ErrorPropagationTag {
            pub _address: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ErrorPropagationTag"][::std::mem::size_of::<ErrorPropagationTag>() - 1usize];
            ["Alignment of ErrorPropagationTag"]
                [::std::mem::align_of::<ErrorPropagationTag>() - 1usize];
        };
        #[doc = " Result<V, E> represents the outcome of an operation that can either succeed\n or fail. It contains either a success value of type V or an error value of\n type E.\n\n All Result methods are const, so results are basically immutable.\n This is just like Variant<V, E> but with a slightly different API, and the\n following cases are optimized so Result can be stored more efficiently:\n\n - If both the success and error types do not use their least significant bit,\n are trivially copyable and destructible, Result<V, E> is guaranteed to be as\n large as the larger type. This is determined via the HasFreeLSB trait. By\n default, empty classes (in particular Ok) and aligned pointer types are\n assumed to have a free LSB, but you can specialize this trait for other\n types. If the success type is empty, the representation is guaranteed to be\n all zero bits on success. Do not change this representation! There is JIT\n code that depends on it. (Implementation note: The lowest bit is used as a\n tag bit: 0 to indicate the Result's bits are a success value, 1 to indicate\n the Result's bits (with the 1 masked out) encode an error value)\n\n - Else, if the error type can't have a all-zero bits representation and is\n not larger than a pointer, a CompactPair is used to represent this rather\n than a Variant. This has shown to be better optimizable, and the template\n code is much simpler than that of Variant, so it should also compile faster.\n Whether an error type can't be all-zero bits, is determined via the\n UnusedZero trait. MFBT doesn't declare any public type UnusedZero, but\n nsresult is declared UnusedZero in XPCOM.\n\n The purpose of Result is to reduce the screwups caused by using `false` or\n `nullptr` to indicate errors.\n What screwups? See <https://bugzilla.mozilla.org/show_bug.cgi?id=912928> for\n a partial list.\n\n Result<const V, E> or Result<V, const E> are not meaningful. The success or\n error values in a Result instance are non-modifiable in-place anyway. This\n guarantee must also be maintained when evolving Result. They can be\n unwrap()ped, but this loses const qualification. However, Result<const V, E>\n or Result<V, const E> may be misleading and prevent movability. Just use\n Result<V, E>. (Result<const V*, E> may make sense though, just Result<const\n V* const, E> is not possible.)"]
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct Result {
            pub mImpl: root::mozilla::Result_Impl,
        }
        pub type Result_Impl = root::mozilla::detail::SelectResultImpl;
        pub type Result_ok_type<V> = V;
        pub type Result_err_type<E> = E;
        #[doc = " A type that auto-converts to an error Result. This is like a Result without\n a success type. It's the best return type for functions that always return\n an error--functions designed to build and populate error objects. It's also\n useful in error-handling macros; see MOZ_TRY for an example."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct GenericErrorResult<E> {
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<E>>,
            pub mErrorValue: E,
        }
        #[repr(u8)]
        #[doc = " An enum of memory ordering possibilities for atomics.\n\n Memory ordering is the observable state of distinct values in memory.\n (It's a separate concept from atomicity, which concerns whether an\n operation can ever be observed in an intermediate state.  Don't\n conflate the two!)  Given a sequence of operations in source code on\n memory, it is *not* always the case that, at all times and on all\n cores, those operations will appear to have occurred in that exact\n sequence.  First, the compiler might reorder that sequence, if it\n thinks another ordering will be more efficient.  Second, the CPU may\n not expose so consistent a view of memory.  CPUs will often perform\n their own instruction reordering, above and beyond that performed by\n the compiler.  And each core has its own memory caches, and accesses\n (reads and writes both) to \"memory\" may only resolve to out-of-date\n cache entries -- not to the \"most recently\" performed operation in\n some global sense.  Any access to a value that may be used by\n multiple threads, potentially across multiple cores, must therefore\n have a memory ordering imposed on it, for all code on all\n threads/cores to have a sufficiently coherent worldview.\n\n http://gcc.gnu.org/wiki/Atomic/GCCMM/AtomicSync and\n http://en.cppreference.com/w/cpp/atomic/memory_order go into more\n detail on all this, including examples of how each mode works.\n\n Note that for simplicity and practicality, not all of the modes in\n C++11 are supported.  The missing C++11 modes are either subsumed by\n the modes we provide below, or not relevant for the CPUs we support\n in Gecko.  These three modes are confusing enough as it is!"]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum MemoryOrdering {
            Relaxed = 0,
            ReleaseAcquire = 1,
            SequentiallyConsistent = 2,
        }
        #[doc = " DebugOnly contains a value of type T, but only in debug builds.  In release\n builds, it does not contain a value.  This helper is intended to be used with\n MOZ_ASSERT()-style macros, allowing one to write:\n\n   DebugOnly<bool> check = func();\n   MOZ_ASSERT(check);\n\n more concisely than declaring |check| conditional on #ifdef DEBUG.\n\n DebugOnly instances can only be coerced to T in debug builds.  In release\n builds they don't have a value, so type coercion is not well defined.\n\n NOTE: DebugOnly instances still take up one byte of space, plus padding, even\n in optimized, non-DEBUG builds (see bug 1253094 comment 37 for more info).\n For this reason the class is MOZ_STACK_CLASS to prevent consumers using\n DebugOnly for struct/class members and unwittingly inflating the size of\n their objects in release builds."]
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct DebugOnly {
            pub _address: u8,
        }
        pub type Array_ElementType<T> = T;
        pub type Array_iterator<T> = *mut T;
        pub type Array_const_iterator<T> = *const T;
        pub type Array_reverse_iterator = u8;
        pub type Array_const_reverse_iterator = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct EnumTypeFitsWithin {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct MinContiguousEnumValue {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct MaxContiguousEnumValue {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct MaxEnumValue {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct ContiguousEnumValues {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct ContiguousEnumSize {
            pub _address: u8,
        }
        pub type EnumeratedArray_ArrayType = u8;
        pub type EnumeratedArray_iterator = root::mozilla::EnumeratedArray_ArrayType;
        pub type EnumeratedArray_const_iterator = root::mozilla::EnumeratedArray_ArrayType;
        pub type EnumeratedArray_reverse_iterator = root::mozilla::EnumeratedArray_ArrayType;
        pub type EnumeratedArray_const_reverse_iterator = root::mozilla::EnumeratedArray_ArrayType;
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct LinkedListElement {
            pub mNext: *mut root::mozilla::LinkedListElement,
            pub mPrev: *mut root::mozilla::LinkedListElement,
            pub mIsSentinel: bool,
        }
        #[doc = " LinkedList supports refcounted elements using this adapter class. Clients\n using LinkedList<RefPtr<T>> will get a data structure that holds a strong\n reference to T as long as T is in the list."]
        pub type LinkedListElement_Traits = root::mozilla::detail::LinkedListElementTraits;
        pub type LinkedListElement_RawType = root::mozilla::LinkedListElement_Traits;
        pub type LinkedListElement_ConstRawType = root::mozilla::LinkedListElement_Traits;
        pub type LinkedListElement_ClientType = root::mozilla::LinkedListElement_Traits;
        pub type LinkedListElement_ConstClientType = root::mozilla::LinkedListElement_Traits;
        impl root::mozilla::LinkedListElement_NodeKind {
            pub const Sentinel: root::mozilla::LinkedListElement_NodeKind =
                LinkedListElement_NodeKind::Normal;
        }
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum LinkedListElement_NodeKind {
            Normal = 0,
        }
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct LinkedList {
            pub sentinel: root::mozilla::LinkedListElement,
        }
        #[doc = " LinkedList supports refcounted elements using this adapter class. Clients\n using LinkedList<RefPtr<T>> will get a data structure that holds a strong\n reference to T as long as T is in the list."]
        pub type LinkedList_Traits = root::mozilla::detail::LinkedListElementTraits;
        pub type LinkedList_RawType = root::mozilla::LinkedList_Traits;
        pub type LinkedList_ConstRawType = root::mozilla::LinkedList_Traits;
        pub type LinkedList_ClientType = root::mozilla::LinkedList_Traits;
        pub type LinkedList_ConstClientType = root::mozilla::LinkedList_Traits;
        pub type LinkedList_ElementType = *mut root::mozilla::LinkedListElement;
        pub type LinkedList_ConstElementType = *const root::mozilla::LinkedListElement;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct LinkedList_Iterator<Type> {
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<Type>>,
            pub mCurrent: Type,
        }
        pub type LinkedList_Iterator_iterator_category = root::std::forward_iterator_tag;
        pub type LinkedList_Iterator_value_type<T> = T;
        pub type LinkedList_Iterator_difference_type = isize;
        pub type LinkedList_Iterator_pointer<T> = *mut T;
        pub type LinkedList_Iterator_reference<T> = *mut T;
        pub type LinkedList_const_iterator =
            root::mozilla::LinkedList_Iterator<root::mozilla::LinkedList_ConstRawType>;
        pub type LinkedList_iterator =
            root::mozilla::LinkedList_Iterator<root::mozilla::LinkedList_RawType>;
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct AutoCleanLinkedList {
            pub _base: root::mozilla::LinkedList,
        }
        #[doc = " LinkedList supports refcounted elements using this adapter class. Clients\n using LinkedList<RefPtr<T>> will get a data structure that holds a strong\n reference to T as long as T is in the list."]
        pub type AutoCleanLinkedList_Traits = root::mozilla::detail::LinkedListElementTraits;
        pub type AutoCleanLinkedList_ClientType = root::mozilla::detail::LinkedListElementTraits;
        pub type BitSet_Word = root::mozilla::detail::UnwrapMaybeAtomic;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct BitSet_Reference {
            pub mBitSet: *mut u8,
            pub mPos: usize,
        }
        #[doc = " Opaque<T> is a replacement for integral T in cases where only comparisons\n must be supported, and it's desirable to prevent accidental dependency on\n exact values."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct Opaque<T> {
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
            pub mValue: T,
        }
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct ReentrancyGuard {
            pub _address: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ReentrancyGuard"][::std::mem::size_of::<ReentrancyGuard>() - 1usize];
            ["Alignment of ReentrancyGuard"][::std::mem::align_of::<ReentrancyGuard>() - 1usize];
        };
        #[doc = " Opaque<T> is a replacement for integral T in cases where only comparisons\n must be supported, and it's desirable to prevent accidental dependency on\n exact values."]
        pub type Generation = root::mozilla::Opaque<u64>;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct HashMap {
            pub _address: u8,
        }
        pub type HashMap_TableEntry = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct HashMap_MapHashPolicy {
            pub _address: u8,
        }
        pub type HashMap_MapHashPolicy_Base = u8;
        pub type HashMap_MapHashPolicy_KeyType = u8;
        pub type HashMap_Impl = u8;
        pub type HashMap_Lookup = u8;
        pub type HashMap_Entry = u8;
        pub type HashMap_Ptr = u8;
        pub type HashMap_AddPtr = u8;
        pub type HashMap_Iterator = u8;
        pub type HashMap_ModIterator = u8;
        pub type HashMap_Range = u8;
        pub type HashMap_Enum = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct HashSet {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct HashSet_SetHashPolicy {
            pub _address: u8,
        }
        pub type HashSet_SetHashPolicy_Base = u8;
        pub type HashSet_SetHashPolicy_KeyType = u8;
        pub type HashSet_Impl = u8;
        pub type HashSet_Lookup = u8;
        pub type HashSet_Entry = u8;
        pub type HashSet_Ptr = u8;
        pub type HashSet_AddPtr = u8;
        pub type HashSet_Iterator = u8;
        pub type HashSet_ModIterator = u8;
        pub type HashSet_Range = u8;
        pub type HashSet_Enum = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct PointerHasher {
            pub _address: u8,
        }
        pub type PointerHasher_Lookup<Key> = Key;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct DefaultHasher {
            pub _address: u8,
        }
        pub type DefaultHasher_Lookup<Key> = Key;
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: DefaultHasher_open0_double_void_close0"]
                [::std::mem::size_of::<root::mozilla::DefaultHasher>() - 1usize];
            ["Align of template specialization: DefaultHasher_open0_double_void_close0"]
                [::std::mem::align_of::<root::mozilla::DefaultHasher>() - 1usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: DefaultHasher_open0_float_void_close0"]
                [::std::mem::size_of::<root::mozilla::DefaultHasher>() - 1usize];
            ["Align of template specialization: DefaultHasher_open0_float_void_close0"]
                [::std::mem::align_of::<root::mozilla::DefaultHasher>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct CStringHasher {
            pub _address: u8,
        }
        pub type CStringHasher_Key = *const ::std::os::raw::c_char;
        pub type CStringHasher_Lookup = *const ::std::os::raw::c_char;
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of CStringHasher"][::std::mem::size_of::<CStringHasher>() - 1usize];
            ["Alignment of CStringHasher"][::std::mem::align_of::<CStringHasher>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct FallibleHashMethods {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct HashMapEntry {
            pub _address: u8,
        }
        pub type HashMapEntry_KeyType = u8;
        pub type HashMapEntry_ValueType = u8;
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum StackCaptureOptions {
            NoStack = 0,
            Full = 1,
            NonNative = 2,
        }
        #[repr(C)]
        pub struct FailureLatch__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct FailureLatch {
            pub vtable_: *const FailureLatch__bindgen_vtable,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of FailureLatch"][::std::mem::size_of::<FailureLatch>() - 8usize];
            ["Alignment of FailureLatch"][::std::mem::align_of::<FailureLatch>() - 8usize];
        };
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct FailureLatchInfallibleSource {
            pub _base: root::mozilla::FailureLatch,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of FailureLatchInfallibleSource"]
                [::std::mem::size_of::<FailureLatchInfallibleSource>() - 8usize];
            ["Alignment of FailureLatchInfallibleSource"]
                [::std::mem::align_of::<FailureLatchInfallibleSource>() - 8usize];
        };
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct FailureLatchSource {
            pub _base: root::mozilla::FailureLatch,
            pub mFailed: bool,
            pub mReason: root::std::string,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of FailureLatchSource"][::std::mem::size_of::<FailureLatchSource>() - 48usize];
            ["Alignment of FailureLatchSource"]
                [::std::mem::align_of::<FailureLatchSource>() - 8usize];
            ["Offset of field: FailureLatchSource::mFailed"]
                [::std::mem::offset_of!(FailureLatchSource, mFailed) - 8usize];
            ["Offset of field: FailureLatchSource::mReason"]
                [::std::mem::offset_of!(FailureLatchSource, mReason) - 16usize];
        };
        pub type Vector_Impl = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct Vector_CapacityAndReserved {
            pub mCapacity: usize,
        }
        pub type Vector_ElementType<T> = T;
        pub const Vector_InlineLength: root::mozilla::Vector__bindgen_ty_1 =
            Vector__bindgen_ty_1::InlineLength;
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum Vector__bindgen_ty_1 {
            InlineLength = 0,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct Vector_Range<T> {
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
            pub mCur: *mut T,
            pub mEnd: *mut T,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct Vector_ConstRange<T> {
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
            pub mCur: *const T,
            pub mEnd: *const T,
        }
        #[repr(C)]
        pub struct JSONWriteFunc__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct JSONWriteFunc {
            pub vtable_: *const JSONWriteFunc__bindgen_vtable,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of JSONWriteFunc"][::std::mem::size_of::<JSONWriteFunc>() - 8usize];
            ["Alignment of JSONWriteFunc"][::std::mem::align_of::<JSONWriteFunc>() - 8usize];
        };
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct JSONWriter {
            pub mMaybeOwnedWriter: u64,
            pub mWriter: *mut root::mozilla::JSONWriteFunc,
            pub mNeedComma: root::__BindgenOpaqueArray<u64, 4usize>,
            pub mNeedNewlines: root::__BindgenOpaqueArray<u64, 4usize>,
            pub mDepth: usize,
        }
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct JSONWriter_EscapedString {
            pub mStringSpan: root::__BindgenOpaqueArray<u64, 2usize>,
            pub mOwnedStr: u64,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of JSONWriter_EscapedString"]
                [::std::mem::size_of::<JSONWriter_EscapedString>() - 24usize];
            ["Alignment of JSONWriter_EscapedString"]
                [::std::mem::align_of::<JSONWriter_EscapedString>() - 8usize];
            ["Offset of field: JSONWriter_EscapedString::mStringSpan"]
                [::std::mem::offset_of!(JSONWriter_EscapedString, mStringSpan) - 0usize];
            ["Offset of field: JSONWriter_EscapedString::mOwnedStr"]
                [::std::mem::offset_of!(JSONWriter_EscapedString, mOwnedStr) - 16usize];
        };
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum JSONWriter_CollectionStyle {
            MultiLineStyle = 0,
            SingleLineStyle = 1,
        }
        extern "C" {
            #[link_name = "\u{1}_ZN7mozilla10JSONWriter18scArrayBeginStringE"]
            pub static JSONWriter_scArrayBeginString: root::__BindgenOpaqueArray<u64, 2usize>;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN7mozilla10JSONWriter16scArrayEndStringE"]
            pub static JSONWriter_scArrayEndString: root::__BindgenOpaqueArray<u64, 2usize>;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN7mozilla10JSONWriter13scCommaStringE"]
            pub static JSONWriter_scCommaString: root::__BindgenOpaqueArray<u64, 2usize>;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN7mozilla10JSONWriter13scEmptyStringE"]
            pub static JSONWriter_scEmptyString: root::__BindgenOpaqueArray<u64, 2usize>;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN7mozilla10JSONWriter13scFalseStringE"]
            pub static JSONWriter_scFalseString: root::__BindgenOpaqueArray<u64, 2usize>;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN7mozilla10JSONWriter15scNewLineStringE"]
            pub static JSONWriter_scNewLineString: root::__BindgenOpaqueArray<u64, 2usize>;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN7mozilla10JSONWriter12scNullStringE"]
            pub static JSONWriter_scNullString: root::__BindgenOpaqueArray<u64, 2usize>;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN7mozilla10JSONWriter19scObjectBeginStringE"]
            pub static JSONWriter_scObjectBeginString: root::__BindgenOpaqueArray<u64, 2usize>;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN7mozilla10JSONWriter17scObjectEndStringE"]
            pub static JSONWriter_scObjectEndString: root::__BindgenOpaqueArray<u64, 2usize>;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN7mozilla10JSONWriter21scPropertyBeginStringE"]
            pub static JSONWriter_scPropertyBeginString: root::__BindgenOpaqueArray<u64, 2usize>;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN7mozilla10JSONWriter19scPropertyEndStringE"]
            pub static JSONWriter_scPropertyEndString: root::__BindgenOpaqueArray<u64, 2usize>;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN7mozilla10JSONWriter13scQuoteStringE"]
            pub static JSONWriter_scQuoteString: root::__BindgenOpaqueArray<u64, 2usize>;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN7mozilla10JSONWriter13scSpaceStringE"]
            pub static JSONWriter_scSpaceString: root::__BindgenOpaqueArray<u64, 2usize>;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN7mozilla10JSONWriter22scTopObjectBeginStringE"]
            pub static JSONWriter_scTopObjectBeginString: root::__BindgenOpaqueArray<u64, 2usize>;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN7mozilla10JSONWriter20scTopObjectEndStringE"]
            pub static JSONWriter_scTopObjectEndString: root::__BindgenOpaqueArray<u64, 2usize>;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN7mozilla10JSONWriter12scTrueStringE"]
            pub static JSONWriter_scTrueString: root::__BindgenOpaqueArray<u64, 2usize>;
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of JSONWriter"][::std::mem::size_of::<JSONWriter>() - 88usize];
            ["Alignment of JSONWriter"][::std::mem::align_of::<JSONWriter>() - 8usize];
            ["Offset of field: JSONWriter::mMaybeOwnedWriter"]
                [::std::mem::offset_of!(JSONWriter, mMaybeOwnedWriter) - 0usize];
            ["Offset of field: JSONWriter::mWriter"]
                [::std::mem::offset_of!(JSONWriter, mWriter) - 8usize];
            ["Offset of field: JSONWriter::mNeedComma"]
                [::std::mem::offset_of!(JSONWriter, mNeedComma) - 16usize];
            ["Offset of field: JSONWriter::mNeedNewlines"]
                [::std::mem::offset_of!(JSONWriter, mNeedNewlines) - 48usize];
            ["Offset of field: JSONWriter::mDepth"]
                [::std::mem::offset_of!(JSONWriter, mDepth) - 80usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct NotNull<T> {
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
            pub mBasePtr: root::mozilla::detail::CopyablePtr<T>,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct MovingNotNull<T> {
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
            pub mBasePtr: T,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct ProportionValue {
            pub mIntegralValue: root::mozilla::ProportionValue_UnderlyingType,
        }
        pub type ProportionValue_UnderlyingType = u32;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct ProportionValue_Internal {
            pub _address: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProportionValue_Internal"]
                [::std::mem::size_of::<ProportionValue_Internal>() - 1usize];
            ["Alignment of ProportionValue_Internal"]
                [::std::mem::align_of::<ProportionValue_Internal>() - 1usize];
        };
        pub const ProportionValue_scFractionalBits: ::std::os::raw::c_uint = 31;
        pub const ProportionValue_scMaxU: root::mozilla::ProportionValue_UnderlyingType =
            2147483648;
        pub const ProportionValue_scMaxD: f64 = 2147483648.0;
        pub const ProportionValue_scInvMaxD: f64 = 0.0000000004656612873077393;
        pub const ProportionValue_scInvalidU: root::mozilla::ProportionValue_UnderlyingType =
            4294967295;
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProportionValue"][::std::mem::size_of::<ProportionValue>() - 4usize];
            ["Alignment of ProportionValue"][::std::mem::align_of::<ProportionValue>() - 4usize];
            ["Offset of field: ProportionValue::mIntegralValue"]
                [::std::mem::offset_of!(ProportionValue, mIntegralValue) - 0usize];
        };
        pub mod literals {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct RefCounted {
            pub _address: u8,
        }
        pub mod external {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
        #[repr(C)]
        pub struct ProgressLogger {
            pub mGlobalProgressOrNull: root::RefPtr<root::mozilla::ProgressLogger_SharedProgress>,
            pub mLocalStartInGlobalSpace: root::mozilla::ProportionValue,
            pub mLocalToGlobalMultiplier: root::mozilla::ProportionValue,
            pub mLocationAtDestruction: *const ::std::os::raw::c_char,
        }
        #[repr(C)]
        pub struct ProgressLogger_SharedProgress {
            pub __bindgen_padding_0: [u32; 2usize],
            pub mProgress: u32,
            pub mLastLocation: u64,
        }
        extern "C" {
            #[link_name = "\u{1}_ZN7mozilla14ProgressLogger14SharedProgress18NO_LOCATION_UPDATEE"]
            pub static ProgressLogger_SharedProgress_NO_LOCATION_UPDATE:
                *const ::std::os::raw::c_char;
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProgressLogger_SharedProgress"]
                [::std::mem::size_of::<ProgressLogger_SharedProgress>() - 24usize];
            ["Alignment of ProgressLogger_SharedProgress"]
                [::std::mem::align_of::<ProgressLogger_SharedProgress>() - 8usize];
            ["Offset of field: ProgressLogger_SharedProgress::mProgress"]
                [::std::mem::offset_of!(ProgressLogger_SharedProgress, mProgress) - 8usize];
            ["Offset of field: ProgressLogger_SharedProgress::mLastLocation"]
                [::std::mem::offset_of!(ProgressLogger_SharedProgress, mLastLocation) - 16usize];
        };
        extern "C" {
            #[link_name = "\u{1}_ZN7mozilla14ProgressLogger18NO_LOCATION_UPDATEE"]
            pub static ProgressLogger_NO_LOCATION_UPDATE: *const ::std::os::raw::c_char;
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProgressLogger"][::std::mem::size_of::<ProgressLogger>() - 24usize];
            ["Alignment of ProgressLogger"][::std::mem::align_of::<ProgressLogger>() - 8usize];
            ["Offset of field: ProgressLogger::mGlobalProgressOrNull"]
                [::std::mem::offset_of!(ProgressLogger, mGlobalProgressOrNull) - 0usize];
            ["Offset of field: ProgressLogger::mLocalStartInGlobalSpace"]
                [::std::mem::offset_of!(ProgressLogger, mLocalStartInGlobalSpace) - 8usize];
            ["Offset of field: ProgressLogger::mLocalToGlobalMultiplier"]
                [::std::mem::offset_of!(ProgressLogger, mLocalToGlobalMultiplier) - 12usize];
            ["Offset of field: ProgressLogger::mLocationAtDestruction"]
                [::std::mem::offset_of!(ProgressLogger, mLocationAtDestruction) - 16usize];
        };
        #[repr(C)]
        pub struct ProgressLogger_IndexAndProgressLoggerRange {
            pub mGlobalProgressOrNull: root::RefPtr<root::mozilla::ProgressLogger_SharedProgress>,
            pub mLoopStartInGlobalSpace: root::mozilla::ProportionValue,
            pub mLoopIncrementInGlobalSpace: root::mozilla::ProportionValue,
            pub mLoopCount: u32,
            pub mLocationOrNullEmptyToIgnoreAtEdges: *const ::std::os::raw::c_char,
        }
        #[repr(C)]
        pub struct ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLogger {
            pub index: u32,
            pub progressLogger: root::mozilla::ProgressLogger,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLogger"]
                [::std::mem::size_of::<
                    ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLogger,
                >() - 32usize];
            ["Alignment of ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLogger"]
                [::std::mem::align_of::<
                    ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLogger,
                >() - 8usize];
            ["Offset of field: ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLogger::index"] [:: std :: mem :: offset_of ! (ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLogger , index) - 0usize] ;
            ["Offset of field: ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLogger::progressLogger"] [:: std :: mem :: offset_of ! (ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLogger , progressLogger) - 8usize] ;
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerEndIterator {
            pub mIndex: u32,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerEndIterator"] [:: std :: mem :: size_of :: < ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerEndIterator > () - 4usize] ;
            ["Alignment of ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerEndIterator"] [:: std :: mem :: align_of :: < ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerEndIterator > () - 4usize] ;
            ["Offset of field: ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerEndIterator::mIndex"] [:: std :: mem :: offset_of ! (ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerEndIterator , mIndex) - 0usize] ;
        };
        #[repr(C)]
        pub struct ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerIterator {
            pub mGlobalProgressOrNull: root::RefPtr<root::mozilla::ProgressLogger_SharedProgress>,
            pub mLoopStartInGlobalSpace: root::mozilla::ProportionValue,
            pub mLoopIncrementInGlobalSpace: root::mozilla::ProportionValue,
            pub mIndex: u32,
            pub mLocationOrNullEmptyToIgnoreAtEdges: *const ::std::os::raw::c_char,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerIterator"]
                [::std::mem::size_of::<
                    ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerIterator,
                >() - 32usize];
            ["Alignment of ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerIterator"] [:: std :: mem :: align_of :: < ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerIterator > () - 8usize] ;
            ["Offset of field: ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerIterator::mGlobalProgressOrNull"] [:: std :: mem :: offset_of ! (ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerIterator , mGlobalProgressOrNull) - 0usize] ;
            ["Offset of field: ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerIterator::mLoopStartInGlobalSpace"] [:: std :: mem :: offset_of ! (ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerIterator , mLoopStartInGlobalSpace) - 8usize] ;
            ["Offset of field: ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerIterator::mLoopIncrementInGlobalSpace"] [:: std :: mem :: offset_of ! (ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerIterator , mLoopIncrementInGlobalSpace) - 12usize] ;
            ["Offset of field: ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerIterator::mIndex"] [:: std :: mem :: offset_of ! (ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerIterator , mIndex) - 16usize] ;
            ["Offset of field: ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerIterator::mLocationOrNullEmptyToIgnoreAtEdges"] [:: std :: mem :: offset_of ! (ProgressLogger_IndexAndProgressLoggerRange_IndexAndProgressLoggerIterator , mLocationOrNullEmptyToIgnoreAtEdges) - 24usize] ;
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProgressLogger_IndexAndProgressLoggerRange"]
                [::std::mem::size_of::<ProgressLogger_IndexAndProgressLoggerRange>() - 32usize];
            ["Alignment of ProgressLogger_IndexAndProgressLoggerRange"]
                [::std::mem::align_of::<ProgressLogger_IndexAndProgressLoggerRange>() - 8usize];
            ["Offset of field: ProgressLogger_IndexAndProgressLoggerRange::mGlobalProgressOrNull"] [:: std :: mem :: offset_of ! (ProgressLogger_IndexAndProgressLoggerRange , mGlobalProgressOrNull) - 0usize] ;
            ["Offset of field: ProgressLogger_IndexAndProgressLoggerRange::mLoopStartInGlobalSpace"] [:: std :: mem :: offset_of ! (ProgressLogger_IndexAndProgressLoggerRange , mLoopStartInGlobalSpace) - 8usize] ;
            ["Offset of field: ProgressLogger_IndexAndProgressLoggerRange::mLoopIncrementInGlobalSpace"] [:: std :: mem :: offset_of ! (ProgressLogger_IndexAndProgressLoggerRange , mLoopIncrementInGlobalSpace) - 12usize] ;
            ["Offset of field: ProgressLogger_IndexAndProgressLoggerRange::mLoopCount"][::std::mem::offset_of!(
                ProgressLogger_IndexAndProgressLoggerRange,
                mLoopCount
            )
                - 16usize];
            ["Offset of field: ProgressLogger_IndexAndProgressLoggerRange::mLocationOrNullEmptyToIgnoreAtEdges"] [:: std :: mem :: offset_of ! (ProgressLogger_IndexAndProgressLoggerRange , mLocationOrNullEmptyToIgnoreAtEdges) - 24usize] ;
        };
        pub type fallible_t = root::std::nothrow_t;
        pub type UniqueFreePtr = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct ULEB128Reader<T> {
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
            pub mValue: T,
            pub mShift: ::std::os::raw::c_uint,
        }
        pub type ProfileBufferIndex = u64;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct ProfileBufferBlockIndex {
            pub mBlockIndex: root::mozilla::ProfileBufferIndex,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProfileBufferBlockIndex"]
                [::std::mem::size_of::<ProfileBufferBlockIndex>() - 8usize];
            ["Alignment of ProfileBufferBlockIndex"]
                [::std::mem::align_of::<ProfileBufferBlockIndex>() - 8usize];
            ["Offset of field: ProfileBufferBlockIndex::mBlockIndex"]
                [::std::mem::offset_of!(ProfileBufferBlockIndex, mBlockIndex) - 0usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct unused_t {
            pub _address: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of unused_t"][::std::mem::size_of::<unused_t>() - 1usize];
            ["Alignment of unused_t"][::std::mem::align_of::<unused_t>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct ProfileBufferEntryReader {
            pub mCurrentSpan: root::mozilla::ProfileBufferEntryReader_SpanOfConstBytes,
            pub mNextSpanOrEmpty: root::mozilla::ProfileBufferEntryReader_SpanOfConstBytes,
            pub mCurrentBlockIndex: root::mozilla::ProfileBufferBlockIndex,
            pub mNextBlockIndex: root::mozilla::ProfileBufferBlockIndex,
        }
        pub type ProfileBufferEntryReader_Byte = u8;
        pub type ProfileBufferEntryReader_Length = u32;
        #[doc = " Span - slices for C++\n\n Span implements Rust's slice concept for C++. It's called \"Span\" instead of\n \"Slice\" to follow the naming used in C++ Core Guidelines.\n\n A Span wraps a pointer and a length that identify a non-owning view to a\n contiguous block of memory of objects of the same type. Various types,\n including (pre-decay) C arrays, XPCOM strings, nsTArray, mozilla::Array,\n mozilla::Range and contiguous standard-library containers, auto-convert\n into Spans when attempting to pass them as arguments to methods that take\n Spans. (Span itself autoconverts into mozilla::Range.)\n\n Like Rust's slices, Span provides safety against out-of-bounds access by\n performing run-time bound checks. However, unlike Rust's slices, Span\n cannot provide safety against use-after-free.\n\n (Note: Span is like Rust's slice only conceptually. Due to the lack of\n ABI guarantees, you should still decompose spans/slices to raw pointer\n and length parts when crossing the FFI. The Elements() and data() methods\n are guaranteed to return a non-null pointer even for zero-length spans,\n so the pointer can be used as a raw part of a Rust slice without further\n checks.)\n\n In addition to having constructors (with the support of deduction guides)\n that take various well-known types, a Span for an arbitrary type can be\n constructed from a pointer and a length or a pointer and another pointer\n pointing just past the last element.\n\n A Span<const char> or Span<const char16_t> can be obtained for const char*\n or const char16_t pointing to a zero-terminated string using the\n MakeStringSpan() function (which treats a nullptr argument equivalently\n to the empty string). Corresponding implicit constructor does not exist\n in order to avoid accidental construction in cases where const char* or\n const char16_t* do not point to a zero-terminated string.\n\n Span has methods that follow the Mozilla naming style and methods that\n don't. The methods that follow the Mozilla naming style are meant to be\n used directly from Mozilla code. The methods that don't are meant for\n integration with C++11 range-based loops and with meta-programming that\n expects the same methods that are found on the standard-library\n containers. For example, to decompose a Span into its parts in Mozilla\n code, use Elements() and Length() (as with nsTArray) instead of data()\n and size() (as with std::vector).\n\n The pointer and length wrapped by a Span cannot be changed after a Span has\n been created. When new values are required, simply create a new Span. Span\n has a method called Subspan() that works analogously to the Substring()\n method of XPCOM strings taking a start index and an optional length. As a\n Mozilla extension (relative to Microsoft's gsl::span that mozilla::Span is\n based on), Span has methods From(start), To(end) and FromTo(start, end)\n that correspond to Rust's &slice[start..], &slice[..end] and\n &slice[start..end], respectively. (That is, the end index is the index of\n the first element not to be included in the new subspan.)\n\n When indicating a Span that's only read from, const goes inside the type\n parameter. Don't put const in front of Span. That is:\n size_t ReadsFromOneSpanAndWritesToAnother(Span<const uint8_t> aReadFrom,\n                                           Span<uint8_t> aWrittenTo);\n\n Any Span<const T> can be viewed as Span<const uint8_t> using the function\n AsBytes(). Any Span<T> can be viewed as Span<uint8_t> using the function\n AsWritableBytes().\n\n Note that iterators from different Span instances are uncomparable, even if\n they refer to the same memory. This also applies to any spans derived via\n Subspan etc."]
        pub type ProfileBufferEntryReader_SpanOfConstBytes =
            root::__BindgenOpaqueArray<u64, 2usize>;
        pub type ProfileBufferEntryReader_difference_type = u32;
        pub type ProfileBufferEntryReader_value_type = root::mozilla::ProfileBufferEntryReader_Byte;
        pub type ProfileBufferEntryReader_pointer =
            *const root::mozilla::ProfileBufferEntryReader_Byte;
        pub type ProfileBufferEntryReader_reference =
            *const root::mozilla::ProfileBufferEntryReader_Byte;
        pub type ProfileBufferEntryReader_iterator_category = root::std::input_iterator_tag;
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct ProfileBufferEntryReader_DoubleSpanOfConstBytes {
            pub mFirstOrOnly: root::mozilla::ProfileBufferEntryReader_SpanOfConstBytes,
            pub mSecondOrEmpty: root::mozilla::ProfileBufferEntryReader_SpanOfConstBytes,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProfileBufferEntryReader_DoubleSpanOfConstBytes"][::std::mem::size_of::<
                ProfileBufferEntryReader_DoubleSpanOfConstBytes,
            >() - 32usize];
            ["Alignment of ProfileBufferEntryReader_DoubleSpanOfConstBytes"][::std::mem::align_of::<
                ProfileBufferEntryReader_DoubleSpanOfConstBytes,
            >() - 8usize];
            ["Offset of field: ProfileBufferEntryReader_DoubleSpanOfConstBytes::mFirstOrOnly"][::std::mem::offset_of!(
                ProfileBufferEntryReader_DoubleSpanOfConstBytes,
                mFirstOrOnly
            )
                - 0usize];
            ["Offset of field: ProfileBufferEntryReader_DoubleSpanOfConstBytes::mSecondOrEmpty"][::std::mem::offset_of!(
                ProfileBufferEntryReader_DoubleSpanOfConstBytes,
                mSecondOrEmpty
            )
                - 16usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProfileBufferEntryReader"]
                [::std::mem::size_of::<ProfileBufferEntryReader>() - 48usize];
            ["Alignment of ProfileBufferEntryReader"]
                [::std::mem::align_of::<ProfileBufferEntryReader>() - 8usize];
            ["Offset of field: ProfileBufferEntryReader::mCurrentSpan"]
                [::std::mem::offset_of!(ProfileBufferEntryReader, mCurrentSpan) - 0usize];
            ["Offset of field: ProfileBufferEntryReader::mNextSpanOrEmpty"]
                [::std::mem::offset_of!(ProfileBufferEntryReader, mNextSpanOrEmpty) - 16usize];
            ["Offset of field: ProfileBufferEntryReader::mCurrentBlockIndex"]
                [::std::mem::offset_of!(ProfileBufferEntryReader, mCurrentBlockIndex) - 32usize];
            ["Offset of field: ProfileBufferEntryReader::mNextBlockIndex"]
                [::std::mem::offset_of!(ProfileBufferEntryReader, mNextBlockIndex) - 40usize];
        };
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct ProfileBufferEntryWriter {
            pub mCurrentSpan: root::mozilla::ProfileBufferEntryWriter_SpanOfBytes,
            pub mNextSpanOrEmpty: root::mozilla::ProfileBufferEntryWriter_SpanOfBytes,
            pub mCurrentBlockIndex: root::mozilla::ProfileBufferBlockIndex,
            pub mNextBlockIndex: root::mozilla::ProfileBufferBlockIndex,
        }
        pub type ProfileBufferEntryWriter_Byte = u8;
        pub type ProfileBufferEntryWriter_Length = u32;
        #[doc = " Span - slices for C++\n\n Span implements Rust's slice concept for C++. It's called \"Span\" instead of\n \"Slice\" to follow the naming used in C++ Core Guidelines.\n\n A Span wraps a pointer and a length that identify a non-owning view to a\n contiguous block of memory of objects of the same type. Various types,\n including (pre-decay) C arrays, XPCOM strings, nsTArray, mozilla::Array,\n mozilla::Range and contiguous standard-library containers, auto-convert\n into Spans when attempting to pass them as arguments to methods that take\n Spans. (Span itself autoconverts into mozilla::Range.)\n\n Like Rust's slices, Span provides safety against out-of-bounds access by\n performing run-time bound checks. However, unlike Rust's slices, Span\n cannot provide safety against use-after-free.\n\n (Note: Span is like Rust's slice only conceptually. Due to the lack of\n ABI guarantees, you should still decompose spans/slices to raw pointer\n and length parts when crossing the FFI. The Elements() and data() methods\n are guaranteed to return a non-null pointer even for zero-length spans,\n so the pointer can be used as a raw part of a Rust slice without further\n checks.)\n\n In addition to having constructors (with the support of deduction guides)\n that take various well-known types, a Span for an arbitrary type can be\n constructed from a pointer and a length or a pointer and another pointer\n pointing just past the last element.\n\n A Span<const char> or Span<const char16_t> can be obtained for const char*\n or const char16_t pointing to a zero-terminated string using the\n MakeStringSpan() function (which treats a nullptr argument equivalently\n to the empty string). Corresponding implicit constructor does not exist\n in order to avoid accidental construction in cases where const char* or\n const char16_t* do not point to a zero-terminated string.\n\n Span has methods that follow the Mozilla naming style and methods that\n don't. The methods that follow the Mozilla naming style are meant to be\n used directly from Mozilla code. The methods that don't are meant for\n integration with C++11 range-based loops and with meta-programming that\n expects the same methods that are found on the standard-library\n containers. For example, to decompose a Span into its parts in Mozilla\n code, use Elements() and Length() (as with nsTArray) instead of data()\n and size() (as with std::vector).\n\n The pointer and length wrapped by a Span cannot be changed after a Span has\n been created. When new values are required, simply create a new Span. Span\n has a method called Subspan() that works analogously to the Substring()\n method of XPCOM strings taking a start index and an optional length. As a\n Mozilla extension (relative to Microsoft's gsl::span that mozilla::Span is\n based on), Span has methods From(start), To(end) and FromTo(start, end)\n that correspond to Rust's &slice[start..], &slice[..end] and\n &slice[start..end], respectively. (That is, the end index is the index of\n the first element not to be included in the new subspan.)\n\n When indicating a Span that's only read from, const goes inside the type\n parameter. Don't put const in front of Span. That is:\n size_t ReadsFromOneSpanAndWritesToAnother(Span<const uint8_t> aReadFrom,\n                                           Span<uint8_t> aWrittenTo);\n\n Any Span<const T> can be viewed as Span<const uint8_t> using the function\n AsBytes(). Any Span<T> can be viewed as Span<uint8_t> using the function\n AsWritableBytes().\n\n Note that iterators from different Span instances are uncomparable, even if\n they refer to the same memory. This also applies to any spans derived via\n Subspan etc."]
        pub type ProfileBufferEntryWriter_SpanOfBytes = root::__BindgenOpaqueArray<u64, 2usize>;
        pub type ProfileBufferEntryWriter_value_type = root::mozilla::ProfileBufferEntryWriter_Byte;
        pub type ProfileBufferEntryWriter_pointer =
            *mut root::mozilla::ProfileBufferEntryWriter_Byte;
        pub type ProfileBufferEntryWriter_reference =
            *mut root::mozilla::ProfileBufferEntryWriter_Byte;
        pub type ProfileBufferEntryWriter_iterator_category = root::std::output_iterator_tag;
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProfileBufferEntryWriter"]
                [::std::mem::size_of::<ProfileBufferEntryWriter>() - 48usize];
            ["Alignment of ProfileBufferEntryWriter"]
                [::std::mem::align_of::<ProfileBufferEntryWriter>() - 8usize];
            ["Offset of field: ProfileBufferEntryWriter::mCurrentSpan"]
                [::std::mem::offset_of!(ProfileBufferEntryWriter, mCurrentSpan) - 0usize];
            ["Offset of field: ProfileBufferEntryWriter::mNextSpanOrEmpty"]
                [::std::mem::offset_of!(ProfileBufferEntryWriter, mNextSpanOrEmpty) - 16usize];
            ["Offset of field: ProfileBufferEntryWriter::mCurrentBlockIndex"]
                [::std::mem::offset_of!(ProfileBufferEntryWriter, mCurrentBlockIndex) - 32usize];
            ["Offset of field: ProfileBufferEntryWriter::mNextBlockIndex"]
                [::std::mem::offset_of!(ProfileBufferEntryWriter, mNextBlockIndex) - 40usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct ProfileBufferEntryWriter_Serializer {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct ProfileBufferEntryReader_Deserializer {
            pub _address: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: ProfileBufferEntryWriter_Serializer_open0_ProfileBufferBlockIndex_close0"] [:: std :: mem :: size_of :: < root :: mozilla :: ProfileBufferEntryWriter_Serializer > () - 1usize] ;
            ["Align of template specialization: ProfileBufferEntryWriter_Serializer_open0_ProfileBufferBlockIndex_close0"] [:: std :: mem :: align_of :: < root :: mozilla :: ProfileBufferEntryWriter_Serializer > () - 1usize] ;
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: ProfileBufferEntryReader_Deserializer_open0_ProfileBufferBlockIndex_close0"] [:: std :: mem :: size_of :: < root :: mozilla :: ProfileBufferEntryReader_Deserializer > () - 1usize] ;
            ["Align of template specialization: ProfileBufferEntryReader_Deserializer_open0_ProfileBufferBlockIndex_close0"] [:: std :: mem :: align_of :: < root :: mozilla :: ProfileBufferEntryReader_Deserializer > () - 1usize] ;
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct ProfileBufferUnownedCString {
            pub mCString: *const ::std::os::raw::c_char,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProfileBufferUnownedCString"]
                [::std::mem::size_of::<ProfileBufferUnownedCString>() - 8usize];
            ["Alignment of ProfileBufferUnownedCString"]
                [::std::mem::align_of::<ProfileBufferUnownedCString>() - 8usize];
            ["Offset of field: ProfileBufferUnownedCString::mCString"]
                [::std::mem::offset_of!(ProfileBufferUnownedCString, mCString) - 0usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: ProfileBufferEntryWriter_Serializer_open0_ProfileBufferUnownedCString_close0"] [:: std :: mem :: size_of :: < root :: mozilla :: ProfileBufferEntryWriter_Serializer > () - 1usize] ;
            ["Align of template specialization: ProfileBufferEntryWriter_Serializer_open0_ProfileBufferUnownedCString_close0"] [:: std :: mem :: align_of :: < root :: mozilla :: ProfileBufferEntryWriter_Serializer > () - 1usize] ;
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct ProfileBufferRawPointer<T> {
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
            pub mRawPointer: *mut T,
        }
        pub mod baseprofiler {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, PartialEq)]
            pub struct ChunkedJSONWriteFunc {
                pub _base: root::mozilla::JSONWriteFunc,
                pub _base_1: root::mozilla::FailureLatch,
                pub mChunkPtr: *mut ::std::os::raw::c_char,
                pub mChunkEnd: *mut ::std::os::raw::c_char,
                pub mChunkList: root::__BindgenOpaqueArray<u64, 3usize>,
                pub mChunkLengths: root::__BindgenOpaqueArray<u64, 3usize>,
                pub mFailureLatch: u64,
            }
            pub const ChunkedJSONWriteFunc_kChunkSize: usize = 2097152;
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of ChunkedJSONWriteFunc"]
                    [::std::mem::size_of::<ChunkedJSONWriteFunc>() - 88usize];
                ["Alignment of ChunkedJSONWriteFunc"]
                    [::std::mem::align_of::<ChunkedJSONWriteFunc>() - 8usize];
                ["Offset of field: ChunkedJSONWriteFunc::mChunkPtr"]
                    [::std::mem::offset_of!(ChunkedJSONWriteFunc, mChunkPtr) - 16usize];
                ["Offset of field: ChunkedJSONWriteFunc::mChunkEnd"]
                    [::std::mem::offset_of!(ChunkedJSONWriteFunc, mChunkEnd) - 24usize];
                ["Offset of field: ChunkedJSONWriteFunc::mChunkList"]
                    [::std::mem::offset_of!(ChunkedJSONWriteFunc, mChunkList) - 32usize];
                ["Offset of field: ChunkedJSONWriteFunc::mChunkLengths"]
                    [::std::mem::offset_of!(ChunkedJSONWriteFunc, mChunkLengths) - 56usize];
                ["Offset of field: ChunkedJSONWriteFunc::mFailureLatch"]
                    [::std::mem::offset_of!(ChunkedJSONWriteFunc, mFailureLatch) - 80usize];
            };
            #[repr(C)]
            #[derive(Debug, PartialEq)]
            pub struct OStreamJSONWriteFunc {
                pub _base: root::mozilla::JSONWriteFunc,
                pub mStream: *mut root::std::ostream,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of OStreamJSONWriteFunc"]
                    [::std::mem::size_of::<OStreamJSONWriteFunc>() - 16usize];
                ["Alignment of OStreamJSONWriteFunc"]
                    [::std::mem::align_of::<OStreamJSONWriteFunc>() - 8usize];
                ["Offset of field: OStreamJSONWriteFunc::mStream"]
                    [::std::mem::offset_of!(OStreamJSONWriteFunc, mStream) - 8usize];
            };
            #[repr(C)]
            #[derive(Debug, PartialEq)]
            pub struct SpliceableJSONWriter {
                pub _base: root::mozilla::JSONWriter,
                pub _base_1: root::mozilla::FailureLatch,
                pub mFailureLatch: u64,
                pub mUniqueStrings: *mut root::mozilla::baseprofiler::UniqueJSONStrings,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of SpliceableJSONWriter"]
                    [::std::mem::size_of::<SpliceableJSONWriter>() - 112usize];
                ["Alignment of SpliceableJSONWriter"]
                    [::std::mem::align_of::<SpliceableJSONWriter>() - 8usize];
                ["Offset of field: SpliceableJSONWriter::mFailureLatch"]
                    [::std::mem::offset_of!(SpliceableJSONWriter, mFailureLatch) - 96usize];
                ["Offset of field: SpliceableJSONWriter::mUniqueStrings"]
                    [::std::mem::offset_of!(SpliceableJSONWriter, mUniqueStrings) - 104usize];
            };
            #[repr(C)]
            #[derive(Debug, PartialEq)]
            pub struct SpliceableChunkedJSONWriter {
                pub _base: root::mozilla::baseprofiler::SpliceableJSONWriter,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of SpliceableChunkedJSONWriter"]
                    [::std::mem::size_of::<SpliceableChunkedJSONWriter>() - 112usize];
                ["Alignment of SpliceableChunkedJSONWriter"]
                    [::std::mem::align_of::<SpliceableChunkedJSONWriter>() - 8usize];
            };
            #[repr(C)]
            #[derive(Debug, PartialEq)]
            pub struct JSONSchemaWriter {
                pub mWriter: *mut root::mozilla::JSONWriter,
                pub mIndex: u32,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of JSONSchemaWriter"][::std::mem::size_of::<JSONSchemaWriter>() - 16usize];
                ["Alignment of JSONSchemaWriter"]
                    [::std::mem::align_of::<JSONSchemaWriter>() - 8usize];
                ["Offset of field: JSONSchemaWriter::mWriter"]
                    [::std::mem::offset_of!(JSONSchemaWriter, mWriter) - 0usize];
                ["Offset of field: JSONSchemaWriter::mIndex"]
                    [::std::mem::offset_of!(JSONSchemaWriter, mIndex) - 8usize];
            };
            #[repr(C)]
            #[derive(Debug, PartialEq)]
            pub struct UniqueJSONStrings {
                pub _base: root::mozilla::FailureLatch,
                pub mStringTableWriter: root::mozilla::baseprofiler::SpliceableChunkedJSONWriter,
                pub mStringHashToIndexMap: root::__BindgenOpaqueArray<u64, 3usize>,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of UniqueJSONStrings"]
                    [::std::mem::size_of::<UniqueJSONStrings>() - 144usize];
                ["Alignment of UniqueJSONStrings"]
                    [::std::mem::align_of::<UniqueJSONStrings>() - 8usize];
                ["Offset of field: UniqueJSONStrings::mStringTableWriter"]
                    [::std::mem::offset_of!(UniqueJSONStrings, mStringTableWriter) - 8usize];
                ["Offset of field: UniqueJSONStrings::mStringHashToIndexMap"]
                    [::std::mem::offset_of!(UniqueJSONStrings, mStringHashToIndexMap) - 120usize];
            };
            impl root::mozilla::baseprofiler::ProfilingCategoryPair {
                pub const LAST: root::mozilla::baseprofiler::ProfilingCategoryPair =
                    ProfilingCategoryPair::TELEMETRY;
            }
            #[repr(u32)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum ProfilingCategoryPair {
                IDLE = 0,
                OTHER = 1,
                OTHER_PreferenceRead = 2,
                OTHER_Profiling = 3,
                TEST = 4,
                LAYOUT = 5,
                LAYOUT_FrameConstruction = 6,
                LAYOUT_Reflow = 7,
                LAYOUT_CSSParsing = 8,
                LAYOUT_SelectorQuery = 9,
                LAYOUT_StyleComputation = 10,
                LAYOUT_Destroy = 11,
                LAYOUT_Printing = 12,
                JS = 13,
                JS_Parsing = 14,
                JS_BaselineCompilation = 15,
                JS_IonCompilation = 16,
                JS_Interpreter = 17,
                JS_BaselineInterpret = 18,
                JS_Baseline = 19,
                JS_IonMonkey = 20,
                JS_Builtin = 21,
                JS_WasmIon = 22,
                JS_WasmBaseline = 23,
                JS_WasmOther = 24,
                GCCC = 25,
                GCCC_MinorGC = 26,
                GCCC_MajorGC = 27,
                GCCC_MajorGC_Mark = 28,
                GCCC_MajorGC_Sweep = 29,
                GCCC_MajorGC_Compact = 30,
                GCCC_UnmarkGray = 31,
                GCCC_Barrier = 32,
                GCCC_FreeSnowWhite = 33,
                GCCC_BuildGraph = 34,
                GCCC_ScanRoots = 35,
                GCCC_CollectWhite = 36,
                GCCC_Finalize = 37,
                NETWORK = 38,
                GRAPHICS = 39,
                GRAPHICS_DisplayListBuilding = 40,
                GRAPHICS_DisplayListMerging = 41,
                GRAPHICS_LayerBuilding = 42,
                GRAPHICS_TileAllocation = 43,
                GRAPHICS_WRDisplayList = 44,
                GRAPHICS_Rasterization = 45,
                GRAPHICS_FlushingAsyncPaints = 46,
                GRAPHICS_ImageDecoding = 47,
                DOM = 48,
                JAVA_ANDROID = 49,
                JAVA_ANDROIDX = 50,
                JAVA_LANGUAGE = 51,
                JAVA_MOZILLA = 52,
                JAVA_KOTLIN = 53,
                JAVA_BLOCKED = 54,
                MAILNEWS = 55,
                IPC = 56,
                MEDIA = 57,
                MEDIA_CUBEB = 58,
                MEDIA_PLAYBACK = 59,
                MEDIA_RT = 60,
                A11Y = 61,
                PROFILER = 62,
                TIMER = 63,
                REMOTE_PROTOCOL = 64,
                SANDBOX = 65,
                TELEMETRY = 66,
                COUNT = 67,
            }
            impl root::mozilla::baseprofiler::ProfilingCategory {
                pub const LAST: root::mozilla::baseprofiler::ProfilingCategory =
                    ProfilingCategory::TELEMETRY;
            }
            #[repr(u32)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum ProfilingCategory {
                IDLE = 0,
                OTHER = 1,
                TEST = 2,
                LAYOUT = 3,
                JS = 4,
                GCCC = 5,
                NETWORK = 6,
                GRAPHICS = 7,
                DOM = 8,
                JAVA_ANDROID = 9,
                JAVA_ANDROIDX = 10,
                JAVA_LANGUAGE = 11,
                JAVA_MOZILLA = 12,
                JAVA_KOTLIN = 13,
                JAVA_BLOCKED = 14,
                MAILNEWS = 15,
                IPC = 16,
                MEDIA = 17,
                A11Y = 18,
                PROFILER = 19,
                TIMER = 20,
                REMOTE_PROTOCOL = 21,
                SANDBOX = 22,
                TELEMETRY = 23,
                COUNT = 24,
            }
            #[repr(C)]
            #[derive(Debug, PartialEq)]
            pub struct ProfilingCategoryInfo {
                pub mName: *const ::std::os::raw::c_char,
                pub mColor: *const ::std::os::raw::c_char,
                pub mSubcategoryNames: root::__BindgenOpaqueArray<u64, 2usize>,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of ProfilingCategoryInfo"]
                    [::std::mem::size_of::<ProfilingCategoryInfo>() - 32usize];
                ["Alignment of ProfilingCategoryInfo"]
                    [::std::mem::align_of::<ProfilingCategoryInfo>() - 8usize];
                ["Offset of field: ProfilingCategoryInfo::mName"]
                    [::std::mem::offset_of!(ProfilingCategoryInfo, mName) - 0usize];
                ["Offset of field: ProfilingCategoryInfo::mColor"]
                    [::std::mem::offset_of!(ProfilingCategoryInfo, mColor) - 8usize];
                ["Offset of field: ProfilingCategoryInfo::mSubcategoryNames"]
                    [::std::mem::offset_of!(ProfilingCategoryInfo, mSubcategoryNames) - 16usize];
            };
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct ProfilingCategoryPairInfo {
                pub mCategory: root::mozilla::baseprofiler::ProfilingCategory,
                pub mSubcategoryIndex: u32,
                pub mLabel: *const ::std::os::raw::c_char,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of ProfilingCategoryPairInfo"]
                    [::std::mem::size_of::<ProfilingCategoryPairInfo>() - 16usize];
                ["Alignment of ProfilingCategoryPairInfo"]
                    [::std::mem::align_of::<ProfilingCategoryPairInfo>() - 8usize];
                ["Offset of field: ProfilingCategoryPairInfo::mCategory"]
                    [::std::mem::offset_of!(ProfilingCategoryPairInfo, mCategory) - 0usize];
                ["Offset of field: ProfilingCategoryPairInfo::mSubcategoryIndex"]
                    [::std::mem::offset_of!(ProfilingCategoryPairInfo, mSubcategoryIndex) - 4usize];
                ["Offset of field: ProfilingCategoryPairInfo::mLabel"]
                    [::std::mem::offset_of!(ProfilingCategoryPairInfo, mLabel) - 8usize];
            };
            pub mod detail {
                #[allow(unused_imports)]
                use self::super::super::super::super::root;
                pub type ProcessIdType = ::std::os::raw::c_int;
                pub type ThreadIdType = ::std::os::raw::c_long;
                #[repr(C)]
                #[derive(Debug, PartialEq)]
                pub struct BaseProfilerMutex {
                    pub _base: root::mozilla::detail::MutexImpl,
                    pub mOwningThreadId: u64,
                    pub mName: *const ::std::os::raw::c_char,
                }
                #[allow(clippy::unnecessary_operation, clippy::identity_op)]
                const _: () = {
                    ["Size of BaseProfilerMutex"]
                        [::std::mem::size_of::<BaseProfilerMutex>() - 56usize];
                    ["Alignment of BaseProfilerMutex"]
                        [::std::mem::align_of::<BaseProfilerMutex>() - 8usize];
                    ["Offset of field: BaseProfilerMutex::mOwningThreadId"]
                        [::std::mem::offset_of!(BaseProfilerMutex, mOwningThreadId) - 40usize];
                    ["Offset of field: BaseProfilerMutex::mName"]
                        [::std::mem::offset_of!(BaseProfilerMutex, mName) - 48usize];
                };
                #[repr(C)]
                #[derive(Debug, PartialEq)]
                pub struct BaseProfilerAutoLock {
                    pub mMutex: *mut root::mozilla::baseprofiler::detail::BaseProfilerMutex,
                }
                #[allow(clippy::unnecessary_operation, clippy::identity_op)]
                const _: () = {
                    ["Size of BaseProfilerAutoLock"]
                        [::std::mem::size_of::<BaseProfilerAutoLock>() - 8usize];
                    ["Alignment of BaseProfilerAutoLock"]
                        [::std::mem::align_of::<BaseProfilerAutoLock>() - 8usize];
                    ["Offset of field: BaseProfilerAutoLock::mMutex"]
                        [::std::mem::offset_of!(BaseProfilerAutoLock, mMutex) - 0usize];
                };
                #[repr(C)]
                #[derive(Debug, PartialEq)]
                pub struct BaseProfilerMaybeMutex {
                    pub _base: root::mozilla::detail::MutexImpl,
                    pub mMaybeMutex: root::__BindgenOpaqueArray<u64, 8usize>,
                }
                #[allow(clippy::unnecessary_operation, clippy::identity_op)]
                const _: () = {
                    ["Size of BaseProfilerMaybeMutex"]
                        [::std::mem::size_of::<BaseProfilerMaybeMutex>() - 104usize];
                    ["Alignment of BaseProfilerMaybeMutex"]
                        [::std::mem::align_of::<BaseProfilerMaybeMutex>() - 8usize];
                    ["Offset of field: BaseProfilerMaybeMutex::mMaybeMutex"]
                        [::std::mem::offset_of!(BaseProfilerMaybeMutex, mMaybeMutex) - 40usize];
                };
                #[repr(C)]
                #[derive(Debug, PartialEq)]
                pub struct BaseProfilerMaybeAutoLock {
                    pub mMaybeMutex:
                        *mut root::mozilla::baseprofiler::detail::BaseProfilerMaybeMutex,
                }
                #[allow(clippy::unnecessary_operation, clippy::identity_op)]
                const _: () = {
                    ["Size of BaseProfilerMaybeAutoLock"]
                        [::std::mem::size_of::<BaseProfilerMaybeAutoLock>() - 8usize];
                    ["Alignment of BaseProfilerMaybeAutoLock"]
                        [::std::mem::align_of::<BaseProfilerMaybeAutoLock>() - 8usize];
                    ["Offset of field: BaseProfilerMaybeAutoLock::mMaybeMutex"]
                        [::std::mem::offset_of!(BaseProfilerMaybeAutoLock, mMaybeMutex) - 0usize];
                };
                #[repr(C)]
                pub struct BaseProfilerSharedMutex {
                    pub _base: root::mozilla::detail::RWLockImpl,
                    pub mOwningThreadId: u64,
                }
                #[allow(clippy::unnecessary_operation, clippy::identity_op)]
                const _: () = {
                    ["Size of BaseProfilerSharedMutex"]
                        [::std::mem::size_of::<BaseProfilerSharedMutex>() - 64usize];
                    ["Alignment of BaseProfilerSharedMutex"]
                        [::std::mem::align_of::<BaseProfilerSharedMutex>() - 8usize];
                    ["Offset of field: BaseProfilerSharedMutex::mOwningThreadId"][::std::mem::offset_of!(
                        BaseProfilerSharedMutex,
                        mOwningThreadId
                    ) - 56usize];
                };
                #[repr(C)]
                #[derive(Debug, PartialEq)]
                pub struct BaseProfilerAutoLockExclusive {
                    pub mSharedMutex:
                        *mut root::mozilla::baseprofiler::detail::BaseProfilerSharedMutex,
                }
                #[allow(clippy::unnecessary_operation, clippy::identity_op)]
                const _: () = {
                    ["Size of BaseProfilerAutoLockExclusive"]
                        [::std::mem::size_of::<BaseProfilerAutoLockExclusive>() - 8usize];
                    ["Alignment of BaseProfilerAutoLockExclusive"]
                        [::std::mem::align_of::<BaseProfilerAutoLockExclusive>() - 8usize];
                    ["Offset of field: BaseProfilerAutoLockExclusive::mSharedMutex"][::std::mem::offset_of!(
                        BaseProfilerAutoLockExclusive,
                        mSharedMutex
                    ) - 0usize];
                };
                #[repr(C)]
                #[derive(Debug, PartialEq)]
                pub struct BaseProfilerAutoLockShared {
                    pub mSharedMutex:
                        *mut root::mozilla::baseprofiler::detail::BaseProfilerSharedMutex,
                }
                #[allow(clippy::unnecessary_operation, clippy::identity_op)]
                const _: () = {
                    ["Size of BaseProfilerAutoLockShared"]
                        [::std::mem::size_of::<BaseProfilerAutoLockShared>() - 8usize];
                    ["Alignment of BaseProfilerAutoLockShared"]
                        [::std::mem::align_of::<BaseProfilerAutoLockShared>() - 8usize];
                    ["Offset of field: BaseProfilerAutoLockShared::mSharedMutex"]
                        [::std::mem::offset_of!(BaseProfilerAutoLockShared, mSharedMutex) - 0usize];
                };
            }
            #[repr(C)]
            #[repr(align(4))]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct BaseProfilerProcessId {
                pub _bindgen_opaque_blob: u32,
            }
            pub type BaseProfilerProcessId_NativeType =
                root::mozilla::baseprofiler::detail::ProcessIdType;
            pub type BaseProfilerProcessId_NumberType = root::std::conditional_t;
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of BaseProfilerProcessId"]
                    [::std::mem::size_of::<BaseProfilerProcessId>() - 4usize];
                ["Alignment of BaseProfilerProcessId"]
                    [::std::mem::align_of::<BaseProfilerProcessId>() - 4usize];
            };
            extern "C" {
                #[link_name = "\u{1}_ZN7mozilla12baseprofiler21BaseProfilerProcessId13scUnspecifiedE"]
                pub static BaseProfilerProcessId_scUnspecified:
                    root::mozilla::baseprofiler::BaseProfilerProcessId_NumberType;
            }
            #[repr(C)]
            #[repr(align(8))]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct BaseProfilerThreadId {
                pub _bindgen_opaque_blob: u64,
            }
            pub type BaseProfilerThreadId_NativeType =
                root::mozilla::baseprofiler::detail::ThreadIdType;
            pub type BaseProfilerThreadId_NumberType = root::std::conditional_t;
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of BaseProfilerThreadId"]
                    [::std::mem::size_of::<BaseProfilerThreadId>() - 8usize];
                ["Alignment of BaseProfilerThreadId"]
                    [::std::mem::align_of::<BaseProfilerThreadId>() - 8usize];
            };
            extern "C" {
                #[link_name = "\u{1}_ZN7mozilla12baseprofiler20BaseProfilerThreadId13scUnspecifiedE"]
                pub static BaseProfilerThreadId_scUnspecified:
                    root::mozilla::baseprofiler::BaseProfilerThreadId_NumberType;
            }
            pub mod category {
                #[allow(unused_imports)]
                use self::super::super::super::super::root;
                pub type MarkerCategory = root::mozilla::MarkerCategory;
            }
            pub mod markers {
                #[allow(unused_imports)]
                use self::super::super::super::super::root;
                #[repr(C)]
                #[derive(Debug, Copy, Clone, PartialEq)]
                pub struct NoPayload {
                    pub _address: u8,
                }
                #[allow(clippy::unnecessary_operation, clippy::identity_op)]
                const _: () = {
                    ["Size of NoPayload"][::std::mem::size_of::<NoPayload>() - 1usize];
                    ["Alignment of NoPayload"][::std::mem::align_of::<NoPayload>() - 1usize];
                };
            }
        }
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct ProfileBufferChunk {
            pub mInternalHeader: root::mozilla::ProfileBufferChunk_InternalHeader,
            pub mBuffer: root::mozilla::ProfileBufferChunk_Byte,
        }
        pub type ProfileBufferChunk_Byte = u8;
        pub type ProfileBufferChunk_Length = u32;
        #[doc = " Span - slices for C++\n\n Span implements Rust's slice concept for C++. It's called \"Span\" instead of\n \"Slice\" to follow the naming used in C++ Core Guidelines.\n\n A Span wraps a pointer and a length that identify a non-owning view to a\n contiguous block of memory of objects of the same type. Various types,\n including (pre-decay) C arrays, XPCOM strings, nsTArray, mozilla::Array,\n mozilla::Range and contiguous standard-library containers, auto-convert\n into Spans when attempting to pass them as arguments to methods that take\n Spans. (Span itself autoconverts into mozilla::Range.)\n\n Like Rust's slices, Span provides safety against out-of-bounds access by\n performing run-time bound checks. However, unlike Rust's slices, Span\n cannot provide safety against use-after-free.\n\n (Note: Span is like Rust's slice only conceptually. Due to the lack of\n ABI guarantees, you should still decompose spans/slices to raw pointer\n and length parts when crossing the FFI. The Elements() and data() methods\n are guaranteed to return a non-null pointer even for zero-length spans,\n so the pointer can be used as a raw part of a Rust slice without further\n checks.)\n\n In addition to having constructors (with the support of deduction guides)\n that take various well-known types, a Span for an arbitrary type can be\n constructed from a pointer and a length or a pointer and another pointer\n pointing just past the last element.\n\n A Span<const char> or Span<const char16_t> can be obtained for const char*\n or const char16_t pointing to a zero-terminated string using the\n MakeStringSpan() function (which treats a nullptr argument equivalently\n to the empty string). Corresponding implicit constructor does not exist\n in order to avoid accidental construction in cases where const char* or\n const char16_t* do not point to a zero-terminated string.\n\n Span has methods that follow the Mozilla naming style and methods that\n don't. The methods that follow the Mozilla naming style are meant to be\n used directly from Mozilla code. The methods that don't are meant for\n integration with C++11 range-based loops and with meta-programming that\n expects the same methods that are found on the standard-library\n containers. For example, to decompose a Span into its parts in Mozilla\n code, use Elements() and Length() (as with nsTArray) instead of data()\n and size() (as with std::vector).\n\n The pointer and length wrapped by a Span cannot be changed after a Span has\n been created. When new values are required, simply create a new Span. Span\n has a method called Subspan() that works analogously to the Substring()\n method of XPCOM strings taking a start index and an optional length. As a\n Mozilla extension (relative to Microsoft's gsl::span that mozilla::Span is\n based on), Span has methods From(start), To(end) and FromTo(start, end)\n that correspond to Rust's &slice[start..], &slice[..end] and\n &slice[start..end], respectively. (That is, the end index is the index of\n the first element not to be included in the new subspan.)\n\n When indicating a Span that's only read from, const goes inside the type\n parameter. Don't put const in front of Span. That is:\n size_t ReadsFromOneSpanAndWritesToAnother(Span<const uint8_t> aReadFrom,\n                                           Span<uint8_t> aWrittenTo);\n\n Any Span<const T> can be viewed as Span<const uint8_t> using the function\n AsBytes(). Any Span<T> can be viewed as Span<uint8_t> using the function\n AsWritableBytes().\n\n Note that iterators from different Span instances are uncomparable, even if\n they refer to the same memory. This also applies to any spans derived via\n Subspan etc."]
        pub type ProfileBufferChunk_SpanOfBytes = root::__BindgenOpaqueArray<u64, 2usize>;
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct ProfileBufferChunk_ReserveReturn {
            pub mSpan: root::mozilla::ProfileBufferChunk_SpanOfBytes,
            pub mBlockRangeIndex: root::mozilla::ProfileBufferBlockIndex,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProfileBufferChunk_ReserveReturn"]
                [::std::mem::size_of::<ProfileBufferChunk_ReserveReturn>() - 24usize];
            ["Alignment of ProfileBufferChunk_ReserveReturn"]
                [::std::mem::align_of::<ProfileBufferChunk_ReserveReturn>() - 8usize];
            ["Offset of field: ProfileBufferChunk_ReserveReturn::mSpan"]
                [::std::mem::offset_of!(ProfileBufferChunk_ReserveReturn, mSpan) - 0usize];
            ["Offset of field: ProfileBufferChunk_ReserveReturn::mBlockRangeIndex"][::std::mem::offset_of!(
                ProfileBufferChunk_ReserveReturn,
                mBlockRangeIndex
            ) - 16usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct ProfileBufferChunk_Header {
            pub mOffsetFirstBlock: root::mozilla::ProfileBufferChunk_Length,
            pub mOffsetPastLastBlock: root::mozilla::ProfileBufferChunk_Length,
            pub mStartTimeStamp: root::mozilla::TimeStamp,
            pub mDoneTimeStamp: root::mozilla::TimeStamp,
            pub mBufferBytes: root::mozilla::ProfileBufferChunk_Length,
            pub mBlockCount: root::mozilla::ProfileBufferChunk_Length,
            pub mRangeStart: root::mozilla::ProfileBufferIndex,
            pub mProcessId: ::std::os::raw::c_int,
            pub mPADDING: ::std::os::raw::c_int,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProfileBufferChunk_Header"]
                [::std::mem::size_of::<ProfileBufferChunk_Header>() - 48usize];
            ["Alignment of ProfileBufferChunk_Header"]
                [::std::mem::align_of::<ProfileBufferChunk_Header>() - 8usize];
            ["Offset of field: ProfileBufferChunk_Header::mOffsetFirstBlock"]
                [::std::mem::offset_of!(ProfileBufferChunk_Header, mOffsetFirstBlock) - 0usize];
            ["Offset of field: ProfileBufferChunk_Header::mOffsetPastLastBlock"]
                [::std::mem::offset_of!(ProfileBufferChunk_Header, mOffsetPastLastBlock) - 4usize];
            ["Offset of field: ProfileBufferChunk_Header::mStartTimeStamp"]
                [::std::mem::offset_of!(ProfileBufferChunk_Header, mStartTimeStamp) - 8usize];
            ["Offset of field: ProfileBufferChunk_Header::mDoneTimeStamp"]
                [::std::mem::offset_of!(ProfileBufferChunk_Header, mDoneTimeStamp) - 16usize];
            ["Offset of field: ProfileBufferChunk_Header::mBufferBytes"]
                [::std::mem::offset_of!(ProfileBufferChunk_Header, mBufferBytes) - 24usize];
            ["Offset of field: ProfileBufferChunk_Header::mBlockCount"]
                [::std::mem::offset_of!(ProfileBufferChunk_Header, mBlockCount) - 28usize];
            ["Offset of field: ProfileBufferChunk_Header::mRangeStart"]
                [::std::mem::offset_of!(ProfileBufferChunk_Header, mRangeStart) - 32usize];
            ["Offset of field: ProfileBufferChunk_Header::mProcessId"]
                [::std::mem::offset_of!(ProfileBufferChunk_Header, mProcessId) - 40usize];
            ["Offset of field: ProfileBufferChunk_Header::mPADDING"]
                [::std::mem::offset_of!(ProfileBufferChunk_Header, mPADDING) - 44usize];
        };
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct ProfileBufferChunk_InternalHeader {
            pub mHeader: root::mozilla::ProfileBufferChunk_Header,
            pub mNext: u64,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProfileBufferChunk_InternalHeader"]
                [::std::mem::size_of::<ProfileBufferChunk_InternalHeader>() - 56usize];
            ["Alignment of ProfileBufferChunk_InternalHeader"]
                [::std::mem::align_of::<ProfileBufferChunk_InternalHeader>() - 8usize];
            ["Offset of field: ProfileBufferChunk_InternalHeader::mHeader"]
                [::std::mem::offset_of!(ProfileBufferChunk_InternalHeader, mHeader) - 0usize];
            ["Offset of field: ProfileBufferChunk_InternalHeader::mNext"]
                [::std::mem::offset_of!(ProfileBufferChunk_InternalHeader, mNext) - 48usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProfileBufferChunk"][::std::mem::size_of::<ProfileBufferChunk>() - 64usize];
            ["Alignment of ProfileBufferChunk"]
                [::std::mem::align_of::<ProfileBufferChunk>() - 8usize];
            ["Offset of field: ProfileBufferChunk::mInternalHeader"]
                [::std::mem::offset_of!(ProfileBufferChunk, mInternalHeader) - 0usize];
            ["Offset of field: ProfileBufferChunk::mBuffer"]
                [::std::mem::offset_of!(ProfileBufferChunk, mBuffer) - 56usize];
        };
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct ScopeExit<ExitFunction> {
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<ExitFunction>>,
            pub mExitFunction: ExitFunction,
            pub mExecuteOnDestruction: bool,
        }
        #[repr(C)]
        pub struct ProfileBufferChunkManager__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct ProfileBufferChunkManager {
            pub vtable_: *const ProfileBufferChunkManager__bindgen_vtable,
        }
        pub const ProfileBufferChunkManager_scExpectedMaximumStackSize:
            root::mozilla::ProfileBufferChunk_Length = 131072;
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProfileBufferChunkManager"]
                [::std::mem::size_of::<ProfileBufferChunkManager>() - 8usize];
            ["Alignment of ProfileBufferChunkManager"]
                [::std::mem::align_of::<ProfileBufferChunkManager>() - 8usize];
        };
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct ProfileBufferChunkManagerSingle {
            pub _base: root::mozilla::ProfileBufferChunkManager,
            pub mInitialChunk: u64,
            pub mReleasedChunk: u64,
            pub mBufferBytes: root::mozilla::ProfileBufferChunkManagerSingle_Length,
            pub mChunkDestroyedCallback: root::__BindgenOpaqueArray<u64, 4usize>,
        }
        pub type ProfileBufferChunkManagerSingle_Length = root::mozilla::ProfileBufferChunk_Length;
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProfileBufferChunkManagerSingle"]
                [::std::mem::size_of::<ProfileBufferChunkManagerSingle>() - 64usize];
            ["Alignment of ProfileBufferChunkManagerSingle"]
                [::std::mem::align_of::<ProfileBufferChunkManagerSingle>() - 8usize];
            ["Offset of field: ProfileBufferChunkManagerSingle::mInitialChunk"]
                [::std::mem::offset_of!(ProfileBufferChunkManagerSingle, mInitialChunk) - 8usize];
            ["Offset of field: ProfileBufferChunkManagerSingle::mReleasedChunk"]
                [::std::mem::offset_of!(ProfileBufferChunkManagerSingle, mReleasedChunk) - 16usize];
            ["Offset of field: ProfileBufferChunkManagerSingle::mBufferBytes"]
                [::std::mem::offset_of!(ProfileBufferChunkManagerSingle, mBufferBytes) - 24usize];
            ["Offset of field: ProfileBufferChunkManagerSingle::mChunkDestroyedCallback"][::std::mem::offset_of!(
                ProfileBufferChunkManagerSingle,
                mChunkDestroyedCallback
            )
                - 32usize];
        };
        pub mod profiler {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            pub mod detail {
                #[allow(unused_imports)]
                use self::super::super::super::super::root;
                #[repr(C)]
                #[derive(Debug, Copy, Clone, PartialEq)]
                pub struct InChunkPointer {
                    pub mChunk: *const root::mozilla::ProfileBufferChunk,
                    pub mNextChunkGroup: *const root::mozilla::ProfileBufferChunk,
                    pub mOffsetInChunk: root::mozilla::profiler::detail::InChunkPointer_Length,
                }
                pub type InChunkPointer_Byte = root::mozilla::ProfileBufferChunk_Byte;
                pub type InChunkPointer_Length = root::mozilla::ProfileBufferChunk_Length;
                #[allow(clippy::unnecessary_operation, clippy::identity_op)]
                const _: () = {
                    ["Size of InChunkPointer"][::std::mem::size_of::<InChunkPointer>() - 24usize];
                    ["Alignment of InChunkPointer"]
                        [::std::mem::align_of::<InChunkPointer>() - 8usize];
                    ["Offset of field: InChunkPointer::mChunk"]
                        [::std::mem::offset_of!(InChunkPointer, mChunk) - 0usize];
                    ["Offset of field: InChunkPointer::mNextChunkGroup"]
                        [::std::mem::offset_of!(InChunkPointer, mNextChunkGroup) - 8usize];
                    ["Offset of field: InChunkPointer::mOffsetInChunk"]
                        [::std::mem::offset_of!(InChunkPointer, mOffsetInChunk) - 16usize];
                };
            }
        }
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct ProfileChunkedBuffer {
            pub mMutex: root::mozilla::baseprofiler::detail::BaseProfilerMaybeMutex,
            pub mChunkManager: *mut root::mozilla::ProfileBufferChunkManager,
            pub mOwnedChunkManager: u64,
            pub mCurrentChunk: u64,
            pub mNextChunks: u64,
            pub mRequestedChunkHolder:
                root::RefPtr<root::mozilla::ProfileChunkedBuffer_RequestedChunkRefCountedHolder>,
            pub mNextChunkRangeStart: root::mozilla::ProfileBufferIndex,
            pub mRangeStart: u64,
            pub mRangeEnd: root::mozilla::ProfileBufferIndex,
            pub mPushedBlockCount: u64,
            pub mClearedBlockCount: u64,
            pub mFailedPutBytes: u64,
        }
        pub type ProfileChunkedBuffer_Byte = root::mozilla::ProfileBufferChunk_Byte;
        pub type ProfileChunkedBuffer_Length = root::mozilla::ProfileBufferChunk_Length;
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum ProfileChunkedBuffer_ThreadSafety {
            WithoutMutex = 0,
            WithMutex = 1,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct ProfileChunkedBuffer_State {
            pub mRangeStart: root::mozilla::ProfileBufferIndex,
            pub mRangeEnd: root::mozilla::ProfileBufferIndex,
            pub mPushedBlockCount: u64,
            pub mClearedBlockCount: u64,
            pub mFailedPutBytes: u64,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProfileChunkedBuffer_State"]
                [::std::mem::size_of::<ProfileChunkedBuffer_State>() - 40usize];
            ["Alignment of ProfileChunkedBuffer_State"]
                [::std::mem::align_of::<ProfileChunkedBuffer_State>() - 8usize];
            ["Offset of field: ProfileChunkedBuffer_State::mRangeStart"]
                [::std::mem::offset_of!(ProfileChunkedBuffer_State, mRangeStart) - 0usize];
            ["Offset of field: ProfileChunkedBuffer_State::mRangeEnd"]
                [::std::mem::offset_of!(ProfileChunkedBuffer_State, mRangeEnd) - 8usize];
            ["Offset of field: ProfileChunkedBuffer_State::mPushedBlockCount"]
                [::std::mem::offset_of!(ProfileChunkedBuffer_State, mPushedBlockCount) - 16usize];
            ["Offset of field: ProfileChunkedBuffer_State::mClearedBlockCount"]
                [::std::mem::offset_of!(ProfileChunkedBuffer_State, mClearedBlockCount) - 24usize];
            ["Offset of field: ProfileChunkedBuffer_State::mFailedPutBytes"]
                [::std::mem::offset_of!(ProfileChunkedBuffer_State, mFailedPutBytes) - 32usize];
        };
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct ProfileChunkedBuffer_BlockIterator {
            pub mNextBlockPointer: root::mozilla::profiler::detail::InChunkPointer,
            pub mCurrentBlockIndex: root::mozilla::ProfileBufferBlockIndex,
            pub mCurrentEntry: root::mozilla::ProfileBufferEntryReader,
            pub mBuffer: u64,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProfileChunkedBuffer_BlockIterator"]
                [::std::mem::size_of::<ProfileChunkedBuffer_BlockIterator>() - 88usize];
            ["Alignment of ProfileChunkedBuffer_BlockIterator"]
                [::std::mem::align_of::<ProfileChunkedBuffer_BlockIterator>() - 8usize];
            ["Offset of field: ProfileChunkedBuffer_BlockIterator::mNextBlockPointer"][::std::mem::offset_of!(
                ProfileChunkedBuffer_BlockIterator,
                mNextBlockPointer
            ) - 0usize];
            ["Offset of field: ProfileChunkedBuffer_BlockIterator::mCurrentBlockIndex"][::std::mem::offset_of!(
                ProfileChunkedBuffer_BlockIterator,
                mCurrentBlockIndex
            )
                - 24usize];
            ["Offset of field: ProfileChunkedBuffer_BlockIterator::mCurrentEntry"][::std::mem::offset_of!(
                ProfileChunkedBuffer_BlockIterator,
                mCurrentEntry
            ) - 32usize];
            ["Offset of field: ProfileChunkedBuffer_BlockIterator::mBuffer"]
                [::std::mem::offset_of!(ProfileChunkedBuffer_BlockIterator, mBuffer) - 80usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct ProfileChunkedBuffer_Reader {
            pub mBuffer: *const root::mozilla::ProfileChunkedBuffer,
            pub mChunks0: *const root::mozilla::ProfileBufferChunk,
            pub mChunks1: *const root::mozilla::ProfileBufferChunk,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProfileChunkedBuffer_Reader"]
                [::std::mem::size_of::<ProfileChunkedBuffer_Reader>() - 24usize];
            ["Alignment of ProfileChunkedBuffer_Reader"]
                [::std::mem::align_of::<ProfileChunkedBuffer_Reader>() - 8usize];
            ["Offset of field: ProfileChunkedBuffer_Reader::mBuffer"]
                [::std::mem::offset_of!(ProfileChunkedBuffer_Reader, mBuffer) - 0usize];
            ["Offset of field: ProfileChunkedBuffer_Reader::mChunks0"]
                [::std::mem::offset_of!(ProfileChunkedBuffer_Reader, mChunks0) - 8usize];
            ["Offset of field: ProfileChunkedBuffer_Reader::mChunks1"]
                [::std::mem::offset_of!(ProfileChunkedBuffer_Reader, mChunks1) - 16usize];
        };
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct ProfileChunkedBuffer_RequestedChunkRefCountedHolder {
            pub mRequestMutex: root::mozilla::baseprofiler::detail::BaseProfilerMutex,
            pub mRefCount: ::std::os::raw::c_int,
            pub mState: root::mozilla::ProfileChunkedBuffer_RequestedChunkRefCountedHolder_State,
            pub mRequestedChunk: u64,
        }
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum ProfileChunkedBuffer_RequestedChunkRefCountedHolder_State {
            Unused = 0,
            Requested = 1,
            Fulfilled = 2,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProfileChunkedBuffer_RequestedChunkRefCountedHolder"][::std::mem::size_of::<
                ProfileChunkedBuffer_RequestedChunkRefCountedHolder,
            >() - 72usize];
            ["Alignment of ProfileChunkedBuffer_RequestedChunkRefCountedHolder"]
                [::std::mem::align_of::<ProfileChunkedBuffer_RequestedChunkRefCountedHolder>()
                    - 8usize];
            ["Offset of field: ProfileChunkedBuffer_RequestedChunkRefCountedHolder::mRequestMutex"] [:: std :: mem :: offset_of ! (ProfileChunkedBuffer_RequestedChunkRefCountedHolder , mRequestMutex) - 0usize] ;
            ["Offset of field: ProfileChunkedBuffer_RequestedChunkRefCountedHolder::mRefCount"][::std::mem::offset_of!(
                ProfileChunkedBuffer_RequestedChunkRefCountedHolder,
                mRefCount
            )
                - 56usize];
            ["Offset of field: ProfileChunkedBuffer_RequestedChunkRefCountedHolder::mState"][::std::mem::offset_of!(
                ProfileChunkedBuffer_RequestedChunkRefCountedHolder,
                mState
            )
                - 60usize];
            ["Offset of field: ProfileChunkedBuffer_RequestedChunkRefCountedHolder::mRequestedChunk"] [:: std :: mem :: offset_of ! (ProfileChunkedBuffer_RequestedChunkRefCountedHolder , mRequestedChunk) - 64usize] ;
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ProfileChunkedBuffer"]
                [::std::mem::size_of::<ProfileChunkedBuffer>() - 192usize];
            ["Alignment of ProfileChunkedBuffer"]
                [::std::mem::align_of::<ProfileChunkedBuffer>() - 8usize];
            ["Offset of field: ProfileChunkedBuffer::mMutex"]
                [::std::mem::offset_of!(ProfileChunkedBuffer, mMutex) - 0usize];
            ["Offset of field: ProfileChunkedBuffer::mChunkManager"]
                [::std::mem::offset_of!(ProfileChunkedBuffer, mChunkManager) - 104usize];
            ["Offset of field: ProfileChunkedBuffer::mOwnedChunkManager"]
                [::std::mem::offset_of!(ProfileChunkedBuffer, mOwnedChunkManager) - 112usize];
            ["Offset of field: ProfileChunkedBuffer::mCurrentChunk"]
                [::std::mem::offset_of!(ProfileChunkedBuffer, mCurrentChunk) - 120usize];
            ["Offset of field: ProfileChunkedBuffer::mNextChunks"]
                [::std::mem::offset_of!(ProfileChunkedBuffer, mNextChunks) - 128usize];
            ["Offset of field: ProfileChunkedBuffer::mRequestedChunkHolder"]
                [::std::mem::offset_of!(ProfileChunkedBuffer, mRequestedChunkHolder) - 136usize];
            ["Offset of field: ProfileChunkedBuffer::mNextChunkRangeStart"]
                [::std::mem::offset_of!(ProfileChunkedBuffer, mNextChunkRangeStart) - 144usize];
            ["Offset of field: ProfileChunkedBuffer::mRangeStart"]
                [::std::mem::offset_of!(ProfileChunkedBuffer, mRangeStart) - 152usize];
            ["Offset of field: ProfileChunkedBuffer::mRangeEnd"]
                [::std::mem::offset_of!(ProfileChunkedBuffer, mRangeEnd) - 160usize];
            ["Offset of field: ProfileChunkedBuffer::mPushedBlockCount"]
                [::std::mem::offset_of!(ProfileChunkedBuffer, mPushedBlockCount) - 168usize];
            ["Offset of field: ProfileChunkedBuffer::mClearedBlockCount"]
                [::std::mem::offset_of!(ProfileChunkedBuffer, mClearedBlockCount) - 176usize];
            ["Offset of field: ProfileChunkedBuffer::mFailedPutBytes"]
                [::std::mem::offset_of!(ProfileChunkedBuffer, mFailedPutBytes) - 184usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: ProfileBufferEntryWriter_Serializer_open0_ProfileChunkedBuffer_close0"] [:: std :: mem :: size_of :: < root :: mozilla :: ProfileBufferEntryWriter_Serializer > () - 1usize] ;
            ["Align of template specialization: ProfileBufferEntryWriter_Serializer_open0_ProfileChunkedBuffer_close0"] [:: std :: mem :: align_of :: < root :: mozilla :: ProfileBufferEntryWriter_Serializer > () - 1usize] ;
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: ProfileBufferEntryReader_Deserializer_open0_ProfileChunkedBuffer_close0"] [:: std :: mem :: size_of :: < root :: mozilla :: ProfileBufferEntryReader_Deserializer > () - 1usize] ;
            ["Align of template specialization: ProfileBufferEntryReader_Deserializer_open0_ProfileChunkedBuffer_close0"] [:: std :: mem :: align_of :: < root :: mozilla :: ProfileBufferEntryReader_Deserializer > () - 1usize] ;
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: ProfileBufferEntryWriter_Serializer_open0_UniquePtr_open1_ProfileChunkedBuffer_DefaultDelete_open2_ProfileChunkedBuffer_close2_close1_close0"] [:: std :: mem :: size_of :: < root :: mozilla :: ProfileBufferEntryWriter_Serializer > () - 1usize] ;
            ["Align of template specialization: ProfileBufferEntryWriter_Serializer_open0_UniquePtr_open1_ProfileChunkedBuffer_DefaultDelete_open2_ProfileChunkedBuffer_close2_close1_close0"] [:: std :: mem :: align_of :: < root :: mozilla :: ProfileBufferEntryWriter_Serializer > () - 1usize] ;
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: ProfileBufferEntryWriter_Serializer_open0_ptr_ProfileChunkedBuffer_close0"] [:: std :: mem :: size_of :: < root :: mozilla :: ProfileBufferEntryWriter_Serializer > () - 1usize] ;
            ["Align of template specialization: ProfileBufferEntryWriter_Serializer_open0_ptr_ProfileChunkedBuffer_close0"] [:: std :: mem :: align_of :: < root :: mozilla :: ProfileBufferEntryWriter_Serializer > () - 1usize] ;
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: ProfileBufferEntryReader_Deserializer_open0_UniquePtr_open1_ProfileChunkedBuffer_DefaultDelete_open2_ProfileChunkedBuffer_close2_close1_close0"] [:: std :: mem :: size_of :: < root :: mozilla :: ProfileBufferEntryReader_Deserializer > () - 1usize] ;
            ["Align of template specialization: ProfileBufferEntryReader_Deserializer_open0_UniquePtr_open1_ProfileChunkedBuffer_DefaultDelete_open2_ProfileChunkedBuffer_close2_close1_close0"] [:: std :: mem :: align_of :: < root :: mozilla :: ProfileBufferEntryReader_Deserializer > () - 1usize] ;
        };
        impl root::mozilla::ProfilerStringView_Ownership {
            pub const Reference: root::mozilla::ProfilerStringView_Ownership =
                ProfilerStringView_Ownership::Literal;
        }
        impl root::mozilla::ProfilerStringView_Ownership {
            pub const OwnedThroughStringView: root::mozilla::ProfilerStringView_Ownership =
                ProfilerStringView_Ownership::Literal;
        }
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum ProfilerStringView_Ownership {
            Literal = 0,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct MarkerCategory {
            pub mCategoryPair: root::mozilla::baseprofiler::ProfilingCategoryPair,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of MarkerCategory"][::std::mem::size_of::<MarkerCategory>() - 4usize];
            ["Alignment of MarkerCategory"][::std::mem::align_of::<MarkerCategory>() - 4usize];
            ["Offset of field: MarkerCategory::mCategoryPair"]
                [::std::mem::offset_of!(MarkerCategory, mCategoryPair) - 0usize];
        };
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct MarkerThreadId {
            pub _bindgen_opaque_blob: u64,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of MarkerThreadId"][::std::mem::size_of::<MarkerThreadId>() - 8usize];
            ["Alignment of MarkerThreadId"][::std::mem::align_of::<MarkerThreadId>() - 8usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct MarkerTiming {
            pub mStartTime: root::mozilla::TimeStamp,
            pub mEndTime: root::mozilla::TimeStamp,
            pub mPhase: root::mozilla::MarkerTiming_Phase,
        }
        #[repr(u8)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum MarkerTiming_Phase {
            Instant = 0,
            Interval = 1,
            IntervalStart = 2,
            IntervalEnd = 3,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of MarkerTiming"][::std::mem::size_of::<MarkerTiming>() - 24usize];
            ["Alignment of MarkerTiming"][::std::mem::align_of::<MarkerTiming>() - 8usize];
            ["Offset of field: MarkerTiming::mStartTime"]
                [::std::mem::offset_of!(MarkerTiming, mStartTime) - 0usize];
            ["Offset of field: MarkerTiming::mEndTime"]
                [::std::mem::offset_of!(MarkerTiming, mEndTime) - 8usize];
            ["Offset of field: MarkerTiming::mPhase"]
                [::std::mem::offset_of!(MarkerTiming, mPhase) - 16usize];
        };
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct MarkerStack {
            pub mCaptureOptions: root::mozilla::StackCaptureOptions,
            pub mOptionalChunkedBufferStorage: u64,
            pub mChunkedBuffer: *mut root::mozilla::ProfileChunkedBuffer,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of MarkerStack"][::std::mem::size_of::<MarkerStack>() - 24usize];
            ["Alignment of MarkerStack"][::std::mem::align_of::<MarkerStack>() - 8usize];
            ["Offset of field: MarkerStack::mCaptureOptions"]
                [::std::mem::offset_of!(MarkerStack, mCaptureOptions) - 0usize];
            ["Offset of field: MarkerStack::mOptionalChunkedBufferStorage"]
                [::std::mem::offset_of!(MarkerStack, mOptionalChunkedBufferStorage) - 8usize];
            ["Offset of field: MarkerStack::mChunkedBuffer"]
                [::std::mem::offset_of!(MarkerStack, mChunkedBuffer) - 16usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct MarkerInnerWindowId {
            pub mInnerWindowId: u64,
        }
        pub const MarkerInnerWindowId_scNoId: u64 = 0;
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of MarkerInnerWindowId"][::std::mem::size_of::<MarkerInnerWindowId>() - 8usize];
            ["Alignment of MarkerInnerWindowId"]
                [::std::mem::align_of::<MarkerInnerWindowId>() - 8usize];
            ["Offset of field: MarkerInnerWindowId::mInnerWindowId"]
                [::std::mem::offset_of!(MarkerInnerWindowId, mInnerWindowId) - 0usize];
        };
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct MarkerOptions {
            pub mThreadId: root::mozilla::MarkerThreadId,
            pub mTiming: root::mozilla::MarkerTiming,
            pub mStack: root::mozilla::MarkerStack,
            pub mInnerWindowId: root::mozilla::MarkerInnerWindowId,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of MarkerOptions"][::std::mem::size_of::<MarkerOptions>() - 64usize];
            ["Alignment of MarkerOptions"][::std::mem::align_of::<MarkerOptions>() - 8usize];
            ["Offset of field: MarkerOptions::mThreadId"]
                [::std::mem::offset_of!(MarkerOptions, mThreadId) - 0usize];
            ["Offset of field: MarkerOptions::mTiming"]
                [::std::mem::offset_of!(MarkerOptions, mTiming) - 8usize];
            ["Offset of field: MarkerOptions::mStack"]
                [::std::mem::offset_of!(MarkerOptions, mStack) - 32usize];
            ["Offset of field: MarkerOptions::mInnerWindowId"]
                [::std::mem::offset_of!(MarkerOptions, mInnerWindowId) - 56usize];
        };
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct MarkerSchema {
            pub mLocations: root::__BindgenOpaqueArray<u64, 3usize>,
            pub mChartLabel: root::std::string,
            pub mTooltipLabel: root::std::string,
            pub mTableLabel: root::std::string,
            pub mIsStackBased: bool,
            pub mData: root::mozilla::MarkerSchema_DataRowVector,
            pub mGraphs: root::__BindgenOpaqueArray<u64, 3usize>,
        }
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum MarkerSchema_InputType {
            Uint64 = 0,
            Uint32 = 1,
            Uint8 = 2,
            Boolean = 3,
            CString = 4,
            String = 5,
            TimeStamp = 6,
            TimeDuration = 7,
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum MarkerSchema_Location {
            MarkerChart = 0,
            MarkerTable = 1,
            TimelineOverview = 2,
            TimelineMemory = 3,
            TimelineIPC = 4,
            TimelineFileIO = 5,
            StackChart = 6,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct MarkerSchema_SpecialFrontendLocation {
            pub _address: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of MarkerSchema_SpecialFrontendLocation"]
                [::std::mem::size_of::<MarkerSchema_SpecialFrontendLocation>() - 1usize];
            ["Alignment of MarkerSchema_SpecialFrontendLocation"]
                [::std::mem::align_of::<MarkerSchema_SpecialFrontendLocation>() - 1usize];
        };
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum MarkerSchema_Format {
            Url = 0,
            FilePath = 1,
            SanitizedString = 2,
            String = 3,
            UniqueString = 4,
            Duration = 5,
            Time = 6,
            Seconds = 7,
            Milliseconds = 8,
            Microseconds = 9,
            Nanoseconds = 10,
            Bytes = 11,
            Percentage = 12,
            Integer = 13,
            Decimal = 14,
            Flow = 15,
            TerminatingFlow = 16,
        }
        #[repr(u64)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum MarkerSchema_ETWMarkerGroup {
            Generic = 1,
            UserMarkers = 2,
            Memory = 4,
            Scheduling = 8,
            Text = 16,
            Tracing = 32,
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum MarkerSchema_PayloadFlags {
            None = 0,
            Searchable = 1,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct MarkerSchema_PayloadField {
            pub Key: *const ::std::os::raw::c_char,
            pub InputTy: root::mozilla::MarkerSchema_InputType,
            pub Label: *const ::std::os::raw::c_char,
            pub Fmt: root::mozilla::MarkerSchema_Format,
            pub Flags: root::mozilla::MarkerSchema_PayloadFlags,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of MarkerSchema_PayloadField"]
                [::std::mem::size_of::<MarkerSchema_PayloadField>() - 32usize];
            ["Alignment of MarkerSchema_PayloadField"]
                [::std::mem::align_of::<MarkerSchema_PayloadField>() - 8usize];
            ["Offset of field: MarkerSchema_PayloadField::Key"]
                [::std::mem::offset_of!(MarkerSchema_PayloadField, Key) - 0usize];
            ["Offset of field: MarkerSchema_PayloadField::InputTy"]
                [::std::mem::offset_of!(MarkerSchema_PayloadField, InputTy) - 8usize];
            ["Offset of field: MarkerSchema_PayloadField::Label"]
                [::std::mem::offset_of!(MarkerSchema_PayloadField, Label) - 16usize];
            ["Offset of field: MarkerSchema_PayloadField::Fmt"]
                [::std::mem::offset_of!(MarkerSchema_PayloadField, Fmt) - 24usize];
            ["Offset of field: MarkerSchema_PayloadField::Flags"]
                [::std::mem::offset_of!(MarkerSchema_PayloadField, Flags) - 28usize];
        };
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum MarkerSchema_Searchable {
            NotSearchable = 0,
            Searchable = 1,
        }
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum MarkerSchema_GraphType {
            Line = 0,
            Bar = 1,
            FilledLine = 2,
        }
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum MarkerSchema_GraphColor {
            Blue = 0,
            Green = 1,
            Grey = 2,
            Ink = 3,
            Magenta = 4,
            Orange = 5,
            Purple = 6,
            Red = 7,
            Teal = 8,
            Yellow = 9,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct MarkerSchema_DynamicData {
            pub mKey: root::std::string,
            pub mLabel: root::__BindgenOpaqueArray<u64, 5usize>,
            pub mFormat: root::mozilla::MarkerSchema_Format,
            pub mSearchable: root::__BindgenOpaqueArray<u32, 2usize>,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of MarkerSchema_DynamicData"]
                [::std::mem::size_of::<MarkerSchema_DynamicData>() - 88usize];
            ["Alignment of MarkerSchema_DynamicData"]
                [::std::mem::align_of::<MarkerSchema_DynamicData>() - 8usize];
            ["Offset of field: MarkerSchema_DynamicData::mKey"]
                [::std::mem::offset_of!(MarkerSchema_DynamicData, mKey) - 0usize];
            ["Offset of field: MarkerSchema_DynamicData::mLabel"]
                [::std::mem::offset_of!(MarkerSchema_DynamicData, mLabel) - 32usize];
            ["Offset of field: MarkerSchema_DynamicData::mFormat"]
                [::std::mem::offset_of!(MarkerSchema_DynamicData, mFormat) - 72usize];
            ["Offset of field: MarkerSchema_DynamicData::mSearchable"]
                [::std::mem::offset_of!(MarkerSchema_DynamicData, mSearchable) - 76usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct MarkerSchema_StaticData {
            pub mLabel: root::std::string,
            pub mValue: root::std::string,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of MarkerSchema_StaticData"]
                [::std::mem::size_of::<MarkerSchema_StaticData>() - 64usize];
            ["Alignment of MarkerSchema_StaticData"]
                [::std::mem::align_of::<MarkerSchema_StaticData>() - 8usize];
            ["Offset of field: MarkerSchema_StaticData::mLabel"]
                [::std::mem::offset_of!(MarkerSchema_StaticData, mLabel) - 0usize];
            ["Offset of field: MarkerSchema_StaticData::mValue"]
                [::std::mem::offset_of!(MarkerSchema_StaticData, mValue) - 32usize];
        };
        #[doc = " # mozilla::Variant\n\n A variant / tagged union / heterogenous disjoint union / sum-type template\n class. Similar in concept to (but not derived from) `boost::variant`.\n\n Sometimes, you may wish to use a C union with non-POD types. However, this is\n forbidden in C++ because it is not clear which type in the union should have\n its constructor and destructor run on creation and deletion\n respectively. This is the problem that `mozilla::Variant` solves.\n\n ## Usage\n\n A `mozilla::Variant` instance is constructed (via move or copy) from one of\n its variant types (ignoring const and references). It does *not* support\n construction from subclasses of variant types or types that coerce to one of\n the variant types.\n\n     Variant<char, uint32_t> v1('a');\n     Variant<UniquePtr<A>, B, C> v2(MakeUnique<A>());\n     Variant<bool, char> v3(VariantType<char>, 0); // disambiguation needed\n     Variant<int, int> v4(VariantIndex<1>, 0); // 2nd int\n\n Because specifying the full type of a Variant value is often verbose,\n there are two easier ways to construct values:\n\n A. AsVariant() can be used to construct a Variant value using type inference\n in contexts such as expressions or when returning values from functions.\n Because AsVariant() must copy or move the value into a temporary and this\n cannot necessarily be elided by the compiler, it's mostly appropriate only\n for use with primitive or very small types.\n\n     Variant<char, uint32_t> Foo() { return AsVariant('x'); }\n     // ...\n     Variant<char, uint32_t> v1 = Foo();  // v1 holds char('x').\n\n B. Brace-construction with VariantType or VariantIndex; this also allows\n in-place construction with any number of arguments.\n\n     struct AB { AB(int, int){...} };\n     static Variant<AB, bool> foo()\n     {\n       return {VariantIndex<0>{}, 1, 2};\n     }\n     // ...\n     Variant<AB, bool> v0 = Foo();  // v0 holds AB(1,2).\n\n All access to the contained value goes through type-safe accessors.\n Either the stored type, or the type index may be provided.\n\n     void\n     Foo(Variant<A, B, C> v)\n     {\n       if (v.is<A>()) {\n         A& ref = v.as<A>();\n         ...\n       } else (v.is<1>()) { // Instead of v.is<B>.\n         ...\n       } else {\n         ...\n       }\n     }\n\n In some situation, a Variant may be constructed from templated types, in\n which case it is possible that the same type could be given multiple times by\n an external developer. Or seemingly-different types could be aliases.\n In this case, repeated types can only be accessed through their index, to\n prevent ambiguous access by type.\n\n    // Bad!\n    template <typename T>\n    struct ResultOrError\n    {\n      Variant<T, int> m;\n      ResultOrError() : m(int(0)) {} // Error '0' by default\n      ResultOrError(const T& r) : m(r) {}\n      bool IsResult() const { return m.is<T>(); }\n      bool IsError() const { return m.is<int>(); }\n    };\n    // Now instantiante with the result being an int too:\n    ResultOrError<int> myResult(123); // Fail!\n    // In Variant<int, int>, which 'int' are we refering to, from inside\n    // ResultOrError functions?\n\n    // Good!\n    template <typename T>\n    struct ResultOrError\n    {\n      Variant<T, int> m;\n      ResultOrError() : m(VariantIndex<1>{}, 0) {} // Error '0' by default\n      ResultOrError(const T& r) : m(VariantIndex<0>{}, r) {}\n      bool IsResult() const { return m.is<0>(); } // 0 -> T\n      bool IsError() const { return m.is<1>(); } // 1 -> int\n    };\n    // Now instantiante with the result being an int too:\n    ResultOrError<int> myResult(123); // It now works!\n\n Attempting to use the contained value as type `T1` when the `Variant`\n instance contains a value of type `T2` causes an assertion failure.\n\n     A a;\n     Variant<A, B, C> v(a);\n     v.as<B>(); // <--- Assertion failure!\n\n Trying to use a `Variant<Ts...>` instance as some type `U` that is not a\n member of the set of `Ts...` is a compiler error.\n\n     A a;\n     Variant<A, B, C> v(a);\n     v.as<SomeRandomType>(); // <--- Compiler error!\n\n Additionally, you can turn a `Variant` that `is<T>` into a `T` by moving it\n out of the containing `Variant` instance with the `extract<T>` method:\n\n     Variant<UniquePtr<A>, B, C> v(MakeUnique<A>());\n     auto ptr = v.extract<UniquePtr<A>>();\n\n Finally, you can exhaustively match on the contained variant and branch into\n different code paths depending on which type is contained. This is preferred\n to manually checking every variant type T with is<T>() because it provides\n compile-time checking that you handled every type, rather than runtime\n assertion failures.\n\n     // Bad!\n     char* foo(Variant<A, B, C, D>& v) {\n       if (v.is<A>()) {\n         return ...;\n       } else if (v.is<B>()) {\n         return ...;\n       } else {\n         return doSomething(v.as<C>()); // Forgot about case D!\n       }\n     }\n\n     // Instead, a single function object (that can deal with all possible\n     // options) may be provided:\n     struct FooMatcher\n     {\n       // The return type of all matchers must be identical.\n       char* operator()(A& a) { ... }\n       char* operator()(B& b) { ... }\n       char* operator()(C& c) { ... }\n       char* operator()(D& d) { ... } // Compile-time error to forget D!\n     }\n     char* foo(Variant<A, B, C, D>& v) {\n       return v.match(FooMatcher());\n     }\n\n     // In some situations, a single generic lambda may also be appropriate:\n     char* foo(Variant<A, B, C, D>& v) {\n       return v.match([](auto&) {...});\n     }\n\n     // Alternatively, multiple function objects may be provided, each one\n     // corresponding to an option, in the same order:\n     char* foo(Variant<A, B, C, D>& v) {\n       return v.match([](A&) { ... },\n                      [](B&) { ... },\n                      [](C&) { ... },\n                      [](D&) { ... });\n     }\n\n     // In rare cases, the index of the currently-active alternative is\n     // needed, it may be obtained by adding a first parameter in the matcner\n     // callback, which will receive the index in its most compact type (just\n     // use `size_t` if the exact type is not important), e.g.:\n     char* foo(Variant<A, B, C, D>& v) {\n       return v.match([](auto aIndex, auto& aAlternative) {...});\n       // --OR--\n       return v.match([](size_t aIndex, auto& aAlternative) {...});\n     }\n\n ## Examples\n\n A tree is either an empty leaf, or a node with a value and two children:\n\n     struct Leaf { };\n\n     template<typename T>\n     struct Node\n     {\n       T value;\n       Tree<T>* left;\n       Tree<T>* right;\n     };\n\n     template<typename T>\n     using Tree = Variant<Leaf, Node<T>>;\n\n A copy-on-write string is either a non-owning reference to some existing\n string, or an owning reference to our copy:\n\n     class CopyOnWriteString\n     {\n       Variant<const char*, UniquePtr<char[]>> string;\n\n       ...\n     };\n\n Because Variant must be aligned suitable to hold any value stored within it,\n and because |alignas| requirements don't affect platform ABI with respect to\n how parameters are laid out in memory, Variant can't be used as the type of a\n function parameter.  Pass Variant to functions by pointer or reference\n instead."]
        pub type MarkerSchema_DataRow = root::__BindgenOpaqueArray<u64, 12usize>;
        pub type MarkerSchema_DataRowVector = root::__BindgenOpaqueArray<u64, 3usize>;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct MarkerSchema_GraphData {
            pub mKey: root::std::string,
            pub mType: root::mozilla::MarkerSchema_GraphType,
            pub mColor: root::__BindgenOpaqueArray<u32, 2usize>,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of MarkerSchema_GraphData"]
                [::std::mem::size_of::<MarkerSchema_GraphData>() - 48usize];
            ["Alignment of MarkerSchema_GraphData"]
                [::std::mem::align_of::<MarkerSchema_GraphData>() - 8usize];
            ["Offset of field: MarkerSchema_GraphData::mKey"]
                [::std::mem::offset_of!(MarkerSchema_GraphData, mKey) - 0usize];
            ["Offset of field: MarkerSchema_GraphData::mType"]
                [::std::mem::offset_of!(MarkerSchema_GraphData, mType) - 32usize];
            ["Offset of field: MarkerSchema_GraphData::mColor"]
                [::std::mem::offset_of!(MarkerSchema_GraphData, mColor) - 36usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of MarkerSchema"][::std::mem::size_of::<MarkerSchema>() - 176usize];
            ["Alignment of MarkerSchema"][::std::mem::align_of::<MarkerSchema>() - 8usize];
            ["Offset of field: MarkerSchema::mLocations"]
                [::std::mem::offset_of!(MarkerSchema, mLocations) - 0usize];
            ["Offset of field: MarkerSchema::mChartLabel"]
                [::std::mem::offset_of!(MarkerSchema, mChartLabel) - 24usize];
            ["Offset of field: MarkerSchema::mTooltipLabel"]
                [::std::mem::offset_of!(MarkerSchema, mTooltipLabel) - 56usize];
            ["Offset of field: MarkerSchema::mTableLabel"]
                [::std::mem::offset_of!(MarkerSchema, mTableLabel) - 88usize];
            ["Offset of field: MarkerSchema::mIsStackBased"]
                [::std::mem::offset_of!(MarkerSchema, mIsStackBased) - 120usize];
            ["Offset of field: MarkerSchema::mData"]
                [::std::mem::offset_of!(MarkerSchema, mData) - 128usize];
            ["Offset of field: MarkerSchema::mGraphs"]
                [::std::mem::offset_of!(MarkerSchema, mGraphs) - 152usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct BaseMarkerType {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct Range<T> {
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
            pub mStart: root::mozilla::RangedPtr<T>,
            pub mEnd: root::mozilla::RangedPtr<T>,
        }
        #[doc = " EnumSet<T, U> is a set of values defined by an enumeration. It is implemented\n using a bit mask with the size of U for each value. It works both for enum\n and enum class types. EnumSet also works with U being a BitSet."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct EnumSet<Serialized> {
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<Serialized>>,
            pub mBitField: Serialized,
        }
        pub type EnumSet_valueType<T> = T;
        pub type EnumSet_serializedType<Serialized> = Serialized;
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct EnumSet_ConstIterator<Serialized> {
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<Serialized>>,
            pub mSet: *const root::mozilla::EnumSet<Serialized>,
            pub mPos: usize,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct PositionOfSignBit {
            pub _address: u8,
        }
        #[doc = " @class CheckedInt\n @brief Integer wrapper class checking for integer overflow and other errors\n @param T the integer type to wrap. Can be any type among the following:\n            - any basic integer type such as |int|\n            - any stdint type such as |int8_t|\n\n This class implements guarded integer arithmetic. Do a computation, check\n that isValid() returns true, you then have a guarantee that no problem, such\n as integer overflow, happened during this computation, and you can call\n value() to get the plain integer value.\n\n The arithmetic operators in this class are guaranteed not to raise a signal\n (e.g. in case of a division by zero).\n\n For example, suppose that you want to implement a function that computes\n (aX+aY)/aZ, that doesn't crash if aZ==0, and that reports on error (divide by\n zero or integer overflow). You could code it as follows:\n@code\nbool computeXPlusYOverZ(int aX, int aY, int aZ, int* aResult)\n{\nCheckedInt<int> checkedResult = (CheckedInt<int>(aX) + aY) / aZ;\nif (checkedResult.isValid()) {\naResult = checkedResult.value();\nreturn true;\n} else {\nreturn false;\n}\n}\n@endcode\n\n Implicit conversion from plain integers to checked integers is allowed. The\n plain integer is checked to be in range before being casted to the\n destination type. This means that the following lines all compile, and the\n resulting CheckedInts are correctly detected as valid or invalid:\n @code\n// 1 is of type int, is found to be in range for uint8_t, x is valid\nCheckedInt<uint8_t> x(1);\n// -1 is of type int, is found not to be in range for uint8_t, x is invalid\nCheckedInt<uint8_t> x(-1);\n// -1 is of type int, is found to be in range for int8_t, x is valid\nCheckedInt<int8_t> x(-1);\n// 1000 is of type int16_t, is found not to be in range for int8_t,\n// x is invalid\nCheckedInt<int8_t> x(int16_t(1000));\n// 3123456789 is of type uint32_t, is found not to be in range for int32_t,\n// x is invalid\nCheckedInt<int32_t> x(uint32_t(3123456789));\n @endcode\n Implicit conversion from\n checked integers to plain integers is not allowed. As shown in the\n above example, to get the value of a checked integer as a normal integer,\n call value().\n\n Arithmetic operations between checked and plain integers is allowed; the\n result type is the type of the checked integer.\n\n Checked integers of different types cannot be used in the same arithmetic\n expression.\n\n There are convenience typedefs for all stdint types, of the following form\n (these are just 2 examples):\n@code\ntypedef CheckedInt<int32_t> CheckedInt32;\ntypedef CheckedInt<uint16_t> CheckedUint16;\n@endcode"]
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct CheckedInt<T> {
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
            pub mValue: T,
            pub mIsValid: bool,
        }
        pub type CheckedInt8 = root::mozilla::CheckedInt<i8>;
        pub type CheckedUint8 = root::mozilla::CheckedInt<u8>;
        pub type CheckedInt16 = root::mozilla::CheckedInt<i16>;
        pub type CheckedUint16 = root::mozilla::CheckedInt<u16>;
        pub type CheckedInt32 = root::mozilla::CheckedInt<i32>;
        #[doc = " @class CheckedInt\n @brief Integer wrapper class checking for integer overflow and other errors\n @param T the integer type to wrap. Can be any type among the following:\n            - any basic integer type such as |int|\n            - any stdint type such as |int8_t|\n\n This class implements guarded integer arithmetic. Do a computation, check\n that isValid() returns true, you then have a guarantee that no problem, such\n as integer overflow, happened during this computation, and you can call\n value() to get the plain integer value.\n\n The arithmetic operators in this class are guaranteed not to raise a signal\n (e.g. in case of a division by zero).\n\n For example, suppose that you want to implement a function that computes\n (aX+aY)/aZ, that doesn't crash if aZ==0, and that reports on error (divide by\n zero or integer overflow). You could code it as follows:\n@code\nbool computeXPlusYOverZ(int aX, int aY, int aZ, int* aResult)\n{\nCheckedInt<int> checkedResult = (CheckedInt<int>(aX) + aY) / aZ;\nif (checkedResult.isValid()) {\naResult = checkedResult.value();\nreturn true;\n} else {\nreturn false;\n}\n}\n@endcode\n\n Implicit conversion from plain integers to checked integers is allowed. The\n plain integer is checked to be in range before being casted to the\n destination type. This means that the following lines all compile, and the\n resulting CheckedInts are correctly detected as valid or invalid:\n @code\n// 1 is of type int, is found to be in range for uint8_t, x is valid\nCheckedInt<uint8_t> x(1);\n// -1 is of type int, is found not to be in range for uint8_t, x is invalid\nCheckedInt<uint8_t> x(-1);\n// -1 is of type int, is found to be in range for int8_t, x is valid\nCheckedInt<int8_t> x(-1);\n// 1000 is of type int16_t, is found not to be in range for int8_t,\n// x is invalid\nCheckedInt<int8_t> x(int16_t(1000));\n// 3123456789 is of type uint32_t, is found not to be in range for int32_t,\n// x is invalid\nCheckedInt<int32_t> x(uint32_t(3123456789));\n @endcode\n Implicit conversion from\n checked integers to plain integers is not allowed. As shown in the\n above example, to get the value of a checked integer as a normal integer,\n call value().\n\n Arithmetic operations between checked and plain integers is allowed; the\n result type is the type of the checked integer.\n\n Checked integers of different types cannot be used in the same arithmetic\n expression.\n\n There are convenience typedefs for all stdint types, of the following form\n (these are just 2 examples):\n@code\ntypedef CheckedInt<int32_t> CheckedInt32;\ntypedef CheckedInt<uint16_t> CheckedUint16;\n@endcode"]
        pub type CheckedUint32 = root::mozilla::CheckedInt<u32>;
        pub type CheckedInt64 = root::mozilla::CheckedInt<i64>;
        pub type CheckedUint64 = root::mozilla::CheckedInt<u64>;
        #[doc = " This structure precedes the string buffers \"we\" allocate.  It may be the\n case that nsTAString::mData does not point to one of these special\n buffers.  The mDataFlags member variable distinguishes the buffer type.\n\n When this header is in use, it enables reference counting, and capacity\n tracking.  NOTE: A string buffer can be modified only if its reference\n count is 1."]
        #[repr(C)]
        #[derive(Debug, PartialEq)]
        pub struct StringBuffer {
            pub mRefCount: u32,
            pub mStorageSize: u32,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of StringBuffer"][::std::mem::size_of::<StringBuffer>() - 8usize];
            ["Alignment of StringBuffer"][::std::mem::align_of::<StringBuffer>() - 4usize];
            ["Offset of field: StringBuffer::mRefCount"]
                [::std::mem::offset_of!(StringBuffer, mRefCount) - 0usize];
            ["Offset of field: StringBuffer::mStorageSize"]
                [::std::mem::offset_of!(StringBuffer, mStorageSize) - 4usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct BufferList {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct BufferList_Segment {
            pub mData: *mut ::std::os::raw::c_char,
            pub mSize: usize,
            pub mCapacity: usize,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct BufferList_IterImpl {
            pub mSegment: usize,
            pub mData: *mut ::std::os::raw::c_char,
            pub mDataEnd: *mut ::std::os::raw::c_char,
            pub mAbsoluteOffset: usize,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: RefPtrTraits_open0_InitialStencilAndDelazifications_close0"] [:: std :: mem :: size_of :: < root :: mozilla :: RefPtrTraits > () - 1usize] ;
            ["Align of template specialization: RefPtrTraits_open0_InitialStencilAndDelazifications_close0"] [:: std :: mem :: align_of :: < root :: mozilla :: RefPtrTraits > () - 1usize] ;
        };
    }
    #[doc = " already_AddRefed cooperates with reference counting smart pointers to enable\n you to assign in a pointer _without_ |AddRef|ing it.  You might want to use\n this as a return type from a function that returns an already |AddRef|ed\n pointer.  Or, you might want to use this as a parameter type in a function\n that wants to force a transfer-of-ownership from a RefPtr in the caller (for\n example, if the function expects callers to pass in a newly-created object,\n which the function then takes ownership of).\n\n TODO Move already_AddRefed to namespace mozilla.  This has not yet been done\n because of the sheer number of usages of already_AddRefed.\n\n When should you use already_AddRefed<>?\n * Ensure a consumer takes ownership of a reference\n * Pass ownership without calling AddRef/Release (sometimes required in\n   off-main-thread code)\n * The ref pointer type you're using doesn't support move construction\n\n Otherwise, use std::move(RefPtr/nsCOMPtr/etc)."]
    #[repr(C)]
    #[derive(Debug, PartialEq)]
    pub struct already_AddRefed<T> {
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
        pub mRawPtr: *mut T,
    }
    pub mod __pstl {
        #[allow(unused_imports)]
        use self::super::super::root;
        pub mod execution {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
    }
    pub mod fmt {
        #[allow(unused_imports)]
        use self::super::super::root;
        pub mod detail {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct nsISupports {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, PartialEq)]
    pub struct RefPtr<T> {
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
        pub mRawPtr: *mut T,
    }
    pub type RefPtr_element_type<T> = T;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, PartialEq)]
    pub struct RefPtr_Proxy {
        pub _address: u8,
    }
    pub type RefPtr_Proxy_member_function = u8;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, PartialEq)]
    pub struct RefPtr_ConstRemovingRefPtrTraits {
        pub _address: u8,
    }
    pub mod js {
        #[allow(unused_imports)]
        use self::super::super::root;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BaseScript {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BaseShape {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct GetterSetter {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct PropMap {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct RegExpShared {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Shape {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Scope {
            _unused: [u8; 0],
        }
        pub mod gc {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct SmallBuffer {
                _unused: [u8; 0],
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct Cell {
                _unused: [u8; 0],
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct Arena {
                _unused: [u8; 0],
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct ArenaChunk {
                _unused: [u8; 0],
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct StoreBuffer {
                _unused: [u8; 0],
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct TenuredCell {
                _unused: [u8; 0],
            }
            #[repr(u8)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum ChunkKind {
                Invalid = 0,
                TenuredArenas = 1,
                MediumBuffers = 2,
                NurseryToSpace = 3,
                NurseryFromSpace = 4,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct ChunkBase {
                pub storeBuffer: *mut root::js::gc::StoreBuffer,
                pub runtime: *mut root::JSRuntime,
                pub kind: root::js::gc::ChunkKind,
                pub nurseryChunkIndex: u8,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of ChunkBase"][::std::mem::size_of::<ChunkBase>() - 24usize];
                ["Alignment of ChunkBase"][::std::mem::align_of::<ChunkBase>() - 8usize];
                ["Offset of field: ChunkBase::storeBuffer"]
                    [::std::mem::offset_of!(ChunkBase, storeBuffer) - 0usize];
                ["Offset of field: ChunkBase::runtime"]
                    [::std::mem::offset_of!(ChunkBase, runtime) - 8usize];
                ["Offset of field: ChunkBase::kind"]
                    [::std::mem::offset_of!(ChunkBase, kind) - 16usize];
                ["Offset of field: ChunkBase::nurseryChunkIndex"]
                    [::std::mem::offset_of!(ChunkBase, nurseryChunkIndex) - 17usize];
            };
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct ArenaChunkInfo {
                pub next: *mut root::js::gc::ArenaChunk,
                pub prev: *mut root::js::gc::ArenaChunk,
                pub numArenasFree: u32,
                pub numArenasFreeCommitted: u32,
                pub isCurrentChunk: bool,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of ArenaChunkInfo"][::std::mem::size_of::<ArenaChunkInfo>() - 32usize];
                ["Alignment of ArenaChunkInfo"][::std::mem::align_of::<ArenaChunkInfo>() - 8usize];
                ["Offset of field: ArenaChunkInfo::next"]
                    [::std::mem::offset_of!(ArenaChunkInfo, next) - 0usize];
                ["Offset of field: ArenaChunkInfo::prev"]
                    [::std::mem::offset_of!(ArenaChunkInfo, prev) - 8usize];
                ["Offset of field: ArenaChunkInfo::numArenasFree"]
                    [::std::mem::offset_of!(ArenaChunkInfo, numArenasFree) - 16usize];
                ["Offset of field: ArenaChunkInfo::numArenasFreeCommitted"]
                    [::std::mem::offset_of!(ArenaChunkInfo, numArenasFreeCommitted) - 20usize];
                ["Offset of field: ArenaChunkInfo::isCurrentChunk"]
                    [::std::mem::offset_of!(ArenaChunkInfo, isCurrentChunk) - 24usize];
            };
            #[doc = " Atomic<T> implementation for integral types.\n\n In addition to atomic store and load operations, compound assignment and\n increment/decrement operators are implemented which perform the\n corresponding read-modify-write operation atomically.  Finally, an atomic\n swap method is provided."]
            pub type MarkBitmapWord = u64;
            #[repr(u32)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum ColorBit {
                BlackBit = 0,
                GrayOrBlackBit = 1,
            }
            #[repr(u8)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum MarkColor {
                Gray = 1,
                Black = 2,
            }
            extern "C" {
                #[link_name = "\u{1}ByteCount"]
                pub static MarkBitmap_ByteCount: usize;
            }
            extern "C" {
                #[link_name = "\u{1}WordCount"]
                pub static MarkBitmap_WordCount: usize;
            }
            extern "C" {
                #[link_name = "\u{1}FirstThingAdjustmentBits"]
                pub static MarkBitmap_FirstThingAdjustmentBits: usize;
            }
            extern "C" {
                #[link_name = "\u{1}FirstThingAdjustmentWords"]
                pub static MarkBitmap_FirstThingAdjustmentWords: usize;
            }
            pub type ChunkMarkBitmap = root::__BindgenOpaqueArray<u8, 16128usize>;
            #[doc = " An object like std::bitset but which provides access to the underlying\n storage.\n\n The type |StorageType| must be an unsigned integer or a mozilla::Atomic\n wrapping an unsigned integer. Use of atomic types makes word access atomic,\n but does not make operations that operate on the whole bitset atomic.\n\n The limited API is due to expedience only; feel free to flesh out any\n std::bitset-like members."]
            pub type ChunkPageBitmap = root::__BindgenOpaqueArray<u32, 8usize>;
            #[doc = " An object like std::bitset but which provides access to the underlying\n storage.\n\n The type |StorageType| must be an unsigned integer or a mozilla::Atomic\n wrapping an unsigned integer. Use of atomic types makes word access atomic,\n but does not make operations that operate on the whole bitset atomic.\n\n The limited API is due to expedience only; feel free to flesh out any\n std::bitset-like members."]
            pub type ChunkArenaBitmap = root::__BindgenOpaqueArray<u32, 8usize>;
            #[repr(C)]
            #[repr(align(64))]
            pub struct ArenaChunkBase {
                pub _base: root::js::gc::ChunkBase,
                pub info: root::js::gc::ArenaChunkInfo,
                pub __bindgen_padding_0: u64,
                pub markBits: root::js::gc::ChunkMarkBitmap,
                pub freeCommittedArenas: root::js::gc::ChunkArenaBitmap,
                pub decommittedPages: root::js::gc::ChunkPageBitmap,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of ArenaChunkBase"][::std::mem::size_of::<ArenaChunkBase>() - 16256usize];
                ["Alignment of ArenaChunkBase"][::std::mem::align_of::<ArenaChunkBase>() - 64usize];
                ["Offset of field: ArenaChunkBase::info"]
                    [::std::mem::offset_of!(ArenaChunkBase, info) - 24usize];
                ["Offset of field: ArenaChunkBase::markBits"]
                    [::std::mem::offset_of!(ArenaChunkBase, markBits) - 64usize];
                ["Offset of field: ArenaChunkBase::freeCommittedArenas"]
                    [::std::mem::offset_of!(ArenaChunkBase, freeCommittedArenas) - 16192usize];
                ["Offset of field: ArenaChunkBase::decommittedPages"]
                    [::std::mem::offset_of!(ArenaChunkBase, decommittedPages) - 16224usize];
            };
            pub mod detail {
                #[allow(unused_imports)]
                use self::super::super::super::super::root;
                extern "C" {
                    #[link_name = "\u{1}_ZN2js2gc6detail16CanCheckGrayBitsEPKNS0_11TenuredCellE"]
                    pub fn CanCheckGrayBits(cell: *const root::js::gc::TenuredCell) -> bool;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN2js2gc6detail23CellIsMarkedGrayIfKnownEPKNS0_11TenuredCellE"]
                    pub fn CellIsMarkedGrayIfKnown(cell: *const root::js::gc::TenuredCell) -> bool;
                }
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc29PerformIncrementalReadBarrierEN2JS9GCCellPtrE"]
                pub fn PerformIncrementalReadBarrier(thing: root::JS::GCCellPtr);
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct ProfilerMemoryCounts {
                pub bytes: usize,
                pub operations: u64,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of ProfilerMemoryCounts"]
                    [::std::mem::size_of::<ProfilerMemoryCounts>() - 16usize];
                ["Alignment of ProfilerMemoryCounts"]
                    [::std::mem::align_of::<ProfilerMemoryCounts>() - 8usize];
                ["Offset of field: ProfilerMemoryCounts::bytes"]
                    [::std::mem::offset_of!(ProfilerMemoryCounts, bytes) - 0usize];
                ["Offset of field: ProfilerMemoryCounts::operations"]
                    [::std::mem::offset_of!(ProfilerMemoryCounts, operations) - 8usize];
            };
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc23GetProfilerMemoryCountsEv"]
                pub fn GetProfilerMemoryCounts() -> root::js::gc::ProfilerMemoryCounts;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc17TraceExternalEdgeEP8JSTracerPPN2JS6BigIntEPKc"]
                pub fn TraceExternalEdge(
                    trc: *mut root::JSTracer,
                    thingp: *mut *mut root::JS::BigInt,
                    name: *const ::std::os::raw::c_char,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc17TraceExternalEdgeEP8JSTracerPPN2JS6SymbolEPKc"]
                pub fn TraceExternalEdge1(
                    trc: *mut root::JSTracer,
                    thingp: *mut *mut root::JS::Symbol,
                    name: *const ::std::os::raw::c_char,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc17TraceExternalEdgeEP8JSTracerPP6JSAtomPKc"]
                pub fn TraceExternalEdge2(
                    trc: *mut root::JSTracer,
                    thingp: *mut *mut root::JSAtom,
                    name: *const ::std::os::raw::c_char,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc17TraceExternalEdgeEP8JSTracerPP10JSFunctionPKc"]
                pub fn TraceExternalEdge3(
                    trc: *mut root::JSTracer,
                    thingp: *mut *mut root::JSFunction,
                    name: *const ::std::os::raw::c_char,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc17TraceExternalEdgeEP8JSTracerPP14JSLinearStringPKc"]
                pub fn TraceExternalEdge4(
                    trc: *mut root::JSTracer,
                    thingp: *mut *mut root::JSLinearString,
                    name: *const ::std::os::raw::c_char,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc17TraceExternalEdgeEP8JSTracerPP8JSObjectPKc"]
                pub fn TraceExternalEdge5(
                    trc: *mut root::JSTracer,
                    thingp: *mut *mut root::JSObject,
                    name: *const ::std::os::raw::c_char,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc17TraceExternalEdgeEP8JSTracerPP8JSScriptPKc"]
                pub fn TraceExternalEdge6(
                    trc: *mut root::JSTracer,
                    thingp: *mut *mut root::JSScript,
                    name: *const ::std::os::raw::c_char,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc17TraceExternalEdgeEP8JSTracerPP8JSStringPKc"]
                pub fn TraceExternalEdge7(
                    trc: *mut root::JSTracer,
                    thingp: *mut *mut root::JSString,
                    name: *const ::std::os::raw::c_char,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc17TraceExternalEdgeEP8JSTracerPN2JS5ValueEPKc"]
                pub fn TraceExternalEdge8(
                    trc: *mut root::JSTracer,
                    thingp: *mut root::JS::Value,
                    name: *const ::std::os::raw::c_char,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc17TraceExternalEdgeEP8JSTracerPN2JS11PropertyKeyEPKc"]
                pub fn TraceExternalEdge9(
                    trc: *mut root::JSTracer,
                    thingp: *mut root::JS::PropertyKey,
                    name: *const ::std::os::raw::c_char,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc10TraceRealmEP8JSTracerPN2JS5RealmEPKc"]
                pub fn TraceRealm(
                    trc: *mut root::JSTracer,
                    realm: *mut root::JS::Realm,
                    name: *const ::std::os::raw::c_char,
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct GCRuntime {
                _unused: [u8; 0],
            }
            extern "C" {
                #[doc = " Create an object providing access to the garbage collector's internal notion\n of the current state of memory (both GC heap memory and GCthing-controlled\n malloc memory."]
                #[link_name = "\u{1}_ZN2js2gc19NewMemoryInfoObjectEP9JSContext"]
                pub fn NewMemoryInfoObject(cx: *mut root::JSContext) -> *mut root::JSObject;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc12GetGCContextEP9JSContext"]
                pub fn GetGCContext(cx: *mut root::JSContext) -> *mut root::JS::GCContext;
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct SharedMemoryUse {
                pub count: usize,
                pub nbytes: usize,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of SharedMemoryUse"][::std::mem::size_of::<SharedMemoryUse>() - 16usize];
                ["Alignment of SharedMemoryUse"]
                    [::std::mem::align_of::<SharedMemoryUse>() - 8usize];
                ["Offset of field: SharedMemoryUse::count"]
                    [::std::mem::offset_of!(SharedMemoryUse, count) - 0usize];
                ["Offset of field: SharedMemoryUse::nbytes"]
                    [::std::mem::offset_of!(SharedMemoryUse, nbytes) - 8usize];
            };
            pub type SharedMemoryMap = u8;
        }
        pub mod jit {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct JitCode {
                _unused: [u8; 0],
            }
            #[repr(u16)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum InlinableNative {
                __bindgen_cannot_repr_c_on_empty_enum = 0,
            }
            #[repr(u16)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum TrampolineNative {
                __bindgen_cannot_repr_c_on_empty_enum = 0,
            }
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js29CurrentThreadCanAccessRuntimeEPK9JSRuntime"]
            pub fn CurrentThreadCanAccessRuntime(rt: *const root::JSRuntime) -> bool;
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum ThreadType {
            THREAD_TYPE_NONE = 0,
            THREAD_TYPE_MAIN = 1,
            THREAD_TYPE_WASM_COMPILE_TIER1 = 2,
            THREAD_TYPE_WASM_COMPILE_TIER2 = 3,
            THREAD_TYPE_BASELINE = 4,
            THREAD_TYPE_ION = 5,
            THREAD_TYPE_COMPRESS = 6,
            THREAD_TYPE_GCPARALLEL = 7,
            THREAD_TYPE_PROMISE_TASK = 8,
            THREAD_TYPE_ION_FREE = 9,
            THREAD_TYPE_WASM_GENERATOR_COMPLETE_TIER2 = 10,
            THREAD_TYPE_WASM_COMPILE_PARTIAL_TIER2 = 11,
            THREAD_TYPE_WORKER = 12,
            THREAD_TYPE_DELAZIFY = 13,
            THREAD_TYPE_DELAZIFY_FREE = 14,
            THREAD_TYPE_MAX = 15,
        }
        pub mod oom {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct AutoEnterOOMUnsafeRegion {
            pub _address: u8,
        }
        pub type AutoEnterOOMUnsafeRegion_AnnotateOOMAllocationSizeCallback =
            ::std::option::Option<unsafe extern "C" fn(arg1: usize)>;
        extern "C" {
            #[link_name = "\u{1}_ZN2js24AutoEnterOOMUnsafeRegion23annotateOOMSizeCallbackE"]
            pub static mut AutoEnterOOMUnsafeRegion_annotateOOMSizeCallback: u64;
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of AutoEnterOOMUnsafeRegion"]
                [::std::mem::size_of::<AutoEnterOOMUnsafeRegion>() - 1usize];
            ["Alignment of AutoEnterOOMUnsafeRegion"]
                [::std::mem::align_of::<AutoEnterOOMUnsafeRegion>() - 1usize];
        };
        extern "C" {
            #[link_name = "\u{1}_ZN2js19InitMallocAllocatorEv"]
            pub fn InitMallocAllocator();
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js23ShutDownMallocAllocatorEv"]
            pub fn ShutDownMallocAllocator();
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js34AssertJSStringBufferInCorrectArenaEPKv"]
            pub fn AssertJSStringBufferInCorrectArena(ptr: *const ::std::os::raw::c_void);
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct FrontendContext {
            _unused: [u8; 0],
        }
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum AllocFunction {
            Malloc = 0,
            Calloc = 1,
            Realloc = 2,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct ArenaAllocPolicyBase {
            pub _address: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ArenaAllocPolicyBase"]
                [::std::mem::size_of::<ArenaAllocPolicyBase>() - 1usize];
            ["Alignment of ArenaAllocPolicyBase"]
                [::std::mem::align_of::<ArenaAllocPolicyBase>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct AllocPolicyBase {
            pub _address: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of AllocPolicyBase"][::std::mem::size_of::<AllocPolicyBase>() - 1usize];
            ["Alignment of AllocPolicyBase"][::std::mem::align_of::<AllocPolicyBase>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct BackgroundAllocPolicyBase {
            pub _address: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of BackgroundAllocPolicyBase"]
                [::std::mem::size_of::<BackgroundAllocPolicyBase>() - 1usize];
            ["Alignment of BackgroundAllocPolicyBase"]
                [::std::mem::align_of::<BackgroundAllocPolicyBase>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct SystemAllocPolicy {
            pub _address: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of SystemAllocPolicy"][::std::mem::size_of::<SystemAllocPolicy>() - 1usize];
            ["Alignment of SystemAllocPolicy"]
                [::std::mem::align_of::<SystemAllocPolicy>() - 1usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct BackgroundSystemAllocPolicy {
            pub _address: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of BackgroundSystemAllocPolicy"]
                [::std::mem::size_of::<BackgroundSystemAllocPolicy>() - 1usize];
            ["Alignment of BackgroundSystemAllocPolicy"]
                [::std::mem::align_of::<BackgroundSystemAllocPolicy>() - 1usize];
        };
        extern "C" {
            #[link_name = "\u{1}_ZN2js17ReportOutOfMemoryEP9JSContext"]
            pub fn ReportOutOfMemory(cx: *mut root::JSContext);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js17ReportOutOfMemoryEPNS_15FrontendContextE"]
            pub fn ReportOutOfMemory1(fc: *mut root::js::FrontendContext);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js22ReportLargeOutOfMemoryEP9JSContext"]
            pub fn ReportLargeOutOfMemory(cx: *mut root::JSContext);
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct TempAllocPolicy {
            pub context_bits_: usize,
        }
        pub const TempAllocPolicy_JsContextTag: usize = 1;
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of TempAllocPolicy"][::std::mem::size_of::<TempAllocPolicy>() - 8usize];
            ["Alignment of TempAllocPolicy"][::std::mem::align_of::<TempAllocPolicy>() - 8usize];
            ["Offset of field: TempAllocPolicy::context_bits_"]
                [::std::mem::offset_of!(TempAllocPolicy, context_bits_) - 0usize];
        };
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct MallocAllocPolicy {
            pub _address: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of MallocAllocPolicy"][::std::mem::size_of::<MallocAllocPolicy>() - 1usize];
            ["Alignment of MallocAllocPolicy"]
                [::std::mem::align_of::<MallocAllocPolicy>() - 1usize];
        };
        pub type HashNumber = root::mozilla::HashNumber;
        pub type DefaultHasher = root::mozilla::DefaultHasher;
        pub type PointerHasher = root::mozilla::PointerHasher;
        pub type HashSet = u8;
        pub type HashMap = u8;
        extern "C" {
            #[link_name = "\u{1}_ZN2js26CurrentThreadCanAccessZoneEPN2JS4ZoneE"]
            pub fn CurrentThreadCanAccessZone(zone: *mut root::JS::Zone) -> bool;
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct GenericTracerImpl {
            pub _base: root::JSTracer,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct AbstractGeneratorObject {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct SavedFrame {
            _unused: [u8; 0],
        }
        pub mod wasm {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct AnyRef {
                _unused: [u8; 0],
            }
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js32UnsafeTraceManuallyBarrieredEdgeEP8JSTracerPP8JSObjectPKc"]
            pub fn UnsafeTraceManuallyBarrieredEdge(
                trc: *mut root::JSTracer,
                thingp: *mut *mut root::JSObject,
                name: *const ::std::os::raw::c_char,
            );
        }
        pub const ProfilingStackFrame_NullPCOffset: i32 = -1;
        extern "C" {
            #[link_name = "\u{1}_ZN2js24SetContextProfilingStackEP9JSContextP14ProfilingStack"]
            pub fn SetContextProfilingStack(
                cx: *mut root::JSContext,
                profilingStack: *mut root::ProfilingStack,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js27EnableContextProfilingStackEP9JSContextb"]
            pub fn EnableContextProfilingStack(cx: *mut root::JSContext, enabled: bool);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js35RegisterContextProfilingEventMarkerEP9JSContextPFvN7mozilla14MarkerCategoryEPKcS5_EPFvS3_S5_NS2_9TimeStampES5_E"]
            pub fn RegisterContextProfilingEventMarker(
                cx: *mut root::JSContext,
                mark: ::std::option::Option<
                    unsafe extern "C" fn(
                        arg1: root::mozilla::MarkerCategory,
                        arg2: *const ::std::os::raw::c_char,
                        arg3: *const ::std::os::raw::c_char,
                    ),
                >,
                interval: ::std::option::Option<
                    unsafe extern "C" fn(
                        arg1: root::mozilla::MarkerCategory,
                        arg2: *const ::std::os::raw::c_char,
                        arg3: root::mozilla::TimeStamp,
                        arg4: *const ::std::os::raw::c_char,
                    ),
                >,
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct AutoGeckoProfilerEntry {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct GeckoProfilerEntryMarker {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct GeckoProfilerBaselineOSRMarker {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct GeckoProfilerThread {
            pub profilingStack_: *mut root::ProfilingStack,
            pub profilingStackIfEnabled_: *mut root::ProfilingStack,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of GeckoProfilerThread"][::std::mem::size_of::<GeckoProfilerThread>() - 16usize];
            ["Alignment of GeckoProfilerThread"]
                [::std::mem::align_of::<GeckoProfilerThread>() - 8usize];
            ["Offset of field: GeckoProfilerThread::profilingStack_"]
                [::std::mem::offset_of!(GeckoProfilerThread, profilingStack_) - 0usize];
            ["Offset of field: GeckoProfilerThread::profilingStackIfEnabled_"]
                [::std::mem::offset_of!(GeckoProfilerThread, profilingStackIfEnabled_) - 8usize];
        };
        pub type UniquePtr = u8;
        pub mod detail {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct UniqueSelector {
                pub _address: u8,
            }
            #[doc = " UniquePtr is a smart pointer that wholly owns a resource.  Ownership may be\n transferred out of a UniquePtr through explicit action, but otherwise the\n resource is destroyed when the UniquePtr is destroyed.\n\n UniquePtr is similar to C++98's std::auto_ptr, but it improves upon auto_ptr\n in one crucial way: it's impossible to copy a UniquePtr.  Copying an auto_ptr\n obviously *can't* copy ownership of its singly-owned resource.  So what\n happens if you try to copy one?  Bizarrely, ownership is implicitly\n *transferred*, preserving single ownership but breaking code that assumes a\n copy of an object is identical to the original.  (This is why auto_ptr is\n prohibited in STL containers.)\n\n UniquePtr solves this problem by being *movable* rather than copyable.\n Instead of passing a |UniquePtr u| directly to the constructor or assignment\n operator, you pass |Move(u)|.  In doing so you indicate that you're *moving*\n ownership out of |u|, into the target of the construction/assignment.  After\n the transfer completes, |u| contains |nullptr| and may be safely destroyed.\n This preserves single ownership but also allows UniquePtr to be moved by\n algorithms that have been made move-safe.  (Note: if |u| is instead a\n temporary expression, don't use |Move()|: just pass the expression, because\n it's already move-ready.  For more information see Move.h.)\n\n UniquePtr is also better than std::auto_ptr in that the deletion operation is\n customizable.  An optional second template parameter specifies a class that\n (through its operator()(T*)) implements the desired deletion policy.  If no\n policy is specified, mozilla::DefaultDelete<T> is used -- which will either\n |delete| or |delete[]| the resource, depending whether the resource is an\n array.  Custom deletion policies ideally should be empty classes (no member\n fields, no member fields in base classes, no virtual methods/inheritance),\n because then UniquePtr can be just as efficient as a raw pointer.\n\n Use of UniquePtr proceeds like so:\n\n   UniquePtr<int> g1; // initializes to nullptr\n   g1.reset(new int); // switch resources using reset()\n   g1 = nullptr; // clears g1, deletes the int\n\n   UniquePtr<int> g2(new int); // owns that int\n   int* p = g2.release(); // g2 leaks its int -- still requires deletion\n   delete p; // now freed\n\n   struct S { int x; S(int x) : x(x) {} };\n   UniquePtr<S> g3, g4(new S(5));\n   g3 = std::move(g4); // g3 owns the S, g4 cleared\n   S* p = g3.get(); // g3 still owns |p|\n   assert(g3->x == 5); // operator-> works (if .get() != nullptr)\n   assert((*g3).x == 5); // also operator* (again, if not cleared)\n   std::swap(g3, g4); // g4 now owns the S, g3 cleared\n   g3.swap(g4);  // g3 now owns the S, g4 cleared\n   UniquePtr<S> g5(std::move(g3)); // g5 owns the S, g3 cleared\n   g5.reset(); // deletes the S, g5 cleared\n\n   struct FreePolicy { void operator()(void* p) { free(p); } };\n   UniquePtr<int, FreePolicy> g6(static_cast<int*>(malloc(sizeof(int))));\n   int* ptr = g6.get();\n   g6 = nullptr; // calls free(ptr)\n\n Now, carefully note a few things you *can't* do:\n\n   UniquePtr<int> b1;\n   b1 = new int; // BAD: can only assign another UniquePtr\n   int* ptr = b1; // BAD: no auto-conversion to pointer, use get()\n\n   UniquePtr<int> b2(b1); // BAD: can't copy a UniquePtr\n   UniquePtr<int> b3 = b1; // BAD: can't copy-assign a UniquePtr\n\n (Note that changing a UniquePtr to store a direct |new| expression is\n permitted, but usually you should use MakeUnique, defined at the end of this\n header.)\n\n A few miscellaneous notes:\n\n UniquePtr, when not instantiated for an array type, can be move-constructed\n and move-assigned, not only from itself but from \"derived\" UniquePtr<U, E>\n instantiations where U converts to T and E converts to D.  If you want to use\n this, you're going to have to specify a deletion policy for both UniquePtr\n instantations, and T pretty much has to have a virtual destructor.  In other\n words, this doesn't work:\n\n   struct Base { virtual ~Base() {} };\n   struct Derived : Base {};\n\n   UniquePtr<Base> b1;\n   // BAD: DefaultDelete<Base> and DefaultDelete<Derived> don't interconvert\n   UniquePtr<Derived> d1(std::move(b));\n\n   UniquePtr<Base> b2;\n   UniquePtr<Derived, DefaultDelete<Base>> d2(std::move(b2)); // okay\n\n UniquePtr is specialized for array types.  Specializing with an array type\n creates a smart-pointer version of that array -- not a pointer to such an\n array.\n\n   UniquePtr<int[]> arr(new int[5]);\n   arr[0] = 4;\n\n What else is different?  Deletion of course uses |delete[]|.  An operator[]\n is provided.  Functionality that doesn't make sense for arrays is removed.\n The constructors and mutating methods only accept array pointers (not T*, U*\n that converts to T*, or UniquePtr<U[]> or UniquePtr<U>) or |nullptr|.\n\n It's perfectly okay for a function to return a UniquePtr. This transfers\n the UniquePtr's sole ownership of the data, to the fresh UniquePtr created\n in the calling function, that will then solely own that data. Such functions\n can return a local variable UniquePtr, |nullptr|, |UniquePtr(ptr)| where\n |ptr| is a |T*|, or a UniquePtr |Move()|'d from elsewhere.\n\n UniquePtr will commonly be a member of a class, with lifetime equivalent to\n that of that class.  If you want to expose the related resource, you could\n expose a raw pointer via |get()|, but ownership of a raw pointer is\n inherently unclear.  So it's better to expose a |const UniquePtr&| instead.\n This prohibits mutation but still allows use of |get()| when needed (but\n operator-> is preferred).  Of course, you can only use this smart pointer as\n long as the enclosing class instance remains live -- no different than if you\n exposed the |get()| raw pointer.\n\n To pass a UniquePtr-managed resource as a pointer, use a |const UniquePtr&|\n argument.  To specify an inout parameter (where the method may or may not\n take ownership of the resource, or reset it), or to specify an out parameter\n (where simply returning a |UniquePtr| isn't possible), use a |UniquePtr&|\n argument.  To unconditionally transfer ownership of a UniquePtr\n into a method, use a |UniquePtr| argument.  To conditionally transfer\n ownership of a resource into a method, should the method want it, use a\n |UniquePtr&&| argument."]
            pub type UniqueSelector_SingleObject = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct PtrBarrierMethodsBase {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct TypeIsGCThing {
                pub _base: root::std::false_type,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of template specialization: TypeIsGCThing_open0_Value_close0"]
                    [::std::mem::size_of::<root::js::detail::TypeIsGCThing>() - 1usize];
                ["Align of template specialization: TypeIsGCThing_open0_Value_close0"]
                    [::std::mem::align_of::<root::js::detail::TypeIsGCThing>() - 1usize];
            };
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct ProxyReservedSlots {
                pub slots: [root::JS::Value; 1usize],
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of ProxyReservedSlots"]
                    [::std::mem::size_of::<ProxyReservedSlots>() - 8usize];
                ["Alignment of ProxyReservedSlots"]
                    [::std::mem::align_of::<ProxyReservedSlots>() - 8usize];
                ["Offset of field: ProxyReservedSlots::slots"]
                    [::std::mem::offset_of!(ProxyReservedSlots, slots) - 0usize];
            };
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct ProxyValueArray {
                pub expandoSlot: root::JS::Value,
                pub privateSlot: root::JS::Value,
                pub reservedSlots: root::js::detail::ProxyReservedSlots,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of ProxyValueArray"][::std::mem::size_of::<ProxyValueArray>() - 24usize];
                ["Alignment of ProxyValueArray"]
                    [::std::mem::align_of::<ProxyValueArray>() - 8usize];
                ["Offset of field: ProxyValueArray::expandoSlot"]
                    [::std::mem::offset_of!(ProxyValueArray, expandoSlot) - 0usize];
                ["Offset of field: ProxyValueArray::privateSlot"]
                    [::std::mem::offset_of!(ProxyValueArray, privateSlot) - 8usize];
                ["Offset of field: ProxyValueArray::reservedSlots"]
                    [::std::mem::offset_of!(ProxyValueArray, reservedSlots) - 16usize];
            };
            #[repr(C)]
            #[derive(Debug, Copy, Clone, PartialEq)]
            pub struct ProxyDataLayout {
                pub reservedSlots: *mut root::js::detail::ProxyReservedSlots,
                pub handler: *const root::js::BaseProxyHandler,
            }
            #[allow(clippy::unnecessary_operation, clippy::identity_op)]
            const _: () = {
                ["Size of ProxyDataLayout"][::std::mem::size_of::<ProxyDataLayout>() - 16usize];
                ["Alignment of ProxyDataLayout"]
                    [::std::mem::align_of::<ProxyDataLayout>() - 8usize];
                ["Offset of field: ProxyDataLayout::reservedSlots"]
                    [::std::mem::offset_of!(ProxyDataLayout, reservedSlots) - 0usize];
                ["Offset of field: ProxyDataLayout::handler"]
                    [::std::mem::offset_of!(ProxyDataLayout, handler) - 8usize];
            };
            extern "C" {
                #[link_name = "\u{1}_ZN2js6detail15SetValueInProxyEPN2JS5ValueERKS2_"]
                pub fn SetValueInProxy(slot: *mut root::JS::Value, value: *const root::JS::Value);
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js6detail12IsWindowSlowEP8JSObject"]
                pub fn IsWindowSlow(obj: *mut root::JSObject) -> bool;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js6detail25ToWindowProxyIfWindowSlowEP8JSObject"]
                pub fn ToWindowProxyIfWindowSlow(obj: *mut root::JSObject) -> *mut root::JSObject;
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Nursery {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct BarrierMethods {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct WrappedPtrOperations {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct MutableWrappedPtrOperations {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct RootedOperations {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct HandleOperations {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct MutableHandleOperations {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct HeapOperations {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, PartialEq)]
        pub struct IsHeapConstructibleType {
            pub _base: root::std::false_type,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: IsHeapConstructibleType_open0_ptr_BigInt_void_close0"] [:: std :: mem :: size_of :: < root :: js :: IsHeapConstructibleType > () - 1usize] ;
            ["Align of template specialization: IsHeapConstructibleType_open0_ptr_BigInt_void_close0"] [:: std :: mem :: align_of :: < root :: js :: IsHeapConstructibleType > () - 1usize] ;
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: IsHeapConstructibleType_open0_ptr_Symbol_void_close0"] [:: std :: mem :: size_of :: < root :: js :: IsHeapConstructibleType > () - 1usize] ;
            ["Align of template specialization: IsHeapConstructibleType_open0_ptr_Symbol_void_close0"] [:: std :: mem :: align_of :: < root :: js :: IsHeapConstructibleType > () - 1usize] ;
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: IsHeapConstructibleType_open0_ptr_JSAtom_void_close0"] [:: std :: mem :: size_of :: < root :: js :: IsHeapConstructibleType > () - 1usize] ;
            ["Align of template specialization: IsHeapConstructibleType_open0_ptr_JSAtom_void_close0"] [:: std :: mem :: align_of :: < root :: js :: IsHeapConstructibleType > () - 1usize] ;
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: IsHeapConstructibleType_open0_ptr_JSFunction_void_close0"] [:: std :: mem :: size_of :: < root :: js :: IsHeapConstructibleType > () - 1usize] ;
            ["Align of template specialization: IsHeapConstructibleType_open0_ptr_JSFunction_void_close0"] [:: std :: mem :: align_of :: < root :: js :: IsHeapConstructibleType > () - 1usize] ;
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: IsHeapConstructibleType_open0_ptr_JSLinearString_void_close0"] [:: std :: mem :: size_of :: < root :: js :: IsHeapConstructibleType > () - 1usize] ;
            ["Align of template specialization: IsHeapConstructibleType_open0_ptr_JSLinearString_void_close0"] [:: std :: mem :: align_of :: < root :: js :: IsHeapConstructibleType > () - 1usize] ;
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: IsHeapConstructibleType_open0_ptr_JSObject_void_close0"] [:: std :: mem :: size_of :: < root :: js :: IsHeapConstructibleType > () - 1usize] ;
            ["Align of template specialization: IsHeapConstructibleType_open0_ptr_JSObject_void_close0"] [:: std :: mem :: align_of :: < root :: js :: IsHeapConstructibleType > () - 1usize] ;
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: IsHeapConstructibleType_open0_ptr_JSScript_void_close0"] [:: std :: mem :: size_of :: < root :: js :: IsHeapConstructibleType > () - 1usize] ;
            ["Align of template specialization: IsHeapConstructibleType_open0_ptr_JSScript_void_close0"] [:: std :: mem :: align_of :: < root :: js :: IsHeapConstructibleType > () - 1usize] ;
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: IsHeapConstructibleType_open0_ptr_JSString_void_close0"] [:: std :: mem :: size_of :: < root :: js :: IsHeapConstructibleType > () - 1usize] ;
            ["Align of template specialization: IsHeapConstructibleType_open0_ptr_JSString_void_close0"] [:: std :: mem :: align_of :: < root :: js :: IsHeapConstructibleType > () - 1usize] ;
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: IsHeapConstructibleType_open0_Value_void_close0"]
                [::std::mem::size_of::<root::js::IsHeapConstructibleType>() - 1usize];
            ["Align of template specialization: IsHeapConstructibleType_open0_Value_void_close0"]
                [::std::mem::align_of::<root::js::IsHeapConstructibleType>() - 1usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: IsHeapConstructibleType_open0_PropertyKey_void_close0"] [:: std :: mem :: size_of :: < root :: js :: IsHeapConstructibleType > () - 1usize] ;
            ["Align of template specialization: IsHeapConstructibleType_open0_PropertyKey_void_close0"] [:: std :: mem :: align_of :: < root :: js :: IsHeapConstructibleType > () - 1usize] ;
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: BarrierMethods_open0_ptr_JSObject_void_close0"]
                [::std::mem::size_of::<root::js::BarrierMethods>() - 1usize];
            ["Align of template specialization: BarrierMethods_open0_ptr_JSObject_void_close0"]
                [::std::mem::align_of::<root::js::BarrierMethods>() - 1usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: BarrierMethods_open0_ptr_JSFunction_void_close0"]
                [::std::mem::size_of::<root::js::BarrierMethods>() - 1usize];
            ["Align of template specialization: BarrierMethods_open0_ptr_JSFunction_void_close0"]
                [::std::mem::align_of::<root::js::BarrierMethods>() - 1usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: BarrierMethods_open0_ptr_JSString_void_close0"]
                [::std::mem::size_of::<root::js::BarrierMethods>() - 1usize];
            ["Align of template specialization: BarrierMethods_open0_ptr_JSString_void_close0"]
                [::std::mem::align_of::<root::js::BarrierMethods>() - 1usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: BarrierMethods_open0_ptr_JSScript_void_close0"]
                [::std::mem::size_of::<root::js::BarrierMethods>() - 1usize];
            ["Align of template specialization: BarrierMethods_open0_ptr_JSScript_void_close0"]
                [::std::mem::align_of::<root::js::BarrierMethods>() - 1usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: BarrierMethods_open0_ptr_BigInt_void_close0"]
